Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Получение вектора, перпендикулярного кривой при заданном параметре в диапазоне между StartParameter() и EndParameter(). Кривая должна быть плоской. Итоговая нормаль будет постоянной по всей кривизне кривой.
param: Параметр для оценки
side: Если side имеет значение false, нормаль будет указывать на правую сторону кривой (если двигаться от начальной точки кривой к конечной). Если side имеет значение true, нормаль будет указывать на левую сторону кривой.
Returns: Вектор, перпендикулярный кривой по параметру
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Получение точек, расположенных с равными интервалами вдоль кривой на заданной длине сегмента от определенной точки
point: Опорная точка, от которой требуется выполнить измерение
segmentLength: Расстояние вдоль кривой, для которого выполняется оценка
Returns: Список точек на кривой, включая заданную точку, вдоль направления кривой.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Получение параметра в заданной точке вдоль кривой. Если точка находится не на кривой, то ParameterAtPoint возвращает значение, которое соответствует расположенной рядом точке на кривой, однако в общем случае эта точка не является ближайшей.
point: Точка на кривой или рядом с ней
Returns: Параметр на кривой для заданной точки.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Создание одной или нескольких кривых путем смещения плоской кривой на заданное расстояние в плоскости, определяемой нормалью. Если между полученными в результате смещения кривыми имеются зазоры, то они могут быть заполнены путем удлинения кривых. Входной аргумент planeNormal по умолчанию соответствует нормали плоскости, содержащей кривую, однако для более точного определения направления смещения можно явно указать линию, параллельную исходной нормали кривой. Например, если для нескольких кривых, имеющих одну плоскость, требуется одинаковое направление смещения, с помощью planeNormal можно переопределить нормали отдельных кривых для принудительного смещения всех кривых в одном направлении. Изменение направления нормали на обратное меняет направление смещения на обратное.
signedDistance: Положительное смещение применяется в направлении векторного произведения касательной к кривой и вектора нормали плоскости, а отрицательное — в противоположном направлении.
planeNormal: Нормаль плоскости кривой. По умолчанию используется нормаль плоскости входной кривой
Returns: Одна или несколько кривых, полученных в результате смещения
thicken,lines
0.5,0.4