Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Создание элемента PolyCurve путем объединения кривых. Положение кривых изменяется для обеспечения возможности соединения. Выберите нужный допуск смыкания поверхности между элементами 1e-6 и 1e-3.
curves: Кривые для объединения в элемент PolyCurve
joinTolerance: Допуск для определения размера допустимого зазора между объединяемыми кривыми
trimCurves: Укажите значение True, если входные кривые пересекают или перекрывают друг друга, из-за чего перед созданием объекта PolyCurve необходимо удалить их конечные сегменты. По умолчанию задано значение False.
trimLength: Если значение trimLength больше 0, конечные сегменты, длина которых превышает значение trimLength, не удаляются.
Returns: Сложная кривая, созданная соединенными кривыми
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Создание одной или нескольких поликривых путем группировки соединенных кривых. Выберите предпочтительный допуск соединения между элементами 1e-6 и 1e-3.
curves: Кривые, которые нужно сгруппировать для создания одного или нескольких объектов PolyCurve
joinTolerance: Допуск для определения размера допустимого зазора между объединяемыми кривыми
trimCurves: Укажите значение True, если входные кривые пересекают или перекрывают друг друга, из-за чего перед созданием объекта PolyCurve необходимо удалить их конечные сегменты. По умолчанию задано значение False.
trimLength: Если значение trimLength больше 0, конечные сегменты, длина которых превышает значение trimLength, не удаляются.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Создание одного или нескольких объектов PolyCurve путем смещения плоской сложной кривой на заданное расстояние в плоскости, определяемой нормалью. Входной аргумент planeNormal по умолчанию соответствует нормали плоскости, содержащей кривую, однако для более точного определения направления смещения можно явно задать линию, параллельную исходной нормали кривой. Например, если для нескольких кривых, имеющих одну плоскость, требуется одинаковое направление смещения, с помощью planeNormal можно переопределить нормали отдельных кривых для принудительного смещения всех кривых в одном направлении. Изменение направления нормали на обратное меняет направление смещения на обратное.
signedDistance: Положительное смещение применяется в направлении векторного произведения касательной к сложной кривой и вектора нормали плоскости, а отрицательное — в противоположном направлении.
extendCircular: Если между кривыми, полученными в результате смещения, есть зазоры, то в зависимости от настроек заполнения зазора они могут быть заполнены либо дугами (если значение равно true), чтобы получить сглаженные углы, либо удлинением кривых (если значение равно false).
planeNormal: Нормаль плоскости кривой. По умолчанию используется нормаль плоскости входной кривой
Returns: Одна или несколько сложных кривых, полученных в результате смещения

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Исправление самопересекающегося объекта PolyCurve путем возврата новой сложной кривой, которая не пересекается сама с собой, если длина перекрывающегося сегмента меньше или равна trimLength.
trimLength: Если значение trimLength больше 0, конечные сегменты, длина которых превышает значение trimLength, не удаляются.
Returns: Неперекрывающийся объект PolyCurve, не пересекающийся сам с собой