Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Обрезка поверхности набором из одного или нескольких замкнутых объектов PolyCurve. Один из контуров должен быть граничным контуром входной поверхности. Кроме того, для отверстий необходимо добавить один или несколько внутренних контуров.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Обрезка поверхности набором из одного или нескольких замкнутых объектов PolyCurve, которые должны лежать на поверхности в пределах заданного допуска. Если у входной поверхности необходимо обрезать одно или несколько отверстий, должен быть задан один внешний контур, определяющий границу поверхности, и один внутренний контур для каждого отверстия. Если необходимо обрезать область между границей поверхности и отверстиями, должен быть задан только контур для каждого отверстия. Для периодической поверхности без внешнего контура, такой как сферическая поверхность, областью обрезки можно управлять, изменив направление кривой контура.
loops: Один или несколько замкнутых объектов PolyCurve в любом порядке ввода. Их контуры не должны пересекаться.
tolerance: Допуск, используемый при определении того, совпадают ли концы кривой и совпадает ли кривая с поверхностью. Этот допуск должен быть не меньше любого из допусков, которые использовались при создании входных сложных кривых. По умолчанию применяется значение 0,0, при котором используется наибольший из допусков, применявшихся при создании входных сложных кривых.
Returns: Поверхность, обрезанная с помощью замкнутых контуров.
trim multiple,removeloops,cutloops