Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Возвращение признака, указывающего на то, содержится ли входная точка в полигоне. Если полигон не является плоским, точка будет спроецирована на вписанную плоскость, а оболочка будет вычислена на основе проекции полигона на вписанную плоскость. Если полигон является самопересекающимся, будет возвращена ошибка.