Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
CoordinateSystem объекта BoundingBox.             Для рамки с выравниванием по оси объект CS ориентируется по осям X, Y и Z и размещается в центре рамки.             Для рамки без выравнивания по оси объект CS ориентируется произвольным образом и размещается в центре рамки.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Получение пересечения двух объектов BoundingBox. Примечание. Это не подходит для рамок без выравнивания по оси, так как их пересечение не всегда является рамкой. Для таких рамок следует получать пересечение между соответствующими им кубоидами.
other: Другая ограничивающая рамка для пересечения
Returns: Ограничивающая рамка, полученная в результате пересечения ограничивающих рамок

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Определение того, пересекаются ли два объекта BoundingBox. Примечание. Это можно использовать, только если оба объекта имеют одинаковое выравнивание (преобразование). В остальных случаях следует проверять пересечение между соответствующими им кубоидами.
other: Другая ограничивающая рамка
Returns: Имеется ли пересечение ограничивающих рамок
get overlap