Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Unable to create a BoundingBox around the input Geometries
cs_cz: Nelze vytvořit objekt BoundingBox kolem vstupních položek Geometry.
es_es: No se puede crear un BoundingBox en torno a las Geometries de entrada
fr_fr: Impossible de créer une BoundingBox autour des Geometries d'entrée
it_it: Impossibile creare BoundingBox intorno alle geometrie di input
pl_pl: Nie można utworzyć BoundingBox wokół geometrii wejściowych
pt_br: Não é possível criar uma BoundingBox em torno das geometrias de entrada
ru_ru: Не удалось создать объект BoundingBox вокруг входных элементов геометрии

source: Bounding box cannot be created because no geometries were provided
cs_cz: Nelze vytvořit hraniční obdélník, protože nebyly poskytnuty žádné geometrie
es_es: No se puede crear el cuadro delimitador porque no se han proporcionado geometrías.
fr_fr: Impossible de créer la zone de délimitation, car aucune géométrie n'a été fournie
it_it: Impossibile estrarre il riquadro di delimitazione perché non sono state fornite geometrie
pl_pl: Nie można utworzyć ramki ograniczającej, ponieważ nie podano geometrii
pt_br: Não é possível criar a caixa delimitadora porque não foram fornecidas geometrias
ru_ru: Невозможно создать ограничивающую рамку, поскольку отсутствуют какие-либо геометрические объекты

source: Bounding box cannot be created as no geometries were provided.
cs_cz: Ohraničující kvádr není možné vytvořit, nebyly zadány žádné geometrie.
es_es: No se puede crear el cuadro delimitador porque no se han proporcionado geometrías.
fr_fr: Impossible de créer la zone de contour, car aucune géométrie n'a été fournie.
it_it: Impossibile creare il riquadro di delimitazione perché non sono state fornite geometrie.
pl_pl: Nie można utworzyć ramki ograniczającej, ponieważ nie podano geometrii.
pt_br: Não é possível criar a caixa delimitadora, pois nenhuma geometria foi fornecida.
ru_ru: Невозможно создать ограничивающую рамку, так как не задан ни один объект геометрии.

source: Unable to create an oriented BoundingBox around the input Geometries
cs_cz: Není možné vytvořit orientovaný objekt BoundingBox kolem vstupních geometrií.
es_es: No se puede crear un BoundingBox orientado alrededor de las geometrías de entrada.
fr_fr: Impossible de créer une zone de contour orientée autour des Géometries d'entrée
it_it: Impossibile creare un elemento BoundingBox orientato attorno alle geometrie di input
pl_pl: Nie można utworzyć zorientowanej ramki ograniczającej wokół geometrii wejściowych
pt_br: Não é possível criar uma BoundingBox orientada em torno das geometrias de entrada
ru_ru: Не удалось создать ориентированный объект BoundingBox вокруг входных объектов геометрии

source: Unable to get the maximum x value.
cs_cz: Nelze získat maximální hodnotu X.
es_es: No se puede obtener el valor máximo de X.
fr_fr: Impossible d'obtenir la valeur X maximum.
it_it: Impossibile ottenere il valore X massimo.
pl_pl: Nie można uzyskać maksymalnej wartości X.
pt_br: Não é possível obter o valor máximo de x.
ru_ru: Не удалось получить максимальное значение x.

source: Unable to get the minimum x value.
cs_cz: Nelze získat minimální hodnotu X.
es_es: No se puede obtener el valor mínimo de X.
fr_fr: Impossible d'obtenir la valeur X minimum.
it_it: Impossibile ottenere il valore X minimo.
pl_pl: Nie można uzyskać minimalnej wartości X.
pt_br: Não é possível obter o valor mínimo de x.
ru_ru: Не удалось получить минимальное значение x.

source: Unable to get the maximum y value.
cs_cz: Nelze získat maximální hodnotu Y.
es_es: No se puede obtener el valor máximo de Y.
fr_fr: Impossible d'obtenir la valeur Y maximum.
it_it: Impossibile ottenere il valore Y massimo.
pl_pl: Nie można uzyskać maksymalnej wartości Y.
pt_br: Não é possível obter o valor máximo de y.
ru_ru: Не удалось получить максимальное значение y.

source: Unable to get the minimum y value.
cs_cz: Nelze získat minimální hodnotu Y.
es_es: No se puede obtener el valor mínimo de Y.
fr_fr: Impossible d'obtenir la valeur Y minimum.
it_it: Impossibile ottenere il valore Y minimo.
pl_pl: Nie można uzyskać minimalnej wartości Y.
pt_br: Não é possível obter o valor mínimo de y.
ru_ru: Не удалось получить минимальное значение y.

source: Unable to get the maximum z value.
cs_cz: Nelze získat maximální hodnotu Z.
es_es: No se puede obtener el valor máximo de Z.
fr_fr: Impossible d'obtenir la valeur Z maximum.
it_it: Impossibile ottenere il valore Z massimo.
pl_pl: Nie można uzyskać maksymalnej wartości Z.
pt_br: Não é possível obter o valor máximo de z.
ru_ru: Не удалось получить максимальное значение z.

source: Unable to get the minimum z value.
cs_cz: Nelze získat minimální hodnotu Z.
es_es: No se puede obtener el valor mínimo de Z.
fr_fr: Impossible d'obtenir la valeur Z minimum.
it_it: Impossibile ottenere il valore Z minimo.
pl_pl: Nie można uzyskać minimalnej wartości Z.
pt_br: Não é possível obter o valor mínimo de z.
ru_ru: Не удалось получить минимальное значение z.

source: Casted object is not a BSplineCurve
cs_cz: Vrhaný objekt není objekt BSplineCurve.
es_es: El objeto proyectado no es una BSplineCurve.
fr_fr: L'objet projeté n'est pas une BSplineCurve
it_it: L'oggetto proiettato non è una BSplineCurve
pl_pl: Rzutowany obiekt nie jest BSplineCurve
pt_br: O objeto projetado não é uma BSplineCurve
ru_ru: Приведенный объект не является элементом BSplineCurve

source: NurbsCurves require degree to be greater than 0
cs_cz: Objekty NurbsCurve vyžadují, aby byl stupeň větší než 0.
es_es: NurbsCurves requiere que el grado sea mayor que 0.
fr_fr: Les NurbsCurves nécessitent que le degré soit supérieur à 0
it_it: Gli elementi NurbsCurve richiedono che il grado sia maggiore di 0
pl_pl: NurbsCurves wymaga, aby stopień był większy niż 0
pt_br: As NurbsCurves requerem que o grau seja maior do que 0
ru_ru: Для объектов NurbsCurves требуется значение кривизны больше 0

source: NurbsCurves require at least 2 points for interpolation
cs_cz: Objekty NurbsCurve vyžadují alespoň 2 body pro interpolaci.
es_es: NurbsCurves requiere al menos 2 puntos para interpolación
fr_fr: Les NurbsCurves requièrent au moins 2 points pour l'interpolation
it_it: Gli elementi NurbsCurve richiedono almeno due punti per l'interpolazione
pl_pl: NurbsCurves wymagają co najmniej 2 punktów do interpolacji
pt_br: As NurbsCurves requerem ao menos dois pontos para a interpolação
ru_ru: Объекты NurbsCurves требуют не менее 2 точек для интерполяции

source: Unable to fit curve to points
cs_cz: Nelze přizpůsobit křivku bodům.
es_es: No se puede ajustar curva a Points
fr_fr: Impossible d'ajuster la courbe par rapport aux points
it_it: Impossibile adattare una curva ai punti
pl_pl: Nie można dopasować krzywej do punktów
pt_br: Não é possível ajustar a curva aos pontos
ru_ru: Не удалось вписать кривую в точки

source: Unable to get curves from curve fit
cs_cz: Nelze získat křivky z vyhlazení křivky.
es_es: No se puede obtener Curves de Curve fit
fr_fr: Impossible d'obtenir les courbes à partir de l'ajustement des courbes
it_it: Impossibile ottenere curve dall'adattamento curva
pl_pl: Nie można pobrać krzywych z dopasowania krzywej
pt_br: Não é possível obter as curvas do ajuste da curva
ru_ru: Не удалось получить кривые на основе вписывания кривых

source: Error creating a nurbs curve!
cs_cz: Chyba při vytváření křivky NURBS.
es_es: Error al crear una curva NURBS.
fr_fr: Erreur lors de la création d'une courbe NURBS.
it_it: Errore durante la creazione di una curva NURBS.
pl_pl: Błąd podczas tworzenia krzywej NURBS!
pt_br: Erro ao criar uma curva Nurbs.
ru_ru: Ошибка при создании NURBS-кривой.

source: NurbsCurves must have at least one more control points than degree
cs_cz: Objekty NurbsCurve musí mít alespoň o jeden řídicí bod více, než určuje stupeň.
es_es: NurbsCurves debe tener al menos un punto de control más que grado
fr_fr: Les NurbsCurves doivent posséder au moins un point de contrôle supplémentaire par rapport au degré
it_it: Gli elementi NurbsCurve devono avere almeno un punto di controllo in più rispetto al grado
pl_pl: NurbsCurves muszą mieć co najmniej o jeden punkt sterujący więcej niż stopień
pt_br: As NurbsCurves devem ter ao menos um ponto de controle a mais do que o grau
ru_ru: Объекты NurbsCurve должны иметь хотя бы на одну управляющую точку больше, чем значение кривизны

source: Unable to create BSplineCurve from vertices
cs_cz: Nelze vytvořit objekt BSplineCurve z vrcholů.
es_es: No se puede crear BSplineCurve a partir de vértices.
fr_fr: Impossible de créer une BSplineCurve à partir des sommets
it_it: Impossibile creare BSplineCurve da vertici
pl_pl: Nie można utworzyć BSplineCurve z wierzchołków
pt_br: Não é possível criar a BSplineCurve com base nos vértices
ru_ru: Не удалось создать объект BSplineCurve из вершин

source: Unable to convert asm_curve to BSplineCurve
cs_cz: Nelze převést objekt asm_curve na objekt BSplineCurve.
es_es: No se puede convertir asm_curve a BSplineCurve
fr_fr: Impossible de convertir asm_curve en BSplineCurve
it_it: Impossibile convertire asm_curve in BSplineCurve
pl_pl: Nie można przekształcić asm_curve na BSplineCurve
pt_br: Não é possível converter asm_curve em SplineCurve
ru_ru: Не удалось преобразовать asm_curve в BSplineCurve

source: Negative extension not supported
cs_cz: Záporné rozšíření není podporováno.
es_es: No se admite extensión negativa
fr_fr: Extension négative non prise en charge
it_it: Estensione negativa non supportata
pl_pl: Ujemne przedłużenie nie jest obsługiwane
pt_br: Extensão negativa não suportada
ru_ru: Отрицательное расширение не поддерживается

source: Could not extend start of the nurbs curve
cs_cz: Nepodařilo se prodloužit začátek křivky NURBS
es_es: No se ha podido ampliar el inicio de la curva NURBS.
fr_fr: Impossible de prolonger le début de la courbe NURBS
it_it: Impossibile estendere l'inizio della curva NURBS
pl_pl: Nie można wydłużyć początku NURBS
pt_br: Não foi possível estender o início da curva Nurbs
ru_ru: Не удалось удлинить начало NURBS-кривой

source: Casted object is not a BSplineSurface
cs_cz: Vrhaný objekt není objekt BSplineSurface.
es_es: El objeto proyectado no es una BSplineSurface
fr_fr: L'objet projeté n'est pas une BSplineSurface
it_it: L'oggetto proiettato non è BSplineSurface
pl_pl: Rzutowany obiekt nie jest BSplineSurface
pt_br: O objeto projetado não é uma BSplineSurface
ru_ru: Приведенный объект не является объектом BSplineSurface

source: Unable to get the FACE's range for NurbsSurface.
cs_cz: Nelze získat rozsah PLOCHY pro hodnotu NurbSurface.
es_es: No se puede obtener el rango de FACE para NurbsSurface.
fr_fr: Impossible d'obtenir l'intervalle de la FACE pour la NurbsSurface.
it_it: Impossibile ottenere l'intervallo della FACCIA per NurbsSurface.
pl_pl: Nie można pobrać zakresu POWIERZCHNI dla NurbsSurface.
pt_br: Não foi possível obter o intervalo da FACE para a NurbsSurface.
ru_ru: Невозможно получить диапазон элемента FACE для NurbsSurface.

source: Underlying Face of Nurbs Surface is null!
cs_cz: Podkládání plochy povrchu NURBS má hodnotu Null.
es_es: La cara subyacente de la superficie NURBS es nula.
fr_fr: La face sous-jacente de la surface NURBS est NULL.
it_it: La faccia sottostante della superficie NURBS è null.
pl_pl: Powierzchnia źródłowa powierzchni NURBS ma wartość null!
pt_br: A face subjacente da superfície Nurbs é nula.
ru_ru: Основная грань поверхности NURBS является нулевой.

source: Unable to create surface from points
cs_cz: Nelze vytvořit položku Surface z bodů.
es_es: No se puede crear Surface a partir de puntos
fr_fr: Impossible de créer une surface à partir de points
it_it: Impossibile creare Surface tramite punti
pl_pl: Nie można utworzyć surface z punktów
pt_br: Não é possível criar a superfície a partir de pontos
ru_ru: Не удалось создать surface из точек

source: Unable to create surface from points and tangents
cs_cz: Nelze vytvořit položku Surface z bodů a tečen.
es_es: No se puede crear Surface a partir de puntos y de tangentes
fr_fr: Impossible de créer une surface à partir de points et de tangentes
it_it: Impossibile creare Surface tramite punti e tangenti
pl_pl: Nie można utworzyć surface z punktów i stycznych
pt_br: Não é possível criar a superfície a partir de pontos e tangentes
ru_ru: Не удалось создать surface из точек и касательных

source: NurbsSurfaces must have at least one more control points than degree
cs_cz: Objekty NurbsSurface musí mít alespoň o jeden řídicí bod více, než určuje stupeň.
es_es: NurbsSurfaces debe tener al menos más puntos de control que grado
fr_fr: Les NurbsSurfaces doivent posséder au moins un point de contrôle supplémentaire par rapport au degré
it_it: Gli elementi NurbsSurface devono avere almeno un punto di controllo in più rispetto al grado
pl_pl: NurbsSurfaces muszą mieć co najmniej o jeden punkt sterujący więcej niż stopień
pt_br: As NurbsSurfaces devem ter pelo menos um ponto de controle a mais do que o grau
ru_ru: Объекты NurbsSurface должны иметь хотя бы на одну управляющую точку больше, чем значение кривизны

source: Unable to create NurbsCurve from control points.
cs_cz: Nelze vytvořit objekt NurbsCurve z řídicích bodů.
es_es: No se puede crear NurbsCurve a partir de puntos de control
fr_fr: Impossible de créer une NurbsCurve à partir des points de contrôle.
it_it: Impossibile creare NurbsCurve mediante punti di controllo.
pl_pl: Nie można utworzyć NurbsCurve z punktów sterujących.
pt_br: Não é possível criar NurbsCurve a partir dos pontos de controle.
ru_ru: Не удалось создать объект NurbsCurve на основе управляющих точек.

source: Unable to create face from spline
cs_cz: Nelze vytvořit plochu z aproximace.
es_es: No se puede crear cara a partir de spline
fr_fr: Impossible de créer la face à partir de la spline
it_it: Impossibile creare una faccia tramite spline
pl_pl: Nie można utworzyć powierzchni ze splajnu
pt_br: Não é possível criar a face a partir da spline
ru_ru: Не удалось создать грань на основе сплайна

source: Casted object is not a Circle
cs_cz: Vrhaný objekt není položka Circle.
es_es: El objeto proyectado no es un Circle
fr_fr: L'objet projeté n'est pas un Circle
it_it: L'oggetto proiettato non è Circle
pl_pl: Rzutowany obiekt nie jest Circle
pt_br: O objeto projetado não é um círculo
ru_ru: Приведенный объект не является объектом Circle

source: Arc by by_best_fit could not best fit arc
cs_cz: Položka Arc by by_best_fit nemohla optimálně zasadit oblouk.
es_es: Arc by by_best_fit no ha podido ajustar arco de ajuste perfecto
fr_fr: Arc by by_best_fit n'a pas pu s'ajuster à l'arc
it_it: Arc by by_best_fit: impossibile adattare l'arco
pl_pl: Arc by_best_fit nie może być najlepiej dopasowany do łuku
pt_br: O arco por melhor ajuste não pôde ajustar melhor o arco
ru_ru: Arc by by_best_fit: не удалось выполнить наилучшее вписывание дуги

source: Circle radius must be non-zero
cs_cz: Poloměr kružnice musí být nenulový.
es_es: El radio de círculo debe ser distinto de cero
fr_fr: Le rayon du cercle doit être différent de zéro.
it_it: Il raggio del cerchio deve essere diverso da zero
pl_pl: Promień okręgu musi być różny od zera
pt_br: O raio do círculo deve ser diferente de zero
ru_ru: Значение радиуса окружности не может быть нулевым

source: Error creating a circle!
cs_cz: Chyba při vytváření kružnice.
es_es: Error al crear un círculo.
fr_fr: Erreur lors de la création d'un cercle.
it_it: Errore durante la creazione di un cerchio.
pl_pl: Błąd podczas tworzenia koła!
pt_br: Erro ao criar um círculo.
ru_ru: Ошибка при создании окружности.

source: Circle normal must be non-zero
cs_cz: Normála kružnice musí být nenulová.
es_es: El círculo normal debe ser distinto de cero
fr_fr: La normale du cercle doit être différente de zéro.
it_it: La normale del cerchio deve essere diversa da zero
pl_pl: Normalna okręgu musi być różna od zera
pt_br: A normal do círculo deve ser diferente de zero
ru_ru: Значение нормали окружности не может быть нулевым

source: Circle major-axis must be non-zero
cs_cz: Hlavní osa kružnice musí být nenulová.
es_es: El eje principal del círculo debe ser distinto a cero.
fr_fr: L'axe majeur du cercle doit être différent de zéro
it_it: L'asse maggiore del cerchio deve essere diverso da zero
pl_pl: Oś główna okręgu musi być niezerowa
pt_br: O eixo maior do círculo deve ser diferente de zero
ru_ru: Значение большой оси окружности не может быть нулевым

source: Casted object is not a Cone
cs_cz: Vrhaný objekt není položka Cone.
es_es: El objeto proyectado no es un Cone
fr_fr: L'objet projeté n'est pas un Cone
it_it: L'oggetto proiettato non è Cone
pl_pl: Rzutowany obiekt nie jest Cone
pt_br: O objeto projetado não é um cone
ru_ru: Приведенный объект не является объектом Cone

source: Error getting edges
cs_cz: Chyba při získávání hran
es_es: Error al obtener aristas
fr_fr: Erreur d'obtention des arêtes
it_it: Errore di restituzione degli spigoli
pl_pl: Błąd podczas pobierania krawędzi
pt_br: Erro ao obter arestas
ru_ru: Ошибка при получении ребер

source: Error getting vertices
cs_cz: Chyba při získávání vrcholů
es_es: Error al obtener vértices
fr_fr: Erreur d'obtention des sommets
it_it: Errore di restituzione dei vertici
pl_pl: Błąd podczas pobierania wierzchołków
pt_br: Erro ao obter vértices
ru_ru: Ошибка при получении вершин

source: Unable to set attrubitues on Cone
cs_cz: Nelze nastavit atributy na položce Cone.
es_es: No se puede establecer atributos en Cone
fr_fr: Impossible de définir les attributs sur le Cone
it_it: Impossibile impostare attributi per Cone
pl_pl: Nie można ustawić atrybutów na Cone
pt_br: Não é possível definir os atributos no cone
ru_ru: Не удалось задать атрибуты Cone

source: Unable to create cone or cylinder
cs_cz: Nelze vytvořit položku Cone nebo Cylinder.
es_es: No se puede crear Cone o Cylinder
fr_fr: Impossible de créer un cone ou un cylinder
it_it: Impossibile creare Cone o Cylinder
pl_pl: Nie można utworzyć cone lub cylinder
pt_br: Não é possível criar um cone ou um cilindro
ru_ru: Не удалось создать cone или cylinder

source: Unable to transform the body!
cs_cz: Nelze transformovat těleso!
es_es: No se puede transformar el cuerpo
fr_fr: Impossible de transformer le corps.
it_it: Impossibile trasformare il corpo.
pl_pl: Nie można przekształcić bryły!
pt_br: Não é possível transformar o corpo!
ru_ru: Не удалось преобразовать тело!

source: Unable to find attributes after transformation
cs_cz: Nelze najít atributy po transformaci.
es_es: No se puede encontrar atributos después de transformación
fr_fr: Impossible de trouver des attributs après la transformation
it_it: Impossibile trovare gli attributi dopo la trasformazione
pl_pl: Nie można znaleźć atrybutów po przekształceniu
pt_br: Não é possível localizar atributos após a transformação
ru_ru: Не удалось найти атрибуты после преобразования

source: Could not get point from vertex
cs_cz: Nelze získat bod z vrcholu.
es_es: No se puede obtener punto de vértice
fr_fr: Impossible d'obtenir le point à partir du sommet
it_it: Impossibile ottenere il punto dal vertice
pl_pl: Nie można pobrać punktu z wierzchołka
pt_br: Não é possível obter o ponto do vértice
ru_ru: Не удалось получить точку в вершине

source: Cast object is not a CoordinateSystem
cs_cz: Vrhaný objekt není objekt CoordinateSystem.
es_es: El objeto proyectado no es un CoordinateSystem
fr_fr: L'objet projeté n'est pas un CoordinateSystem
it_it: L'oggetto proiettato non è CoordinateSystem
pl_pl: Rzutowany obiekt nie jest CoordinateSystem
pt_br: O objeto projetado não é um CoordinateSystem
ru_ru: Приведенный объект не является объектом CoordinateSystem

source: Error creating coordinate system from raw data
cs_cz: Chyba při vytváření koordinačního systému z dat řádku
es_es: Error al crear un sistema de coordenadas a partir de datos sin procesar.
fr_fr: Erreur lors de la création du système de coordonnées à partir des données brutes
it_it: Errore durante la creazione del sistema di coordinate a partire da dati grezzi
pl_pl: Błąd podczas tworzenia układu współrzędnych z nieprzetworzonych danych
pt_br: Erro ao criar o sistema de coordenadas com base nos dados brutos
ru_ru: Ошибка при создании системы координат на основе исходных данных

source: Cast object is not a Cuboid
cs_cz: Vrhaný objekt není položka Cuboid.
es_es: El objeto proyectado no es un Cuboid
fr_fr: L'objet projeté n'est pas un Cuboid
it_it: L'oggetto proiettato non è Cuboid
pl_pl: Rzutowany obiekt nie jest Cuboid
pt_br: O objeto projetado não é um cubóide
ru_ru: Приведенный объект не является объектом Cuboid

source: Error getting vertices!
cs_cz: Chyba při získávání vrcholů
es_es: Error al obtener vértices
fr_fr: Erreur d'obtention des sommets.
it_it: Errore di restituzione dei vertici.
pl_pl: Błąd podczas pobierania wierzchołków!
pt_br: Erro ao obter vértices!
ru_ru: Ошибка при получении вершин!

source: Could not construct Cuboid vertices
cs_cz: Nelze sestavit vrcholy kvádrů.
es_es: No se ha podido generar vértices de Cuboid
fr_fr: Impossible de créer les sommets du Cuboid
it_it: Impossibile definire i vertici di Cuboid
pl_pl: Nie można utworzyć wierzchołków prostopadłościanu
pt_br: Não foi possível construir vértices do cuboide
ru_ru: Не удалось сформировать вершины кубоида

source: Unable to create block
cs_cz: Nelze vytvořit blok.
es_es: No se puede crear bloque
fr_fr: Impossible de créer le bloc
it_it: Impossibile creare il blocco
pl_pl: Nie można utworzyć bloku
pt_br: Não é possível criar o bloco
ru_ru: Не удалось создать блок

source: Could not get Cuboid vertices after transform
cs_cz: Nelze získat vrcholy kvádrů po transformaci.
es_es: No se ha podido obtener vértices de Cuboid después de transformar
fr_fr: Impossible d'obtenir les sommets du Cuboid après transformation
it_it: Impossibile ottenere i vertici di Cuboid dopo la trasformazione
pl_pl: Nie można pobrać wierzchołków prostopadłościanu po przekształceniu
pt_br: Não foi possível obter os vértices do cuboide após a transformação
ru_ru: Не удалось получить вершины кубоида после преобразования

source: Cast object is not a Curve
cs_cz: Vrhaný objekt není křivka.
es_es: El objeto proyectado no es una Curve
fr_fr: L'objet projeté n'est pas une Curve
it_it: L'oggetto proiettato non è una curva
pl_pl: Rzutowany obiekt nie jest krzywą
pt_br: O objeto projetado não é uma curva
ru_ru: Приведенный объект не является кривой

source: Could not test curve equality
cs_cz: Nelze otestovat rovnost křivek
es_es: No se ha podido comprobar la igualdad de curva.
fr_fr: Impossible de tester l'égalité de courbe
it_it: Impossibile verificare l'uguaglianza delle curve
pl_pl: Nie można sprawdzić zrównania krzywej
pt_br: Não foi possível testar a igualdade da curva
ru_ru: Не удалось проверить равенство кривой

source: Unable to find point perpendicular to given point on curve
cs_cz: Nelze najít bod kolmý k danému bodu na křivce
es_es: No se puede encontrar el punto perpendicular al punto especificado en la curva.
fr_fr: Impossible de trouver un point perpendiculaire au point spécifié sur la courbe
it_it: Impossibile trovare il punto perpendicolare al punto specificato sulla curva
pl_pl: Nie można znaleźć punktu prostopadłego do danego punktu na krzywej
pt_br: Não foi possível localizar o ponto perpendicular para um determinado ponto na curva
ru_ru: Невозможно найти точку, перпендикулярную данной точке на кривой

source: Unable to compute tangent at curve
cs_cz: Nelze vypočítat tečnu v položce Curve.
es_es: No se puede calcular tangente en Curve
fr_fr: Impossible de calculer la tangente à la curve
it_it: Impossibile calcolare la tangente a Curve
pl_pl: Nie można obliczyć stycznej na curve
pt_br: Não é possível calcular a tangente na curva
ru_ru: Не удалось рассчитать тангенс на кривой curve
