Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: The provided edges should create equal count of groups
cs_cz: Poskytnuté hrany by měly tvořit stejný počet skupin
es_es: Las aristas especificadas deben crear un número igual de grupos.
fr_fr: Les arêtes indiquées doivent créer un nombre égal de groupes
it_it: I bordi forniti devono creare un numero uguale di gruppi
pl_pl: Podane krawędzie powinny tworzyć równe liczby grup
pt_br: As arestas fornecidas devem criar uma contagem de grupos igual
ru_ru: Заданными ребрами предусмотрено создание одинакового количества групп

source: Failed to merge edges.
cs_cz: Nepodařilo se sloučit hrany.
es_es: No se han podido fusionar las aristas.
fr_fr: Impossible de fusionner les arêtes.
it_it: Impossibile unire i bordi.
pl_pl: Nie powiodło się scalanie krawędzi.
pt_br: Falha ao mesclar as arestas.
ru_ru: Не удалось объединить ребра.

source: The input groups cannot be empty
cs_cz: Vstupní skupiny nesmí být prázdné
es_es: Los grupos de entrada no pueden estar vacíos.
fr_fr: Les groupes d'entrée ne peuvent pas être vides
it_it: I gruppi di input non possono essere vuoti
pl_pl: Grupy danych wejściowych nie mogą być puste
pt_br: Os grupos de entrada não podem estar vazios
ru_ru: Входные группы не могут быть пустыми

source: Only border edges are permitted
cs_cz: Jsou povoleny pouze hraniční hrany
es_es: Solo se permiten aristas de borde.
fr_fr: Seules les arêtes de bordure sont autorisées
it_it: Sono consentiti solo i bordi
pl_pl: Dozwolone są tylko krawędzie graniczne
pt_br: Somente são permitidas arestas da borda
ru_ru: Разрешены только ребра границ

source: Failed fill hole with given inputs
cs_cz: Nepodařilo se vyplnit otvor danými vstupy
es_es: No se ha podido rellenar el agujero con las entradas especificadas.
fr_fr: Impossible de remplir le trou avec les entrées spécifiées
it_it: Impossibile riempire il foro con gli input specificati
pl_pl: Nie powiodło się wypełnienie otworów określonymi danymi wejściowymi
pt_br: Falha ao preencher o furo com as entradas fornecidas
ru_ru: Не удалось заполнить отверстие с помощью указанных входных данных

source: T-Spline doesn't have symmetry
cs_cz: Křivka T-spline nemá symetrii
es_es: T-Spline no tiene simetría
fr_fr: L'élément T-Spline n'a pas de symétrie
it_it: La T-Spline non dispone di una simmetria
pl_pl: T-splajn nie ma symetrii
pt_br: A T-Spline não possui simetria
ru_ru: Для Т-сплайна не задана симметрия

source: Impossible to add symmetry to the t-spline
cs_cz: Není možné přidat symetrii křivce T-spline
es_es: No es posible añadir simetría a T-Spline
fr_fr: Impossible d'ajouter la symétrie à l'élément T-Spline
it_it: Impossibile aggiungere la simmetria alla T-Spline
pl_pl: Nie można dodać symetrii do bryły T-splajn
pt_br: Não é possível adicionar a simetria à T-Spline
ru_ru: Невозможно добавить симметрию на Т-сплайн

source: Unable to find closest point to given geometries
cs_cz: Nelze najít nejbližší bod dané geometrie
es_es: No se puede encontrar el punto más próximo a las geometrías especificadas.
fr_fr: Impossible de trouver le point le plus proche des géométries spécifiées
it_it: Impossibile trovare il punto più vicino per le geometrie specificate
pl_pl: Nie można znaleźć najbliższego punktu w danej geometrii
pt_br: Não é possível localizar o ponto mais próximo para determinadas geometrias
ru_ru: Невозможно найти ближайшую точку к указанным геометрическим объектам

source: Flatten failed. At least 4 vertices is required
cs_cz: Vyrovnání se nezdařilo. Jsou vyžadovány alespoň 4 vrcholy
es_es: Error al aplanar. Se requieren al menos 4 vértices.
fr_fr: Échec de l'aplanissement. Au moins 4 sommets sont requis
it_it: Riduzione della nidificazione non riuscita. È necessario disporre di almeno 4 vertici
pl_pl: Zrównanie nie powiodło się. Wymagane są co najmniej 4 wierzchołki
pt_br: Falha ao aplanar. São necessários pelo menos 4 vértices
ru_ru: Выравнивание не удалось. Требуется по крайней мере 4 вершины

source: Flatten failed. At least 3 vertices is required
cs_cz: Vyrovnání se nezdařilo. Jsou vyžadovány alespoň 3 vrcholy
es_es: Error al aplanar. Se requieren al menos 3 vértices.
fr_fr: Échec de l'aplanissement. Au moins 3 sommets sont requis
it_it: Riduzione della nidificazione non riuscita. È necessario disporre di almeno 3 vertici
pl_pl: Zrównanie nie powiodło się. Wymagane są co najmniej 3 wierzchołki
pt_br: Falha ao aplanar. São necessários pelo menos 3 vértices
ru_ru: Выравнивание не удалось. Требуется по крайней мере 3 вершины

source: Faces with given indices are absent in the surface
cs_cz: V povrchu chybí plochy s danými indexy
es_es: Las caras con los índices especificados no están en la superficie.
fr_fr: La surface ne contient pas de faces avec les index indiqués
it_it: Le facce con gli indici specificati non sono presenti nella superficie
pl_pl: Brak powierzchni o podanych indeksach w powierzchni
pt_br: As faces com determinados índices estão ausentes na superfície
ru_ru: Грани с заданными индексами отсутствуют на поверхности

source: Flipping normals failed.
cs_cz: Obrácení normál se nezdařilo.
es_es: Error al invertir normales.
fr_fr: Échec de l'inversion des normales.
it_it: Inversione delle normali non riuscita.
pl_pl: Nie można odwrócić normalnych.
pt_br: Falha ao inverter normais.
ru_ru: Не удалось обратить нормали.

source: Making uniform failed.
cs_cz: Převod na jednotné se nezdařil.
es_es: Error al establecer como uniforme.
fr_fr: Échec de l'uniformisation.
it_it: Impossibile rendere l'elemento uniforme.
pl_pl: Nie można ujednorodnić.
pt_br: Falha ao tornar uniforme.
ru_ru: Не удалось унифицировать.

source: Knots technically match, but it's probably just roundoff from a seashell
cs_cz: Uzly se technicky shodují, ale pravděpodobně se jedná pouze o zakončení ulitového vzoru
es_es: Los nudos coinciden técnicamente, pero es posible que solo sea el redondeo de una concha.
fr_fr: Techniquement, les noeuds correspondent, mais il s'agit probablement de l'arrondi d'un seashell
it_it: I nodi sono tecnicamente corrispondenti, ma probabilmente sono un semplice arrotondamento da una conchiglia
pl_pl: Węzły są technicznie dopasowane, ale prawdopodobnie jest to tylko zaokrąglenie Seashell
pt_br: Os nós coincidem tecnicamente, mas provavelmente é apenas o arredondamento de uma Seashell
ru_ru: Технически узлы соответствуют друг другу, но, возможно, это просто закругление кривой раковины

source: Seashell isoparm pattern exists, standardization is impossible
cs_cz: Zjištěn ulitový vzor izoparmy, standardizace není možná.
es_es: El patrón de líneas isoparamétricas de concha existe; la normalización es imposible.
fr_fr: Il existe un réseau seashell isoparm, la normalisation est impossible
it_it: Esiste un motivo isoparm di conchiglie. La standardizzazione è impossibile.
pl_pl: Istnieje wzór krzywej izoparametrycznej Seashell. Standaryzacja jest niemożliwa.
pt_br: O padrão Isoparm Seashell existe, a padronização é impossível
ru_ru: Существует образец изопараметрической кривой раковины. Невозможно выполнить стандартизацию.

source: The t-spline is not manifold
cs_cz: Křivka T-spline není rozložená
es_es: T-Spline no es múltiple
fr_fr: L'élément T-Spline n'est pas multiple
it_it: La T-Spline non è manifold
pl_pl: T-splajn nie jest rozgałęziony
pt_br: A T-Spline é não um objeto múltiplo
ru_ru: Т-сплайн не является однородным

source: The matching knots guarantee is not met
cs_cz: Není splněna podmínka odpovídajících uzlů
es_es: No se cumple la garantía de nudos coincidentes.
fr_fr: La garantie de correspondance des noeuds n'est pas satisfaite
it_it: Impossibile garantire la corrispondenza dei nodi
pl_pl: Warunek dopasowania węzłów nie jest spełniony
pt_br: A garantia de nós correspondentes não foi cumprida
ru_ru: Гарантия соответствия узлов не соблюдается

source: The t-spline contains degenerate faces/zero-length edges
cs_cz: Křivka t-spline obsahuje poškozené plochy nebo hrany s nulovou délkou
es_es: T-Spline contiene caras degeneradas o aristas de longitud cero.
fr_fr: La T-Spline contient des faces dégénérées/des arêtes de longueur nulle
it_it: La T-Spline contiene facce degenerate/bordi di lunghezza pari a zero
pl_pl: T-splajn zawiera zdegenerowane powierzchnie/krawędzie o zerowej długości
pt_br: A T-Spline contém faces/arestas com comprimento igual a zero degeneradas
ru_ru: Т-сплайн содержит вырожденные грани или ребра нулевой длины

source: The t-spline contains valence-2 star points
cs_cz: Křivka t-spline obsahuje dvouvalentní neutrální body
es_es: T-Spline contiene puntos de estrella de valencia 2.
fr_fr: La T-Spline contient un nombre pair de points d'étoile
it_it: La T-Spline contiene punti a stella con valenza 2
pl_pl: T-splajn zawiera punkty gwiazdowe 2 stopnia
pt_br: A T-Spline contém pontos de estrela de valência 2
ru_ru: Т-сплайн содержит нулевые точки степени 2

source: Failed to standardize the t-spline
cs_cz: Nepodařilo se standardizovat křivku T-spline
es_es: No se ha podido normalizar la T-Spline.
fr_fr: Échec de la normalisation de l'élément T-Spline
it_it: Impossibile standardizzare la T-Spline
pl_pl: Nie można ustandaryzować T-splajnu
pt_br: Falha durante a padronização da T-Spline
ru_ru: Не удалось стандартизировать Т-сплайн

source: nu and nv should be non-negative
cs_cz: Nelze nastavit položky Curve a Vector k vysunutí
es_es: nu y nv deben ser no negativos.
fr_fr: nu et nv ne doivent pas être négatifs
it_it: I valori nu e nv non devono essere negativi
pl_pl: nu i nv powinny być nieujemne
pt_br: nu e nv devem ser não negativos
ru_ru: Значения nu и nv должны быть положительными

source: Spans parameters shoud be greater or equal to 0
cs_cz: Parametry rozpětí by měly být větší než nebo rovny 0
es_es: Los parámetros de planos deben ser mayores o iguales que 0.
fr_fr: Les paramètres de travées doivent être supérieurs ou égaux à 0
it_it: I parametri delle campate devono essere maggiori di o uguali a 0
pl_pl: Parametry rozpiętości powinny być większe lub równe 0
pt_br: Os parâmetros dos vãos devem ser maiores ou iguais a 0
ru_ru: Значения параметров пролетов должны быть больше или равны 0

source: One of front or back spans number shoud be greater than 0
cs_cz: Jedno z čísel předního nebo zadního rozpětí by mělo být větší než 0
es_es: Uno de los números de tramo frontal o posterior debe ser mayor que 0.
fr_fr: Les travées avant ou les travées arrière doivent être supérieures à 0
it_it: Uno dei numeri delle campate anteriori o posteriori deve essere maggiore di 0
pl_pl: Jedna z przedniej lub tylnej rozpiętości powinna być większa niż 0
pt_br: Um dos números do vão frontal ou traseiro deve ser maior do que 0
ru_ru: Число пролетов спереди или сзади должно быть больше 0

source: Curve extrusion failed
cs_cz: Nepodařilo se vysunout křivku
es_es: Error al extruir la curva.
fr_fr: Échec de l'extrusion de la courbe
it_it: Estrusione della curva non riuscita
pl_pl: Wyciągnięcie krzywej nie powiodło się
pt_br: Falha na extrusão da curva
ru_ru: Выдавливание кривой не удалось

source: Failed to sweep curve into TSpline surface
cs_cz: Nepodařilo se táhnout křivku na povrch TSpline
es_es: No se ha podido barrer la curva en la superficie de T-Spline.
fr_fr: Échec du balayage de la courbe dans la surface T-Spline
it_it: Impossibile eseguire lo sweep della curva nella superficie T-Spline
pl_pl: Nie można przeciągnąć krzywej na powierzchnię T-splajn
pt_br: Falha ao arrastar a curva para a superfície da T-Spline
ru_ru: Не удалось сдвинуть кривую на поверхность Т-сплайна

source: The given surface vector is empty
cs_cz: Daný vektor povrchu je prázdný.
es_es: El vector de superficie especificado está vacío.
fr_fr: Le vecteur de surface indiqué est vide
it_it: Il vettore della superficie specificato è vuoto
pl_pl: Podany wektor powierzchni jest pusty
pt_br: O vetor da superfície fornecida está vazio
ru_ru: Пустой вектор данной поверхности

source: Failed to combine T-spline surfaces
cs_cz: Nepodařilo se spojit povrchy T-spline
es_es: No se han podido combinar las superficies de T-Spline.
fr_fr: Échec de la combinaison des surfaces T-Spline
it_it: Impossibile combinare le superfici T-Spline
pl_pl: Nie można połączyć dwóch powierzchni T-splajn
pt_br: Falha durante a combinação das superfícies da T-Spline
ru_ru: Не удалось объединить Т-сплайновые поверхности

source: The size of the segment counts must be 0, 1, or the curve count
cs_cz: Velikost počtů segmentů musí být 0, 1 nebo počet křivek
es_es: El tamaño del número de segmentos debe ser 0, 1 o el número de curvas.
fr_fr: La taille des nombres de segments doit être égale à 0, 1 ou au nombre de courbes
it_it: La dimensione dei numeri dei segmenti deve essere pari a 0, 1 o al numero delle curve
pl_pl: Liczba segmentów musi być równa 0, 1 lub liczbie krzywych
pt_br: O tamanho das contagens de segmentos deve ser 0, 1 ou a contagem de curvas
ru_ru: Размер счетчиков сегментов должен быть равен 0, 1 или количеству кривых

source: The size of the rotations at the start of the curves must be either 1 or the curve count
cs_cz: Velikost otočení na začátku křivek musí být rovna 1 nebo počtu křivek
es_es: El tamaño de las rotaciones al inicio de las curvas debe ser 1 o el número de curvas.
fr_fr: La taille des rotations au début des courbes doit être égale à 1 ou au nombre de courbes
it_it: La dimensione delle rotazioni all'inizio delle curve deve essere pari a 1 o al numero delle curve
pl_pl: Rozmiar obrotów na początku krzywych musi być równy 1 lub liczbie krzywych
pt_br: O tamanho das rotações no início das curvas deve ser 1 ou a contagem de curvas
ru_ru: Размер поворотов в начале кривых должен быть равен 1 или количеству кривых

source: The size of the rotations at the end of the curves must be either 1 or the curve count
cs_cz: Velikost otočení na konci křivek musí být rovna 1 nebo počtu křivek
es_es: El tamaño de las rotaciones al final de las curvas debe ser 1 o el número de curvas.
fr_fr: La taille des rotations à la fin des courbes doit être égale à 1 ou au nombre de courbes
it_it: La dimensione delle rotazioni alla fine delle curve deve essere pari a 1 o al numero delle curve
pl_pl: Rozmiar obrotów na końcu krzywych musi być równy 1 lub liczbie krzywych
pt_br: O tamanho das rotações no final das curvas deve ser 1 ou a contagem de curvas
ru_ru: Размер поворотов в конце кривых должен быть равен 1 или количеству кривых

source: The size of the radii at the start of the curves must be either 1 or the curve count
cs_cz: Velikost poloměrů na začátku křivek musí být rovna 1 nebo počtu křivek
es_es: El tamaño de los radios al inicio de las curvas debe ser 1 o el número de curvas.
fr_fr: La taille des rayons au début des courbes doit être égale à 1 ou au nombre de courbes
it_it: La dimensione dei raggi all'inizio delle curve deve essere pari a 1 o al numero delle curve
pl_pl: Rozmiar promieni na początku krzywych musi być równy 1 lub liczbie krzywych
pt_br: O tamanho dos raios no início das curvas deve ser 1 ou a contagem de curvas
ru_ru: Размер радиусов в начале кривых должен быть равен 1 или количеству кривых

source: The size of the radii at the end of the curves must be either 1 or the curve count
cs_cz: Velikost poloměrů na konci křivek musí být rovna 1 nebo počtu křivek
es_es: El tamaño de los radios al final de las curvas debe ser 1 o el número de curvas.
fr_fr: La taille des rayons à la fin des courbes doit être égale à 1 ou au nombre de courbes
it_it: La dimensione dei raggi alla fine delle curve deve essere pari a 1 o al numero delle curve
pl_pl: Rozmiar promieni na końcu krzywych musi być równy 1 lub liczbie krzywych
pt_br: O tamanho dos raios no final das curvas deve ser 1 ou a contagem de curvas
ru_ru: Размер радиусов в конце кривых должен быть равен 1 или количеству кривых

source: The size of the positions at the start of the curves must be either 1 or the curve count
cs_cz: Velikost pozic na začátku křivek musí být rovna 1 nebo počtu křivek
es_es: El tamaño de las posiciones al inicio de las curvas debe ser 1 o el número de curvas.
fr_fr: La taille des positions au début des courbes doit être égale à 1 ou au nombre de courbes
it_it: La dimensione delle posizioni all'inizio delle curve deve essere pari a 1 o al numero delle curve
pl_pl: Rozmiar położeń na początku krzywych musi być równy 1 lub liczbie krzywych
pt_br: O tamanho das posições no início das curvas deve ser 1 ou a contagem de curvas
ru_ru: Размер положений в начале кривых должен быть равен 1 или количеству кривых

source: The size of the positions at the end of the curves must be either 1 or the curve count
cs_cz: Velikost pozic na konci křivek musí být rovna 1 nebo počtu křivek
es_es: El tamaño de las posiciones al final de las curvas debe ser 1 o el número de curvas.
fr_fr: La taille des positions à la fin des courbes doit être égale à 1 ou au nombre de courbes
it_it: La dimensione delle posizioni alla fine delle curve deve essere pari a 1 o al numero delle curve
pl_pl: Rozmiar położeń na końcu krzywych musi być równy 1 lub liczbie krzywych
pt_br: O tamanho das posições no final das curvas deve ser 1 ou a contagem de curvas
ru_ru: Размер положений в конце кривых должен быть равен 1 или количеству кривых

source: Failed to initialize a T-Spline Pipe.
cs_cz: Nepodařilo se inicializovat trubku T-Spline
es_es: No se ha podido inicializar una tubería de T-Spline.
fr_fr: Échec de l'initialisation d'une canalisation T-Spline.
it_it: Impossibile inizializzare una tubazione T-Spline.
pl_pl: Nie można zainicjować rury T-splajn.
pt_br: Falha ao inicializar uma tubulação da T-Spline.
ru_ru: Не удалось начать создание Т-сплайновой трубы.

source: Failed to build a T-Spline Pipe.
cs_cz: Nepodařilo se vytvořit trubku T-Spline
es_es: No se ha podido crear una tubería de T-Spline.
fr_fr: Échec de la création d'une canalisation T-Spline.
it_it: Impossibile creare una tubazione T-Spline.
pl_pl: Nie można skonstruować rury T-splajn.
pt_br: Falha ao criar uma tubulação da T-Spline.
ru_ru: Не удалось создать Т-сплайновую трубу.

source: Radius spans should be greater or equal to 3
cs_cz: Rozpětí poloměrů by měla být větší než nebo rovna 3
es_es: Los tramos de radio deben ser mayores o iguales que 3.
fr_fr: Les travées de rayon doivent être supérieures ou égales à 3
it_it: Le campate nel raggio devono essere maggiori di o uguali a 3
pl_pl: Rozpiętości promieni powinny być większe lub równe 3
pt_br: Os vãos do raio devem ser maiores ou iguais a 3
ru_ru: Пролеты по радиусу должны быть больше или равны 3

source: Either radial or axial symmetry is allowed, but not both
cs_cz: Je povolena buď radiální symetrie, nebo osová symetrie, ale nikoli obě
es_es: Se permite la simetría radial o axial, pero no ambas.
fr_fr: Une symétrie radiale ou axiale est autorisée, mais pas les deux
it_it: È consentita una simmetria radiale o assiale, ma non entrambe
pl_pl: Dozwolona jest symetria promieniowa lub osiowa, ale nie obie
pt_br: A simetria radial ou axial é permitida, mas não ambas
ru_ru: Разрешена либо радиальная, либо осевая симметрия, но не обе одновременно

source: Radius spans should be greater than or equal to 4 when X or Y symmetry is selected
cs_cz: Když je vybrána symetrie X nebo Y, rozpětí poloměrů by měla být větší než nebo rovna 4
es_es: Los tramos de radio deben ser mayores o iguales que 4 si se selecciona simetría de X o Y.
fr_fr: Les travées de rayon doivent être supérieures ou égales à 4 lorsqu'une symétrie d'axe X ou Y est sélectionnée
it_it: Le campate nel raggio devono essere maggiori di o uguali a 4 quando è selezionata la simmetria X o Y
pl_pl: Rozpiętości promieni powinny być większe niż lub równe 4, gdy wybrano symetrię X lub Y
pt_br: Os vãos do raio deverão ser maiores ou iguais a 4 quando a simetria X ou Y estiver selecionada
ru_ru: Если выбрана симметрия по оси X или Y, пролеты по радиусу должны быть больше или равны 4

source: Radius spans should be multiple of 4 when X and Y symmetry is selected
cs_cz: Když je vybrána symetrie X a Y, rozpětí poloměrů by měla násobkem 4
es_es: Los tramos de radio deben ser múltiplos de 4 si se selecciona simetría de X e Y.
fr_fr: Les travées de rayon doivent être un multiple de 4 lorsqu'une symétrie d'axe X et Y est sélectionnée
it_it: Le campate nel raggio devono essere multipli di 4 quando è selezionata la simmetria X o Y
pl_pl: Rozpiętości promieni powinny być wielokrotnością 4, gdy wybrano symetrię X i Y
pt_br: Os vãos do raio deverão ser múltiplos de 4 quando a simetria X ou Y estiver selecionada
ru_ru: Если выбрана симметрия по осям X и Y, пролеты по радиусу должны быть кратны 4

source: Faces per span must be greater than or equal to 1 when radial symmetry is selected
cs_cz: Když je vybrána radiální symetrie, počet ploch na rozpětí musí být větší než nebo roven 1
es_es: Las caras por tramo deben ser mayores o iguales que 1 si se selecciona la simetría radial.
fr_fr: Le nombre de faces par travée doit être supérieur ou égal à 1 lorsque la symétrie radiale est sélectionnée
it_it: Le facce per campata devono essere maggiori di o uguali a 1 quando è selezionata la simmetria radiale
pl_pl: Liczba powierzchni na rozpiętość musi być większa lub równa 1, gdy wybrano opcję symetrii promieniowej
pt_br: As faces por vão deverão ser maiores ou iguais a 1 quando a simetria radial estiver selecionada
ru_ru: Если выбрана радиальная симметрия, количество граней на пролет должно быть больше или равно 1

source: T-Spline revolving curve failed
cs_cz: Nepodařilo se otočit křivku T-spline
es_es: Error en curva de revolución de T-Spline
fr_fr: Échec de la courbe pivotante T-Spline
it_it: Rotazione della curva T-Spline non riuscita
pl_pl: Obrót krzywej T-splajn nie powiódł się
pt_br: Falha na curva com rotação da T-Spline
ru_ru: Сбой вращения кривой на Т-сплайновой поверхности

source: Faces valence must be greater than 0.
cs_cz: Valence ploch musí být větší než 0.
es_es: La valencia de caras debe ser mayor que 0.
fr_fr: La valence des faces doit être supérieure à 0.
it_it: La valenza delle facce deve essere maggiore di 0.
pl_pl: Stopień powierzchni musi być większy niż 0.
pt_br: A valência das faces deve ser maior do que 0.
ru_ru: Степень граней должна быть больше 0.

source: Snapping tolerance must be greater than 0.
cs_cz: Tolerance přichycení musí být větší než 0.
es_es: La tolerancia de forzado debe ser mayor que 0.
fr_fr: La tolérance d'accrochage doit être supérieure à 0.
it_it: La tolleranza di snap deve essere maggiore di 0.
pl_pl: Tolerancja przyciągania musi być większa niż 0.
pt_br: A tolerância de snap deve ser maior do que 0.
ru_ru: Допуск привязки должен быть больше 0.

source: Failed to construct a TSpline surface from the given lines
cs_cz: Nepodařilo se vytvořit z daných čar povrch T-Spline
es_es: No se ha podido construir una superficie de T-Spline a partir de las líneas especificadas.
fr_fr: Échec de la construction d'une surface T-Spline à partir des lignes indiquées
it_it: Impossibile costruire una superficie T-Spline dalle linee specificate
pl_pl: Nie można skonstruować powierzchni T-splajn z podanych linii
pt_br: Falha ao criar uma superfície da T-Spline com base nas linhas fornecidas
ru_ru: Не удалось построить Т-сплайновую поверхность из заданных линий

source: Edge can't be creased:
cs_cz: Nelze vyostřit hranu:
es_es: La arista no puede ser con pliegue:
fr_fr: L'arête ne peut pas être pliée:
it_it: Il bordo non può essere sottoposto a triangolazione:
pl_pl: Nie można fałdować krawędzi:
pt_br: Não é possível dobrar a aresta:
ru_ru: Невозможно согнуть ребро:

source: Edge can't be uncreased:
cs_cz: Nelze zrušit vyostření hrany:
es_es: La arista no puede ser sin pliegue:
fr_fr: Le pli de l'arête ne peut pas être annulé:
it_it: La triangolazione del bordo non può essere annullata:
pl_pl: Nie można usunąć fałdowania krawędzi:
pt_br: Não é possível desdobrar a aresta:
ru_ru: Невозможно разогнуть ребро:
