Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Unable to copy the ENTITY
cs_cz: Nelze kopírovat ENTITU.
es_es: No se puede copiar la ENTITY.
fr_fr: Impossible de copier l'ENTITY
it_it: Impossibile copiare l'ENTITÀ
pl_pl: Nie można skopiować elementu
pt_br: Não é possível copiar a ENTIDADE
ru_ru: Не удалось скопировать объект ENTITY

source: cast: object is not of the specified type
cs_cz: vržení: objekt není určený typ
es_es: El objeto proyectado no es del tipo especificado.
fr_fr: L'objet projeté n'est pas du type spécifié
it_it: L'oggetto proiettato non è del tipo specificato
pl_pl: rzutowanie: obiekt nie jest określonego typu
pt_br: projetado: o objeto não é do tipo especificado
ru_ru: Приведение: недействительный тип объекта

source: Unable to multiply Matrix by Vector
cs_cz: Matici nelze vynásobit vektorem.
es_es: No se puede multiplicar matriz por vector
fr_fr: Impossible de multiplier la matrice par le vecteur
it_it: Impossibile moltiplicare la matrice per il vettore
pl_pl: Nie można pomnożyć macierzy przez wektor
pt_br: Não é possível multiplicar a matriz pelo vetor
ru_ru: Не удалось размножить матрицу по вектору

source: Can not get the default history stream!
cs_cz: Nelze získat výchozí tok historie.
es_es: No se puede obtener la secuencia de historial por defecto
fr_fr: Impossible d'obtenir le flux d'historique par défaut.
it_it: Impossibile ottenere il flusso di cronologia di default.
pl_pl: Nie można pobrać domyślnego strumienia historii!
pt_br: Não é possível obter o fluxo do histórico padrão!
ru_ru: Не удалось получить журнал потока по умолчанию!

source: Can not get the history stream of an entity!
cs_cz: Nelze získat tok historie entity.
es_es: No se puede obtener la secuencia de historial de una entidad
fr_fr: Impossible d'obtenir le flux d'historique d'une entité.
it_it: Impossibile ottenere il flusso di cronologia di un'entità.
pl_pl: Nie można pobrać strumienia historii elementu!
pt_br: Não é possível obter o fluxo do histórico de uma entidade!
ru_ru: Не удалось получить журнал потока из объекта!

source: Unable to add faces to body builder
cs_cz: Nelze přidat plochy do generátoru těles.
es_es: No se puede añadir caras a generador de cuerpos
fr_fr: Impossible d'ajouter des faces au générateur de corps
it_it: Impossibile aggiungere facce al generatore del corpo
pl_pl: Nie można dodać powierzchni do kreatora brył
pt_br: Não é possível adicionar faces ao gerador de corpo
ru_ru: Не удалось добавить грани в Конструктор тел

source: Unable to make face body double sided
cs_cz: Nelze vytvořit oboustrannou plochu tělesa.
es_es: No se puede crear cuerpo de cara con dos lados
fr_fr: Impossible de créer un corps de face à deux côtés
it_it: Impossibile creare un corpo a faccia bilaterale
pl_pl: Nie można ustawić dwustronnej powierzchni bryły
pt_br: Não é possível criar o corpo da face com dupla face
ru_ru: Не удалось сделать тело с гранями двусторонним

source: Unable to make body
cs_cz: Nelze vytvořit těleso.
es_es: No se puede crear el cuerpo.
fr_fr: Impossible de créer un corps
it_it: Impossibile creare il corpo
pl_pl: Nie można utworzyć bryły
pt_br: Não é possível criar o corpo
ru_ru: Не удалось создать тело

source: Unable to create planar body
cs_cz: Nelze vytvořit rovinné těleso.
es_es: No se puede crear el cuerpo plano.
fr_fr: Impossible de créer un corps plan
it_it: Impossibile creare il corpo piano
pl_pl: Nie można utworzyć płaskiej bryły
pt_br: Não é possível criar o corpo plano
ru_ru: Не удалось создать плоское тело

source: Error projecting wire on body
cs_cz: Chyba při promítání drátu na těleso
es_es: Error al proyectar cable en cuerpo
fr_fr: Erreur de projection du fil sur le corps
it_it: Errore di proiezione del wire sul corpo
pl_pl: Błąd rzutowania przewodu na bryłę
pt_br: Erro de projeção da fiação no corpo
ru_ru: Ошибка при проецировании провода на тело

source: Error sweep intersecting wire with body
cs_cz: Chyba při vytvoření průsečíku tažení drátu s tělesem
es_es: Error de alambre de intersección de barrido con cuerpo
fr_fr: Erreur d'intersection du balayage du fil avec le corps
it_it: Errore di sweep che interseca il wire con il corpo
pl_pl: Błąd podczas przecinania przeciągnięcia przewodu z bryłą
pt_br: Erro de extrusão por percurso ao interseccionar a fiação com o corpo
ru_ru: Ошибка при сдвиге провода, пересекающего тело

source: Error projecting Point onto Surface!
cs_cz: Chyba při promítání bodu na povrch.
es_es: Error al proyectar un punto sobre una superficie.
fr_fr: Erreur lors de la projection du point sur la surface.
it_it: Errore durante la proiezione di un punto sulla superficie.
pl_pl: Błąd podczas rzutowania punktu na powierzchnię!
pt_br: Erro ao projetar o ponto na superfície.
ru_ru: Ошибка при проецировании точки на поверхность.

source: Error setting contact is collision
cs_cz: Chyba – při nastavování dotyku došlo ke kolizi
es_es: Error al establecer contacto en colisión
fr_fr: Erreur de définition du contact en tant que collision
it_it: Errore di impostazione del contatto come collisione
pl_pl: Błąd ustawiania kontaktu — kolizja
pt_br: Erro ao definir que o contato é uma colisão
ru_ru: Ошибка при настройке соприкосновения: столкновение

source: Error computing collisions
cs_cz: Chyba při výpočtu kolizí
es_es: Error al calcular colisiones
fr_fr: Erreur de calcul de collisions
it_it: Errore di calcolo delle collisioni
pl_pl: Błąd obliczania kolizji
pt_br: Erro ao calcular as colisões
ru_ru: Ошибка при расчете столкновений

source: Could not create planar face
cs_cz: Nelze vytvořit rovinnou plochu.
es_es: No se ha podido crear una cara plana.
fr_fr: Impossible de créer la face plane
it_it: Impossibile creare una faccia piana
pl_pl: Nie można utworzyć płaskiej powierzchni
pt_br: Não foi possível criar a face plana
ru_ru: Не удалось создать плоскую грань

source: Unable to determine if object is non manifold
cs_cz: Nelze určit, zda je objekt objekt nerozložený.
es_es: No se puede determinar si el objeto es no múltiple
fr_fr: Impossible de déterminer si l'objet est non multiple
it_it: Impossibile determinare se l'oggetto è non manifold
pl_pl: Nie można określić, czy obiekt jest niepowielony
pt_br: Não é possível determinar se o objeto não é um bloco múltiplo.
ru_ru: Не удалось определить, является ли объект однородным

source: Unable to create brep from lump
cs_cz: Nelze vytvořit objekt brep z celku.
es_es: No se puede crear BREP a partir de un sólido base.
fr_fr: Impossible de créer la brep à partir d'un bloc
it_it: Impossibile creare la brep da un blocco
pl_pl: Nie można utworzyć reprezentacji bryłowej z bryły
pt_br: Não é possível criar REPRLIMITE com base na fração
ru_ru: Не удалось создать контурное представление из фрагмента

source: Unable to copy the face!
cs_cz: Nelze kopírovat plochu.
es_es: No se puede copiar la cara.
fr_fr: Impossible de copier la face.
it_it: Impossibile copiare la faccia.
pl_pl: Nie można skopiować powierzchni!
pt_br: Não é possível copiar a face.
ru_ru: Не удалось скопировать грань.

source: Error getting the transformation of the face!
cs_cz: Chyba při získávání transformace plochy.
es_es: Error al obtener la transformación de la cara.
fr_fr: Erreur d'obtention de la transformation de la face.
it_it: Errore durante il recupero della trasformazione della faccia.
pl_pl: Błąd podczas pobierania przekształcenia powierzchni!
pt_br: Erro ao obter a transformação da face.
ru_ru: Ошибка при получении преобразования грани.

source: Error applying transformation to the copied face!
cs_cz: Chyba při používání transformace na zkopírovanou plochu
es_es: Error al aplicar la transformación en la cara copiada
fr_fr: Erreur d'application de la transformation à la face copiée.
it_it: Errore durante l'applicazione della trasformazione alla faccia copiata.
pl_pl: Błąd podczas przekształcania skopiowanej powierzchni!
pt_br: Erro ao aplicar a transformação à face copiada!
ru_ru: Ошибка при применении преобразования для скопированной грани!

source: Unable to copy the edge!
cs_cz: Nelze kopírovat hranu.
es_es: No se puede copiar la arista.
fr_fr: Impossible de copier l'arête.
it_it: Impossibile copiare il bordo.
pl_pl: Nie można skopiować krawędzi!
pt_br: Não é possível copiar a aresta.
ru_ru: Не удалось скопировать ребро.

source: Error getting the transformation of the edge!
cs_cz: Chyba při získávání transformace hrany.
es_es: Error al obtener la transformación de la arista.
fr_fr: Erreur d'obtention de la transformation de l'arête.
it_it: Errore durante il recupero della trasformazione del bordo.
pl_pl: Błąd podczas pobierania przekształcenia krawędzi!
pt_br: Erro ao obter a transformação da aresta.
ru_ru: Ошибка при получении преобразования ребра.

source: Error applying transformation to the copied edge!
cs_cz: Chyba při použití transformace na zkopírovanou hranu.
es_es: Error al aplicar la transformación en la arista copiada.
fr_fr: Erreur d'application de la transformation à l'arête copiée.
it_it: Errore durante l'applicazione della trasformazione al bordo copiato.
pl_pl: Błąd podczas przekształcania skopiowanej krawędzi!
pt_br: Erro ao aplicar a transformação à aresta copiada.
ru_ru: Ошибка при применении преобразования для скопированного ребра.

source: Could not remove attribute from ENTITY
cs_cz: Nelze odstranit atribut z ENTITY.
es_es: No se ha podido eliminar el atributo de ENTITY.
fr_fr: Impossible de supprimer l'attribut de l'ENTITY
it_it: Impossibile rimuovere l'attributo dall'ENTITÀ
pl_pl: Nie można usunąć atrybutu z elementu
pt_br: Não foi possível remover o atributo da ENTIDADE
ru_ru: Не удалось удалить атрибут из объекта ENTITY

source: Error adding a named attribute!
cs_cz: Chyba při přidávání pojmenovaného atributu.
es_es: Error al añadir un atributo de nombre.
fr_fr: Erreur d'ajout d'un attribut nommé.
it_it: Errore durante l'aggiunta di un attributo con nome.
pl_pl: Błąd podczas dodawania nazwanego atrybutu!
pt_br: Erro ao adicionar um atributo nomeado.
ru_ru: Ошибка при добавлении атрибута с именем.

source: Error finding attributes for a given name!
cs_cz: Chyba při hledání atributů pro daný název
es_es: Error al buscar atributos de un determinado nombre
fr_fr: Erreur de recherche des attributs d'un nom donné.
it_it: Errore di individuazione degli attributi per un determinato nome.
pl_pl: Błąd wyszukiwania atrybutów dla danej nazwy!
pt_br: Erro ao localizar atributos de um determinado nome!
ru_ru: Ошибка при поиске атрибутов для данного имени!

source: Error getting the value of the attribute!
cs_cz: Chyba při získávání hodnoty atributu.
es_es: Error al obtener el valor del atributo.
fr_fr: Erreur d'obtention de la valeur de l'attribut.
it_it: Errore durante il recupero del valore dell'attributo.
pl_pl: Błąd podczas pobierania wartości atrybutu!
pt_br: Erro ao obter o valor do atributo.
ru_ru: Ошибка при получении значения атрибута.

source: Error finding attributes from BODY.
cs_cz: Chyba při hledání atribut z TĚLESA.
es_es: Error al buscar atributos desde BODY.
fr_fr: Erreur de recherche des attributs à partir du BODY.
it_it: Errore durante la ricerca di attributi del CORPO.
pl_pl: Błąd podczas wyszukiwania atrybutów z BRYŁY.
pt_br: Erro ao localizar os atributos de CORPO.
ru_ru: Ошибка при поиске атрибутов из элемента BODY.

source: Error getting the name of the attribute!
cs_cz: Chyba při získávání názvu atributu.
es_es: Error al obtener el nombre del atributo.
fr_fr: Erreur lors de l'obtention du nom de l'attribut.
it_it: Errore durante il recupero del nome dell'attributo.
pl_pl: Błąd podczas pobierania nazwy atrybutu!
pt_br: Erro ao obter o nome do atributo.
ru_ru: Ошибка при получении имени атрибута.

source: The number of attributes is not one!
cs_cz: Počet atributů není jedna.
es_es: El número de atributos no es uno.
fr_fr: Le nombre d'attributs n'est pas égal à un.
it_it: Il numero di attributi non è uno.
pl_pl: Liczba atrybutów nie wynosi jeden!
pt_br: O número de atributos não é um.
ru_ru: Количество атрибутов не равно единице.

source: Error setting the value of the attribute!
cs_cz: Chyba při nastavení hodnoty atributu.
es_es: Error al establecer el valor del atributo.
fr_fr: Erreur de définition de la valeur de l'attribut.
it_it: Errore durante l'ipostazione del valore dell'attributo.
pl_pl: Błąd ustawiania wartości atrybutu!
pt_br: Erro ao definir o valor do atributo.
ru_ru: Ошибка при задании значения атрибута.

source: Error setting color attributes!
cs_cz: Chyba při nastavení atributů barev.
es_es: Error al definir atributos de color.
fr_fr: Erreur lors de la définition des attributs de couleur.
it_it: Errore durante l'impostazione degli attributi di colore.
pl_pl: Błąd ustawiania atrybutów koloru!
pt_br: Erro ao definir os atributos de cor.
ru_ru: Ошибка при настройке атрибутов цвета.

source: Failed to approximate curve
cs_cz: Nepodařilo se aproximovat křivku
es_es: No se ha podido aproximar la curva.
fr_fr: Impossible d'obtenir la courbe approximative
it_it: Approssimazione curva non riuscita
pl_pl: Nie udało się uśrednić krzywej
pt_br: Falha ao aproximar a curva
ru_ru: Не удалось аппроксимировать кривую

source: Casted object is not an Arc
cs_cz: Vrhaný objekt není položka Arc.
es_es: El objeto proyectado no es un Arc
fr_fr: L'objet projeté n'est pas un Arc
it_it: L'oggetto proiettato non è Arc
pl_pl: Rzutowany obiekt nie jest Arc
pt_br: O objeto projetado não é um Arc
ru_ru: Приведенный объект не является объектом Arc

source: Error creating an arc!
cs_cz: Chyba při vytváření oblouku
es_es: Error al crear un arco.
fr_fr: Erreur lors de la création d'un arc.
it_it: Errore durante la creazione di un arco.
pl_pl: Błąd tworzenia łuku!
pt_br: Erro ao criar um arco!
ru_ru: Ошибка при создании дуги!

source: Error creating an arc! Start angle cannot be the same as end angle
cs_cz: Chyba při vytváření oblouku Počáteční úhel nemůže být stejný jako koncový úhel.
es_es: Error al crear un arco. El ángulo inicial y el ángulo final no pueden ser el mismo
fr_fr: Erreur lors de la création d'un arc. L'angle de départ ne peut pas être identique à l'angle de fin
it_it: Errore durante la creazione di un arco. L'angolo iniziale non può coincidere con l'angolo finale
pl_pl: Błąd tworzenia łuku! Kąt początkowy nie może być taki sam jak kąt końcowy
pt_br: Erro ao criar um arco! O ângulo inicial não pode ser igual ao ângulo final
ru_ru: Ошибка при создании дуги! Начальный угол не может быть равен конечному углу

source: Error creating an arc! Sweep angle must be non-zero
cs_cz: Chyba při vytváření oblouku Úhel tažení musí být nenulový
es_es: Error al crear un arco. El ángulo de barrido debe ser distinto a cero.
fr_fr: Erreur lors de la création d'un arc. L'angle de balayage doit être différent de zéro
it_it: Errore durante la creazione di un arco. L'angolo di sweep deve essere diverso da zero
pl_pl: Błąd tworzenia łuku! Kąt przeciągnięcia musi być różny od zera
pt_br: Erro ao criar um arco. O ângulo de varredura deve ser diferente de zero
ru_ru: Ошибка при создании дуги. Угол сдвига должен быть ненулевым

source: Cannot create an Arc with the given input points.
cs_cz: Nelze vytvořit oblouk s danými vstupními body.
es_es: No se puede crear un arco con los puntos de entrada especificados.
fr_fr: Impossible de créer un arc avec les points spécifiés en entrée.
it_it: Impossibile creare un arco con i punti di input specificati.
pl_pl: Nie można utworzyć łuku z podanymi punktami wejściowymi.
pt_br: Não é possível criar um arco com os pontos de entrada fornecidos.
ru_ru: Невозможно создать дугу с данными входными точками.

source: Cannot create an Arc with a null input object.
cs_cz: Nelze vytvořit oblouk se vstupním objektem, který má hodnotu Null.
es_es: No se puede crear un arco con un objeto de entrada nulo.
fr_fr: Impossible de créer un arc avec un objet NULL en entrée.
it_it: Impossibile creare un arco con un oggetto di input null.
pl_pl: Nie można utworzyć łuku z obiektem wejściowym null.
pt_br: Não é possível criar um arco com um objeto de entrada nulo.
ru_ru: Невозможно создать дугу с нулевым входным объектом.

source: Unable to extend curve equally. Curves differ by:
cs_cz: Nelze rovnoměrně prodloužit položku Curve. Položky Curve se liší podle:
es_es: No se puede alargar la Curve de manera uniforme. Las Curves se diferencian por:
fr_fr: Impossible de prolonger la curve de manière égale. Les Curves diffèrent par:
it_it: Impossibile estendere Curve in modo uniforme. Le curve si differenziano per:
pl_pl: Nie można wydłużyć curve równomiernie. Curves różnią się pod względem:
pt_br: Não é possível estender a curva por igual. As curvas diferem por:
ru_ru: Не удалось равномерно удлинить curve. Кривые Curves отличаются по:

source: Arc by fillet: ends of curves on equal distance, could not orient arc. Please trim curves to determine orientation based on closest ends
cs_cz: Arc by fillet: konce křivek ve stejné vzdálenosti, nelze orientovat oblouk. Proveďte oříznutí položek Curves, abyste určili orientaci na základě nejbližších konců.
es_es: Arc by fillet: extremos de curvas de distancia igual, no se ha podido orientar arco. Recorte Curves para determinar orientación basada en extremos más próximos
fr_fr: Arc by fillet: extrémités des courbes à égale distance, impossible d'orienter l'arc. Veuillez ajuster les courbes pour déterminer l'orientation en fonction des extrémités les plus proches
it_it: Arc by fillet: le estremità delle curve sono alla stessa distanza. Impossibile orientare l'arco. Ritagliare gli oggetti Curve per determinare l'orientamento sulla base delle estremità più prossime
pl_pl: Arc by fillet: końce krzywych w równej odległości, nie można zorientować łuku. Należy przyciąć curves, aby określić orientację na podstawie najbliższych końców
pt_br: Arco em concordância: não foi possível reorientar o arco nas extremidades de curvas na mesma distância. Apare as curvas curvas para determinar a orientação com base nas extremidades mais próximas
ru_ru: Arc by fillet: концы кривых находятся на равном расстоянии, не удалось настроить ориентацию дуги. Обрежьте curves вручную для определения ориентации на основе ближайших концов

source: Arc by fillet failed
cs_cz: Provedení položky Arc by fillet se nezdařilo.
es_es: Error de Arc by fillet
fr_fr: Echec d'Arc by fillet
it_it: Arc by fillet non riuscito
pl_pl: Operacja Arc by fillet nie powiodła się
pt_br: Falha ao criar um arco por concordância
ru_ru: Arc by fillet: сбой

source: Arc by fillet could not be computed
cs_cz: Položku Arc by fillet nebylo možné vypočítat.
es_es: No se ha podido calcular Arc by fillet.
fr_fr: Echec du calcul d'Arc by fillet
it_it: Impossibile calcolare l'arco tramite raccordo
pl_pl: Nie można obliczyć łuku przez zaokrąglenie
pt_br: O arco em concordância não pôde ser calculado
ru_ru: Arc by fillet: не удалось рассчитать

source: Arc by by_fillet_tangent_to_curve failed
cs_cz: Provedení položky Arc by by_fillet_tangent_to_curve se nezdařilo.
es_es: Error de Arc by by_fillet_tangent_to_curve
fr_fr: Echec d'Arc by by_fillet_tangent_to_curve
it_it: Arc by by_fillet_tangent_to_curve non riuscito
pl_pl: Operacja Arc by_fillet_tangent_to_curve nie powiodła się
pt_br: Falha do arco em concordância tangente a curva
ru_ru: Arc by by_fillet_tangent_to_curve: сбой

source: could not solve for arc
cs_cz: Nelze vyřešit pro oblouk.
es_es: no se ha podido resolver para arco
fr_fr: impossible de résoudre pour l'arc
it_it: soluzione non disponibile per l'arco
pl_pl: nie można znaleźć rozwiązania dla łuku
pt_br: não foi possível solucionar para o arco
ru_ru: расчет дуги не удался

source: Arc by by_best_fit needs 3 or more points
cs_cz: Položka Arc by by_best_fit vyžaduje tři nebo více bodů.
es_es: Arc by by_best_fit requiere 3 o más puntos
fr_fr: Arc by by_best_fit requiert 3 points au minimum
it_it: Arc by by_best_fit richiede almeno 3 punti
pl_pl: Arc by_best_fit wymaga co najmniej 3 punktów
pt_br: O arco por melhor ajuste precisa de 3 ou mais pontos
ru_ru: Arc by by_best_fit: требуется 3 точки или более

source: Arc by by_best_fit could not determine plane for arc
cs_cz: Položka Arc by by_best_fit nemohla určit rovinu pro oblouk.
es_es: Arc by by_best_fit no ha podido determinar plano para arco
fr_fr: Arc by by_best_fit n'a pas pu déterminer un plan pour l'arc
it_it: Arc by by_best_fit: impossibile determinare il piano per l'arco
pl_pl: Arc by_best_fit nie może określić płaszczyzny dla łuku
pt_br: O arco por melhor ajuste não pôde determinar o plano para o arco.
ru_ru: Arc by by_best_fit: не удалось определить плоскость для дуги

source: tangent vectors should be coplanar relatie to points to make bi_arc
cs_cz: tečné vektory by měly koplanárně souviset s body za účelem vytvoření objektu bi_arc.
es_es: los vectores tangentes deben ser coplanares respecto a puntos para realizar bi_arc
fr_fr: les vecteurs tangents doivent être coplanaires par rapport aux points pour créer bi_arc
it_it: Per la creazione di un doppio arco, i vettori tangenti devono essere complanari rispetto ai punti
pl_pl: wektory styczne powinny być współpłaszczyznowe względem punktów, aby utworzyć bi_arc
pt_br: os vetores de tangente devem ser coplanares em relação aos pontos para criar o bi-arco
ru_ru: для создания bi_arc векторы касательных должны быть расположены копланарно относительно точек

source: Cannot build bi arc for coincident lines
cs_cz: Nelze vytvořit oblouk BI pro souběžné čáry.
es_es: No se puede generar bi_arc para líneas coincidentes
fr_fr: Impossible de créer bi_arc pour les lignes coïncidentes
it_it: Impossibile costruire un doppio arco per linee coincidenti
pl_pl: Nie można utworzyć łuku podwójnego dla pokrywających się linii
pt_br: Não é possível construir o arco bi para linhas coincidentes
ru_ru: Не удается создать двойную дугу для совпадающих линий

source: Cannot build bi arc facing corner of tangent intersections
cs_cz: Nelze vytvořit oblouk BI proti rohu průsečíků tečen.
es_es: No se puede generar bi_arc orientado a esquina de intersecciones tangentes
fr_fr: Impossible de créer bi_arc orienté vers le coin des intersections tangentes
it_it: Impossibile costruire un doppio arco rivolto verso l'angolo delle intersezioni di tangenti
pl_pl: Nie można utworzyć łuku podwójnego skierowanego na narożnik przecięć stycznych
pt_br: Não é possível construir o arco bi faceando o canto das intersecções tangentes
ru_ru: Не удается создать двойную дугу по углу пересечения прямых участков

source: Error creating arc! End point lies in direction of Tangent vector
cs_cz: Chyba při vytváření oblouku. Koncový bod leží ve směru tečného vektoru
es_es: Error al crear un arco. El punto final está en la dirección del vector de tangente.
fr_fr: Erreur lors de la création de l'arc. Le point de fin se trouve dans la direction du vecteur de tangente
it_it: Errore durante la creazione di un arco. Il punto finale si trova in direzione del vettore tangente
pl_pl: Błąd podczas tworzenia łuku! Punkt końcowy znajduje się w kierunku wektora styczności
pt_br: Erro ao criar o arco. O ponto final está na direção do vetor da tangente
ru_ru: Ошибка при создании дуги. Конечная точка лежит в направлении вектора Tangent

source: Unable to create a BoundingBox around the input Geometry
cs_cz: Nelze vytvořit objekt BoundingBox kolem vstupní položky Geometry.
es_es: No se puede crear un BoundingBox en torno a la Geometry de entrada
fr_fr: Impossible de créer une BoundingBox autour de la Geometry d'entrée
it_it: Impossibile creare BoundingBox intorno alla geometria di input
pl_pl: Nie można utworzyć BoundingBox wokół geometrii wejściowej
pt_br: Não é possível criar uma BoundingBox em torno da geometria de entrada
ru_ru: Не удалось создать объект BoundingBox вокруг входной геометрии
