Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Failed to offset polycurve. Result of offset is an empty list.
cs_cz: Nepodařilo se odsadit objekt PolyCurve. Výsledkem odsazení je prázdný seznam.
es_es: No se ha podido desfasar la PolyCurve. El resultado del desfase es una lista vacía.
fr_fr: Échec du décalage de la polycourbe. Le résultat du décalage est une liste vide.
it_it: Impossibile eseguire l'offset di PolyCurve. Il risultato dell'offset è un elenco vuoto.
pl_pl: Nie można odsunąć krzywej PolyCurve. Wynik odsunięcia jest pustą listą.
pt_br: Falha durante o deslocamento da PolyCurve. O resultado do deslocamento é uma lista vazia.
ru_ru: Не удалось сместить сложную кривую. Результат смещения является пустым списком.

source: Failed to offset polycurve. Offset produces more than one WIRE.
cs_cz: Nepodařilo se odsadit objekt PolyCurve. Odsazení vytvoří více než jeden objekt WIRE.
es_es: No se ha podido desfasar la PolyCurve. El desfase genera más de un CABLE.
fr_fr: Échec du décalage de la polycourbe. Le décalage produit plus d'un FIL.
it_it: Impossibile eseguire l'offset di PolyCurve. L'offset produce più di un WIRE.
pl_pl: Nie można odsunąć krzywej PolyCurve. Odsunięcie tworzy więcej niż jeden PRZEWÓD.
pt_br: Falha durante o deslocamento da PolyCurve. O deslocamento produz mais de um FIO.
ru_ru: Не удалось сместить сложную кривую. В результате смещения создается несколько элементов WIRE.

source: Failed to fillet polycurve.
cs_cz: Nepodařilo se zaoblit objekt PolyCurve.
es_es: No se ha podido empalmar la PolyCurve.
fr_fr: Échec du raccord de la polycourbe.
it_it: Impossibile raccordare PolyCurve.
pl_pl: Nie można zaokrąglić krzywej PolyCurve.
pt_br: Falha durante o arredondamento da PolyCurve.
ru_ru: Не удалось выполнить сопряжение сложной кривой.

source: The number of divisions is too large or the length of the curve is too small. Failed to compute points on polycurve.
cs_cz: Počet dělení je příliš velký nebo je délka křivky příliš krátká. Není možné vypočítat body na objektu PolyCurve.
es_es: El número de divisiones es demasiado grande o la longitud de la curva es demasiado pequeña. No se han podido calcular los puntos en la PolyCurve.
fr_fr: Le nombre de divisions est trop grand ou la longueur de la courbe est trop petite. Échec du calcul des points sur la polycourbe.
it_it: Il numero di divisioni è troppo grande o la lunghezza della curva è troppo piccola. Impossibile calcolare i punti sulla PolyCurve.
pl_pl: Liczba podziałów jest zbyt duża lub długość krzywej jest zbyt mała. Nie można obliczyć punktów na krzywej PolyCurve.
pt_br: O número de divisões é muito grande ou o comprimento da curva é muito pequeno. Falha durante o cálculo dos pontos na PolyCurve.
ru_ru: Число делений слишком велико или длина кривой слишком мала. Не удалось вычислить точки на сложной кривой.

source: Failed to compute parameter of polycurve for given length.
cs_cz: Nepodařilo se vypočítat parametr objektu PolyCurve pro danou délku.
es_es: No se ha podido calcular el parámetro de PolyCurve para la longitud especificada.
fr_fr: Échec du calcul du paramètre de la polycourbe pour la longueur donnée.
it_it: Impossibile calcolare il parametro della PolyCurve per la lunghezza specificata.
pl_pl: Nie można obliczyć parametru krzywej PolyCurve dla danej długości.
pt_br: Falha durante o cálculo do parâmetro da PolyCurve para o comprimento especificado.
ru_ru: Не удалось вычислить параметр сложной кривой для заданной длины.

source: Input segment length must be greater or equal to zero
cs_cz: Délka vstupního úseku musí být větší nebo rovna nule.
es_es: La longitud del segmento de entrada debe ser mayor o igual que cero.
fr_fr: La longueur du segment d'entrée doit être supérieure ou égale à zéro
it_it: La lunghezza del segmento di input deve essere maggiore di o uguale a zero
pl_pl: Długość segmentu wejściowego musi być co najmniej równa zero
pt_br: O comprimento do segmento de entrada deve ser maior ou igual a zero
ru_ru: Входное значение длины сегмента должно быть больше или равно 0

source: Unable to calculate point on polycurve.
cs_cz: Není možné vypočítat bod na objektu Polycurve.
es_es: No se puede calcular el punto en la PolyCurve.
fr_fr: Impossible de calculer le point sur la polycourbe.
it_it: Impossibile calcolare il punto sulla PolyCurve.
pl_pl: Nie można obliczyć punktu na krzywej PolyCurve.
pt_br: Não é possível calcular o ponto na PolyCurve.
ru_ru: Не удалось вычислить точку на сложной кривой.

source: Unable to compute points at equal chord length on PolyCurve.
cs_cz: Není možné vypočítat body u stejné délky tětivy na objektu PolyCurve.
es_es: No se pueden calcular puntos con la misma longitud de cuerda en la PolyCurve.
fr_fr: Impossible de calculer des points à longueur de corde égale sur la polycourbe.
it_it: Impossibile calcolare i punti alla stessa lunghezza della corda su PolyCurve.
pl_pl: Nie można obliczyć punktów w równych długościach cięciwy na krzywej PolyCurve.
pt_br: Não é possível calcular pontos com comprimento de corda igual na PolyCurve.
ru_ru: Не удалось вычислить точки с одинаковой длиной хорды на PolyCurve.

source: Failed to compute points at chord length from point. Input chord length must be greater than zero.
cs_cz: Nepodařilo se vypočítat body na délce tětivy od bodu. Vstupní délka tětivy musí být větší než nula.
es_es: No se han podido calcular puntos en la longitud de cuerda desde el punto. La longitud de cuerda de entrada debe ser superior a cero.
fr_fr: Échec du calcul des points à la longueur de corde à partir du point. La longueur de corde entrée doit être supérieure à zéro.
it_it: Impossibile calcolare i punti in corrispondenza della lunghezza della corda dal punto. La lunghezza della corda di input deve essere maggiore di zero.
pl_pl: Nie można obliczyć punktów na długości cięciwy od punktu. Długość cięciwy wejściowej musi być większa od zera.
pt_br: Falha durante o cálculo de pontos no comprimento de corda com base no ponto. O comprimento da corda de entrada deve ser maior que zero.
ru_ru: Не удалось вычислить точки с заданной длиной хорды от указанной точки. Входное значение длины хорды должно быть больше нуля.

source: Failed to compute points at chord length from point.
cs_cz: Nepodařilo se vypočítat body na délce tětivy od bodu.
es_es: No se han podido calcular puntos en la longitud de cuerda desde el punto.
fr_fr: Échec du calcul des points à la longueur de corde à partir du point.
it_it: Impossibile calcolare i punti in corrispondenza della lunghezza della corda dal punto.
pl_pl: Nie można obliczyć punktów w długości cięciwy od punktu.
pt_br: Falha durante o cálculo de pontos no comprimento de corda com base no ponto.
ru_ru: Не удалось вычислить точки с заданной длиной хорды от указанной точки.

source: Cast object is not a Polygon
cs_cz: Vrhaný objekt není položka Polygon.
es_es: El objeto proyectado no es un Polygon
fr_fr: L'objet projeté n'est pas un Polygon
it_it: L'oggetto proiettato non è Polygon
pl_pl: Przekształcony obiekt nie jest Polygon
pt_br: O objeto projetado não é um polígono
ru_ru: Приведенный объект не является объектом Polygon

source: You must supply more than 2 points to create a polygon
cs_cz: Aby mohl být vytvořen polygon, je nutné zadat více než dva body.
es_es: Debe proporcionar más de 2 puntos para crear un polígono
fr_fr: Vous devez fournir plus de 2 points pour créer un polygone
it_it: È necessario fornire più di due punti per creare un poligono
pl_pl: Należy podać więcej niż 2 punkty, aby utworzyć wielobok
pt_br: É preciso fornecer mais de dois pontos para criar um polígono
ru_ru: Чтобы создать полигон, необходимо указать более двух точек

source: Failed to construct a Polygon from the input points.
cs_cz: Nepodařilo se vytvořit polygon ze vstupních bodů.
es_es: No se ha podido construir un polígono a partir de los puntos de entrada.
fr_fr: Échec de la construction d'un polygone à partir des points d'entrée.
it_it: Impossibile costruire un poligono dai punti di input.
pl_pl: Nie można utworzyć wieloboku z punktów wejściowych.
pt_br: Falha durante a criação e um polígono com base nos pontos de entrada.
ru_ru: Не удалось построить объект Polygon из входных точек.

source: Failed to compute max deviation of Polygon from best fit plane.
cs_cz: Nepodařilo se vypočítat maximální odchylku polygonu od přizpůsobené roviny.
es_es: No se ha podido calcular la desviación máx. del polígono desde el plano de ajuste óptimo.
fr_fr: Échec du calcul de la déviation maximale du polygone à partir du plan ajusté au mieux.
it_it: Impossibile calcolare la deviazione massima del poligono dal piano di adattamento non riuscito.
pl_pl: Nie można obliczyć maksymalnego odchylenia wieloboku od płaszczyzny najlepszego dopasowania.
pt_br: Falha durante o cálculo do desvio máximo do polígono do plano de melhor ajuste.
ru_ru: Не удалось рассчитать максимальное отклонение Polygon от вписанной плоскости.

source: Could not text containment for non-planar polygon
cs_cz: Nelze provést omezení textu pro nerovinný polygon.
es_es: No se ha podido escribir contención para polígonos no planos
fr_fr: Impossible d'écrire le cheminement pour le polygone non plan
it_it: Impossibile definire il contenimento per un poligono non piano
pl_pl: Nie udało się zawrzeć tekstu dla niepłaskiego wieloboku
pt_br: Não foi possível efetuar a contenção de texto do polígono não plano
ru_ru: Не удалось проверить оболочку неплоского полигона

source: Could not text containment for self-intersecting polygon
cs_cz: Nelze provést omezení textu pro polygon, který protíná sám sebe.
es_es: No se ha podido escribir contención para polígono autointersecante
fr_fr: Impossible d'écrire le cheminement pour le polygone s'entrecoupant
it_it: Impossibile definire il contenimento per un poligono autointersecante
pl_pl: Nie udało się zawrzeć tekstu dla samoprzecinającego się wieloboku
pt_br: Não foi possível efetuar a contenção de texto do polígono com autointersecção
ru_ru: Не удалось проверить оболочку самопересекающегося полигона

source: Regular polygon should have 3 or more sides
cs_cz: Pravidelný polygon by měl mít 3 nebo více stran
es_es: Los polígonos normales deben tener tres o más lados.
fr_fr: Un polygone régulier doit avoir au moins 3 côtés
it_it: Un poligono regolare deve avere 3 o più lati
pl_pl: Wielobok foremny powinien mieć co najmniej 3 boki
pt_br: O polígono regular deve ter 3 lados ou mais
ru_ru: Правильный полигон имеет 3 или более сторон

source: Cast object is not a PolyMesh
cs_cz: Vrhaný objekt není objekt PolyMesh.
es_es: El objeto proyectado no es una PolyMesh
fr_fr: L'objet projeté n'est pas un PolyMesh
it_it: L'oggetto proiettato non è PolyMesh
pl_pl: Rzutowany obiekt nie jest PolyMesh
pt_br: O objeto projetado não é uma PolyMesh
ru_ru: Приведенный объект не является объектом PolyMesh

source: One or more IndexGroups supplied contained an out of bounds vertex index! All IndexGroup indices are zero-based and must be less than the number of vertices supplied.
cs_cz: Jeden nebo více zadaných objektů IndexGroup obsahoval index vrcholu mimo hranice. Všechny indexy objektů IndexGroup jsou založeny na nule a musejí být menší než počet zadaných vrcholů.
es_es: Uno o más IndexGroups proporcionados contienen un índice de vértice fuera de los límites. Los índices de IndexGroup se basan en cero y deben ser menores que el número de vértices proporcionados.
fr_fr: Un ou plusieurs IndexGroups fournis contenaient un index de sommet hors limites. Tous les index IndexGroup commencent à 0 et doivent être moins nombreux que les sommets fournis.
it_it: Uno o più IndexGroup forniti contenevano un indice di vertice esterno all'intervallo. Tutti gli indici IndexGroup hanno base zero e devono essere inferiori al numero di vertici fornito.
pl_pl: Jedna lub więcej z podanych IndexGroups zawiera indeks wierzchołka znajdujący się poza granicami! Wszystkie indeksy IndexGroup oparte są na wartości zerowej i nie może ich być więcej niż podanych wierzchołków.
pt_br: Um ou mais grupos de índices fornecidos contêm um índice de vértice fora dos limites! Todos os índices do grupo de índices têm base zero e devem ser menores do que o número de vértices fornecidos.
ru_ru: Для одного или нескольких объектов IndexGroup назначен индекс вершины, выходящий за пределы диапазона! Индексы IndexGroup отсчитываются от нуля и должны быть меньше указанного числа вершин.

source: Cast object is not a PolySurface
cs_cz: Vrhaný objekt není objekt PolySurface.
es_es: El objeto proyectado no es una PolySurface
fr_fr: L'objet projeté n'est pas une PolySurface
it_it: L'oggetto proiettato non è PolySurface
pl_pl: Rzutowany obiekt nie jest PolySurface
pt_br: O objeto projetado não é uma PolySurface
ru_ru: Приведенный объект не является объектом PolySurface

source: The input is not valid
cs_cz: Vstup není platný
es_es: La entrada no es válida.
fr_fr: L'entrée n'est pas valide
it_it: Input non valido
pl_pl: Wprowadzone dane są nieprawidłowe
pt_br: A entrada não é válida
ru_ru: Недопустимый ввод

source: Could not extract FACEs from PolySurface BODY
cs_cz: Nelze extrahovat položky FACE z položky PolySurface BODY.
es_es: No se ha podido extraer FACEs del BODY de PolySurface
fr_fr: Impossible d'extraire les faces du BODY PolySurface
it_it: Impossibile estrarre facce dal corpo di PolySurface
pl_pl: Nie można wyodrębnić FACEs z PolySurface BODY
pt_br: Não foi possível extrair as FACEs do BODY da PolySurface
ru_ru: Не удалось извлечь грань из объекта PolySurface BODY

source: Error creating PolySurface, BODY has no FACEs
cs_cz: Chyba při vytváření objektu PolySurface. Položka BODY nemá žádné položky FACE.
es_es: Error al crear PolySurface, BODY no tiene FACEs
fr_fr: Erreur lors de la création de la PolySurface, le BODY n'a aucune FACE
it_it: Errore durante la creazione di PolySurface, il corpo non ha facce
pl_pl: Błąd podczas tworzenia PolySurface, BODY nie ma FACEs
pt_br: Erro ao criar a PolySurface, o BODY não tem FACEs
ru_ru: Ошибка при создании PolySurface: для BODY отсутствуют элементы FACE

source: Nonmanifold boundary contains non-EDGEs
cs_cz: Nerozložená hranice obsahuje jiné části než položky EDGE.
es_es: El contorno no múltiple contiene no EDGEs
fr_fr: Le contour non multiple contient ne contient aucune EDGEs
it_it: Il contorno non manifold include entità diverse dagli spigoli
pl_pl: Niepowielona obwiednia nie zawiera żadnych EDGEs
pt_br: O limite do bloco múltiplo contém não-EDGES
ru_ru: Однородная граница содержит элементы, не являющиеся ребрами

source: Cannot convert base body to double sided
cs_cz: Nelze převést základní těleso na oboustranný objekt.
es_es: No se puede convertir cuerpo base a dos lados
fr_fr: Impossible de convertir le corps de base en corps à deux côtés
it_it: Impossibile convertire il corpo base in bilaterale
pl_pl: Nie można przekształcić bryły bazowej na dwustronną
pt_br: Não é possível converter o corpo base para dupla face
ru_ru: Невозможно преобразовать базовое тело в двустороннее

source: Cannot convert tool body to double sided
cs_cz: Nelze převést nástrojové těleso na oboustranný objekt.
es_es: No se puede convertir cuerpo auxiliar a dos lados
fr_fr: Impossible de convertir le corps d'outil en corps à deux côtés
it_it: Impossibile convertire il corpo dello strumento in bilaterale
pl_pl: Nie można przekształcić bryły narzędziowej na dwustronną
pt_br: Não é possível converter o corpo da ferramenta para dupla face
ru_ru: Невозможно преобразовать корпус инструмента в двусторонний

source: Unable to stitch Surfaces into a single PolySurface.
cs_cz: Položky Surface nelze shromáždit do jednoho objektu PolySurface.
es_es: No se puede coser Surfaces en una sola PolySurface
fr_fr: Impossible de coudre les Surfaces sous la forme d'une seule PolySurface.
it_it: Impossibile unire più Surface in un'unica PolySurface.
pl_pl: Nie można połączyć Surfaces w jedną PolySurface.
pt_br: Não é possível unir superfícies em uma única PolySurface.
ru_ru: Не удалось сшить Surfaces в один объект PolySurface.

source: Not Implemented
cs_cz: Neimplementováno
es_es: No implementado
fr_fr: Non mis en oeuvre
it_it: Non implementato
pl_pl: Nie zaimplementowano
pt_br: Não implementado
ru_ru: Не реализовано

source: Could not extract EDGEs from PolySurface BODY
cs_cz: Z položky BODY objektu PolySurface nebylo možné extrahovat položky EDGE.
es_es: No se ha podido extraer EDGEs de BODY de PolySurface
fr_fr: Impossible d'extraire les EDGE du BODY de la PolySurface
it_it: Impossibile estrarre SPIGOLI dal CORPO della PolySurface
pl_pl: Nie można wyodrębnić krawędzi z bryły PolySurface
pt_br: Não foi possível extrair ARESTAS do CORPO da PolySurface
ru_ru: Не удалось извлечь ребро из объекта PolySurface BODY

source: Unable to set PolySurface Edges to fillet
cs_cz: Nelze nastavit hrany objektu PolySurface k zaoblení.
es_es: No se puede definir Edges de PolySurface para empalme
fr_fr: Impossible de définir les Edges PolySurface à raccorder
it_it: Impossibile impostare elementi PolySurface Edge per il raccordo
pl_pl: Nie można ustawić PolySurface Edges do zaokrąglenia
pt_br: Não é possível definir as arestas da PolySurface para a concordância
ru_ru: Не удалось задать сопряжение ребер объекта PolySurface

source: Unable to compute fillet
cs_cz: Nelze vypočítat zaoblení.
es_es: No se puede calcular empalme
fr_fr: Impossible de calculer le raccord
it_it: Impossibile calcolare il raccordo
pl_pl: Nie można obliczyć zaokrąglenia
pt_br: Não é possível calcular a concordância
ru_ru: Невозможно рассчитать сопряжение

source: Unable to set PolySurface Edges to chamfer
cs_cz: Nelze nastavit hrany objektu PolySurface ke zkosení.
es_es: No se puede definir Edges de PolySurface para chaflán
fr_fr: Impossible de définir les Edges PolySurface à chanfreiner
it_it: Impossibile impostare elementi PolySurface Edge per lo smusso
pl_pl: Nie można ustawić PolySurface Edges do fazowania
pt_br: Não é possível definir as arestas da PolySurface para o chanfro
ru_ru: Не удалось задать скос ребер объекта PolySurface

source: Could not determine parameter of non-manifold Surface
cs_cz: Nelze určit parametr nerozložené položky Surface.
es_es: No se ha podido determinar parámetro de Surface no múltiple
fr_fr: Impossible de déterminer le paramètre de surface non multiple
it_it: Impossibile determinare il parametro di Surface non manifold
pl_pl: Nie można określić parametru nierozgałęzionej Surface
pt_br: Não foi possível determinar o parâmetro de superfície de bloco múltiplo
ru_ru: Не удалось определить параметр однородной поверхности

source: Could not make combined polysurface.
cs_cz: Nelze vytvořit kombinovaný objekt PolySurface.
es_es: No se ha podido crear PolySurface combinada
fr_fr: Impossible de rendre la polysurface combinée.
it_it: Impossibile creare una PolySurface combinata.
pl_pl: Nie można utworzyć łączonej polipowierzchni.
pt_br: Não foi possível criar PolySurfaces combinadas.
ru_ru: Не удалось создать комбинированную сложную поверхность.

source: Could not combine Surfaces
cs_cz: Povrchy nebylo možné kombinovat.
es_es: No se ha podido combinar Surfaces
fr_fr: Impossible de combiner les surfaces
it_it: Impossibile unire le superfici
pl_pl: Nie można połączyć powierzchni
pt_br: Não foi possível combinar superfícies
ru_ru: Не удалось объединить поверхности

source: Error getting faces!
cs_cz: Chyba při získávání ploch
es_es: Error al obtener caras
fr_fr: Erreur lors de l'obtention des faces.
it_it: Errore di restituzione delle facce.
pl_pl: Błąd podczas pobierania powierzchni!
pt_br: Erro ao obter faces!
ru_ru: Ошибка при получении граней!

source: Error getting edges!
cs_cz: Chyba při získávání hran
es_es: Error al obtener aristas
fr_fr: Erreur lors de l'obtention des arêtes.
it_it: Errore di restituzione degli spigoli.
pl_pl: Błąd podczas pobierania krawędzi!
pt_br: Erro ao obter arestas!
ru_ru: Ошибка при получении ребер!

source: Non-uniform transformations on PolySurface is not supported at the moment
cs_cz: Nerovnoměrné transformace na prvku PolySurface nejsou v tuto chvíli podporovány.
es_es: Las transformaciones no uniformes en PolySurface no se admiten en este momento
fr_fr: Les transformations non uniformes sur PolySurface ne sont pas prises en charge pour le moment.
it_it: Le trasformazioni non uniformi su PolySurface non sono attualmente supportate
pl_pl: Niejednorodne przekształcenia na PolySurface nie są w tej chwili obsługiwane
pt_br: As transformações não-uniformes na PolySurface não são suportadas no momento
ru_ru: Неоднородные преобразования PolySurface в данный момент не поддерживается

source: Unable to loft!
cs_cz: Nelze šablonovat!
es_es: No se puede solevar
fr_fr: Impossible de lisser.
it_it: Impossibile eseguire il loft.
pl_pl: Wyciągnięcie złożone niemożliwe!
pt_br: Não é possível elevar!
ru_ru: Лофтинг не удался!

source: Unable to loft to make polysurface!
cs_cz: Nelze provést šablonování za účelem vytvoření objektu PolySurface!
es_es: No se puede solevar para crear PolySurface
fr_fr: Impossible de lisser pour créer la polysurface.
it_it: Impossibile eseguire il loft per creare la PolySurface.
pl_pl: Wyciągnięcie złożone, aby utworzyć polipowierzchni, niemożliwe!
pt_br: Não é possível elevar para criar a PolySurface!
ru_ru: Лофтинг для создания сложной поверхности не удался!

source: Unable to set sweep profile and path to make Polysurface
cs_cz: Nelze nastavit profil tažení a trajektorii k vytvoření objektu PolySurface.
es_es: No se puede definir ruta y perfil de barrido y trayectoria para crear PolySurface
fr_fr: Impossible de définir le profil de balayage et la trajectoire pour créer la Polysurface
it_it: Impossibile impostare il profilo e il percorso dell'estrusione su percorso per creare PolySurface
pl_pl: Nie można ustawić profilu przeciągnięcia i ścieżki, aby utworzyć Polysurface
pt_br: Não é possível definir o perfil do caminho da extrusão por percurso para criar a PolySurface
ru_ru: Не удалось задать профиль и траекторию сдвига для создания объекта Polysurface

source: Unable to set the result to be not solid to make Polysurface
cs_cz: Nelze nastavit výsledek tak, aby nebyl tělesem, za účelem k vytvoření objektu PolySurface.
es_es: No se puede definir que el resultado no sea sólido para crear PolySurface
fr_fr: Impossible de définir le résultat de façon à ce qu'il soit non solide pour créer une Polysurface
it_it: Impossibile impostare il risultato come non solido per creare PolySurface
pl_pl: Nie można ustawić wyniku innego niż bryła, aby utworzyć Polysurface
pt_br: Não é possível definir o resultado para que não seja um sólido para criar a PolySurface
ru_ru: Не удалось задать тип результата (тело или нет) для создания объекта Polysurface

source: Unable to compute surface sweep on rail to make Polysurface
cs_cz: Nelze vypočítat tažení povrchu na trajektorii za účelem vytvoření objektu PolySurface.
es_es: No se puede calcular superficie de barrido en barandal para crear PolySurface
fr_fr: Impossible de calculer le profil de balayage sur le rail pour créer la Polysurface
it_it: Impossibile calcolare l'estrusione su percorso della superficie sulla guida per la creazione di PolySurface
pl_pl: Nie można obliczyć przeciągnięcia powierzchni na tor, aby utworzyć Polysurface
pt_br: Não é possível calcular a extrusão por percurso da superfície no corrimão para criar a PolySurface
ru_ru: Не удалось рассчитать сдвиг поверхности по направляющей для создания поверхности Polysurface
