Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Best fit plane needs 3 or more points.
cs_cz: Optimálně umístěná rovina vyžaduje tři nebo více bodů.
es_es: Plano de ajuste perfecto necesita tres o más puntos
fr_fr: Le plan d'ajustement optimal requiert trois points ou plus.
it_it: Il piano di adattamento ottimale richiede almeno 3 punti.
pl_pl: Najlepiej dopasowana płaszczyzna wymaga co najmniej 3 punktów.
pt_br: O plano com melhor ajuste precisa de três ou mais pontos.
ru_ru: Для плоскости наилучшего вписывания требуется 3 или более точек!

source: Cast object is not a Point
cs_cz: Vrhaný objekt není položka Point.
es_es: El objeto proyectado no es un Point
fr_fr: L'objet projeté n'est pas un Point
it_it: L'oggetto proiettato non è Point
pl_pl: Rzutowany obiekt nie jest Point
pt_br: O objeto projetado não é um ponto
ru_ru: Приведенный объект не является точкой

source: Unable to set vertex position
cs_cz: Nelze nastavit polohu vrcholu.
es_es: No se puede definir posición de vértice
fr_fr: Impossible de définir la position du sommet
it_it: Impossibile impostare la posizione del vertice
pl_pl: Nie można ustawić położenia wierzchołka
pt_br: Não é possível definir a posição do vértice
ru_ru: Не удалось задать положение вершины

source: Unable to post process VERTEX ENTITY
cs_cz: Nelze publikovat zpracování položky VERTEX ENTITY.
es_es: No se puede posprocesar VERTEX ENTITY
fr_fr: Impossible de traiter l'ENTITY VERTEX
it_it: Impossibile inviare il processo entità vertice
pl_pl: Przetwarzanie końcowe VERTEX ENTITY nie jest możliwe
pt_br: Não é possível pós-processar a VERTEX ENTITY
ru_ru: Не удалось выполнить постобработку объекта вершины

source: Unable to set VERTEX position
cs_cz: Nelze nastavit polohu položky VERTEX.
es_es: No se puede definir posición de VERTEX
fr_fr: Impossible de définir la position du sommet
it_it: Impossibile impostare la posizione del vertice
pl_pl: Nie można ustawić położenia VERTEX
pt_br: Não é possível definir a posição do VERTEX
ru_ru: Не удалось задать положение вершины

source: Unable to create brep around Point
cs_cz: Nelze vytvořit položku brep okolo položky Point.
es_es: No se puede crear BREP en torno a punto
fr_fr: Impossible de créer brep autour du Point
it_it: Impossibile creare la rappresentazione contorno intorno al punto
pl_pl: Nie można utworzyć reprezentacji bryłowej wokół Point
pt_br: Não foi possível criar REPRLIMITE ao redor do ponto
ru_ru: Не удалось создать контурное представление вокруг точки

source: Cast object is not a PolyCurve
cs_cz: Vrhaný objekt není objekt PolyCurve.
es_es: El objeto proyectado no es una PolyCurve
fr_fr: L'objet projeté n'est pas une PolyCurve
it_it: L'oggetto proiettato non è PolyCurve
pl_pl: Rzutowany obiekt nie jest PolyCurve
pt_br: O objeto projetado não é uma PolyCurve
ru_ru: Приведенный объект не является объектом PolyCurve

source: Cannot create a PolyCurve without any Points.
cs_cz: Nelze vytvořit objekt PolyCurve bez jakéhokoli bodu.
es_es: No se puede crear una PolyCurve sin Points
fr_fr: Impossible de créer une PolyCurve sans aucun Point.
it_it: Impossibile creare PolyCurve senza Point.
pl_pl: Nie można utworzyć PolyCurve bez żadnych Points.
pt_br: Não é possível criar uma PolyCurve sem quaisquer pontos.
ru_ru: Невозможно создать PolyCurve без точек.

source: Cannot make a PolyCurve from an empty list
cs_cz: Nelze vytvořit objekt PolyCurve z prázdného seznamu.
es_es: No se puede crear una PolyCurve a partir de una lista vacía
fr_fr: Impossible de créer une PolyCurve depuis une liste vide
it_it: Impossibile creare PolyCurve da un elenco vuoto
pl_pl: Nie można utworzyć PolyCurve z pustej listy
pt_br: Não é possível criar uma PolyCurve a partir de uma lista vazia
ru_ru: Невозможно создать PolyCurve на основе пустого списка

source: Failed to trim end segments of intersecting curves to be used for PolyCurve creation.
cs_cz: Nepodařilo se oříznout koncové úseky protínajících se křivek, pomocí nichž se má vytvořit objekt PolyCurve.
es_es: No se han podido recortar los segmentos finales de curvas intersecantes para la creación de la PolyCurve.
fr_fr: Échec de l'ajustement des segments d'extrémité des courbes sécantes à utiliser pour la création de la polycourbe.
it_it: Impossibile tagliare i segmenti finali delle curve intersecanti da utilizzare per la creazione di PolyCurve.
pl_pl: Nie udało się uciąć końcowych segmentów przecinających się krzywych na potrzeby utworzenia krzywej PolyCurve.
pt_br: Falha na operação de aparar segmentos de extremidade de curvas de interseção para serem usados para a criação da PolyCurve.
ru_ru: Не удалось обрезать конечные сегменты пересекающихся кривых для создания объекта PolyCurve.

source: Failed to create one or more PolyCurves from the input set of curves and given tolerance.
cs_cz: Nepodařilo se vytvořit jeden nebo více objektů PolyCurve ze vstupní sady křivek a dané tolerance.
es_es: No se ha podido crear una o más PolyCurves a partir del conjunto de curvas de entrada y de la tolerancia especificada.
fr_fr: Échec de la création d'une ou plusieurs polycourbes à partir du jeu de courbes d'entrée et de la tolérance donnée.
it_it: Impossibile creare una o più PolyCurves dal gruppo di curve di input e in base alla tolleranza specificata.
pl_pl: Nie udało się utworzyć co najmniej jednej krzywej PolyCurve na podstawie wejściowego zestawu krzywych i podanej tolerancji.
pt_br: Falha durante a criação de uma ou mais PolyCurves com base no conjunto de entrada de curvas e na tolerância especificada.
ru_ru: Не удалось создать один или несколько объектов PolyCurve, используя входной набор кривых и заданный допуск.

source: Failed to construct a PolyCurve from the input curves and given tolerance.
cs_cz: Nepodařilo se vytvořit objekt PolyCurve ze vstupních křivek a dané tolerance.
es_es: No se ha podido crear una PolyCurve a partir de las curvas de entrada y la tolerancia especificada.
fr_fr: Échec de la construction d'une polycourbe à partir des courbes d'entrée et de la tolérance donnée.
it_it: Impossibile costruire una PolyCurve dalle curve di input e in base alla tolleranza specificata.
pl_pl: Nie udało się utworzyć krzywej PolyCurve na podstawie krzywych wejściowych i podanej tolerancji.
pt_br: Falha durante a criação de uma PolyCurve com base nas curvas de entrada e na tolerância especificada.
ru_ru: Не удалось создать PolyCurve, используя входные кривые и заданный допуск.

source: Failed to create new PolyCurve from trimmed curves.
cs_cz: Nepodařilo se vytvořit nový objekt PolyCurve z oříznutých křivek.
es_es: No se ha podido crear una PolyCurve nueva a partir de curvas recortadas.
fr_fr: Échec de la création de la nouvelle polycourbe à partir des courbes ajustées.
it_it: Impossibile creare una nuova PolyCurve da curve tagliate.
pl_pl: Nie udało się utworzyć nowej krzywej PolyCurve z uciętych krzywych.
pt_br: Falha durante a criação de uma nova PolyCurve com base em curvas aparadas.
ru_ru: Не удалось создать новый объект PolyCurve из обрезанных кривых.

source: Failed to perform arc-spline approximnation of input PolyCurve.
cs_cz: Nepodařilo se provést aproximaci oblouku křivky u vstupního objektu PolyCurve.
es_es: No se ha podido realizar la aproximación de arco-spline de la PolyCurve de entrada.
fr_fr: Échec de l'approximation de l'arc/la spline de la polycourbe d'entrée.
it_it: Impossibile eseguire l'approssimazione arco-spline della PolyCurve di input.
pl_pl: Nie można wykonać przybliżenia splajnu-łuku dla wejściowej krzywej PolyCurve.
pt_br: Falha durante a execução da aproximação arco-spline da PolyCurve de entrada.
ru_ru: Не удалось выполнить аппроксимацию входного объекта PolyCurve дугами и сплайнами.

source: Failed to compute points of PolyCurve.
cs_cz: Nepodařilo se vypočítat body objektu PolyCurve.
es_es: No se han podido calcular puntos de PolyCurve.
fr_fr: Échec du calcul des points de la polycourbe.
it_it: Impossibile calcolare i punti di PolyCurve.
pl_pl: Nie można obliczyć punktów krzywej PolyCurve.
pt_br: Falha durante o cálculo de pontos da PolyCurve.
ru_ru: Не удалось рассчитать точки PolyCurve.

source: Failed to pull polycurve onto plane.
cs_cz: Nepodařilo se natáhnout objekt PolyCurve na rovinu.
es_es: No se ha podido estirar la PolyCurve en el plano.
fr_fr: Échec du déplacement de la polycourbe sur le plan.
it_it: Impossibile trascinare PolyCurve sul piano.
pl_pl: Nie można wyciągnąć krzywej PolyCurve na płaszczyznę.
pt_br: Falha durante a extração da PolyCurve no plano.
ru_ru: Не удалось вытянуть сложную кривую на плоскости.

source: Failed to retrieve component curves of input PolyCurve.
cs_cz: Nepodařilo se získat křivky komponenty vstupního objektu PolyCurve.
es_es: No se han podido recuperar las curvas de componente de la PolyCurve de entrada.
fr_fr: Échec de l'extraction des courbes de composant de la polycourbe d'entrée.
it_it: Impossibile recuperare le curve del componente di PolyCurve di input.
pl_pl: Nie można pobrać krzywych składowych z wejściowej krzywej PolyCurve.
pt_br: Falha durante a recuperação de curvas de componentes da PolyCurve de entrada.
ru_ru: Не удалось получить кривые, из которых состоит входной объект PolyCurve.

source: Invalid Curve index
cs_cz: Neplatný index křivky
es_es: Índice de Curve no válido
fr_fr: Index de Curve incorrect
it_it: Indice curva non valido
pl_pl: Niewłaściwy indeks krzywej
pt_br: Índice de curva inválido
ru_ru: Недопустимый индекс кривой

source: Could not find sub Curve in parameter range
cs_cz: Nelze najít dílčí položku Curve v rozsahu parametru.
es_es: No se ha podido encontrar Curve secundaria en rango de parámetros
fr_fr: Impossible de trouver une sous-Curve dans l'intervalle de paramètres
it_it: Sub Curve non trovata nell'intervallo dei parametri
pl_pl: Nie można znaleźć podrzędnej Curve w zakresie parametrów
pt_br: Não foi possível encontrar a subcurva na faixa do parâmetro
ru_ru: Не удалось найти второстепенную кривую в диапазоне параметров

source: Unable to calculate point on polycurve. Input parameter might be out of parameter range.
cs_cz: Nepodařilo se vypočítat bod na objektu PolyCurve. Vstupní parametr je možná mimo rozsah parametru.
es_es: No se puede calcular el punto en la PolyCurve. El parámetro de entrada puede estar fuera del rango de parámetros.
fr_fr: Impossible de calculer le point sur la polycourbe. Le paramètre d'entrée est peut-être hors de la plage du paramètre.
it_it: Impossibile calcolare il punto sulla PolyCurve. Il parametro di input potrebbe non essere compreso nell'intervallo di parametri.
pl_pl: Nie można obliczyć punktu na krzywej PolyCurve. Parametr wejściowy może być poza zakresem parametrów.
pt_br: Não é possível calcular o ponto na PolyCurve. O parâmetro de entrada pode estar fora do intervalo de parâmetros.
ru_ru: Не удалось вычислить точку на сложной кривой. Возможно, значение входного параметра находится вне диапазона допустимых значений.

source: Could not find parameter at Point
cs_cz: Nelze nalézt parametr v položce Point.
es_es: No se ha podido encontrar parameter at Point
fr_fr: Impossible de trouver parameter at Point
it_it: Parameter at Point non trovato
pl_pl: Nie można znaleźć parameter at Point
pt_br: Não foi possível localizar o parâmetro no ponto
ru_ru: Не удалось найти: parameter at Point

source: Failed to evaluate tangent at polycurve parameter.
cs_cz: Nepodařilo se vyhodnotit tečnu u parametru objektu PolyCurve.
es_es: No se ha podido evaluar la tangente en el parámetro de PolyCurve.
fr_fr: Échec de l'évaluation de la tangente au paramètre de la polycourbe.
it_it: Impossibile valutare la tangente in corrispondenza del parametro PolyCurve.
pl_pl: Nie można obliczyć stycznej dla parametru krzywej PolyCurve.
pt_br: Falha durante a avaliação da tangente no parâmetro da PolyCurve.
ru_ru: Не удалось вычислить параметр касательной к сложной кривой.

source: Failed to compute parameter on polycurve at given chord length.
cs_cz: Nepodařilo se vypočítat parametr objektu PolyCurve v dané délce tětivy.
es_es: No se ha podido calcular el parámetro de PolyCurve en la longitud de cuerda especificada.
fr_fr: Échec du calcul du paramètre sur la polycourbe à la longueur de corde donnée.
it_it: Impossibile calcolare il parametro sulla PolyCurve in corrispondenza della lunghezza della corda specificata.
pl_pl: Nie można obliczyć parametru na krzywej PolyCurve przy danej długości cięciwy.
pt_br: Falha durante o cálculo do parâmetro na PolyCurve no comprimento de corda especificado.
ru_ru: Не удалось вычислить параметр на сложной кривой по заданной длине хорды.

source: Failed to split PolyCurve at given parameters.
cs_cz: Nepodařilo se rozdělit objekt PolyCurve v daných parametrech.
es_es: No se ha podido dividir la PolyCurve en los parámetros especificados.
fr_fr: Échec de la scission de polycourbe au niveau des paramètres donnés.
it_it: Impossibile dividere PolyCurve in corrispondenza dei parametri specificati.
pl_pl: Nie można podzielić krzywej PolyCurve dla danych parametrów.
pt_br: Falha durante a divisão da PolyCurve em determinados parâmetros.
ru_ru: Не удалось разделить PolyCurve с использованием заданных параметров.

source: Failed to trim surface with polycurve loops.
cs_cz: Nepodařilo se oříznout povrch pomocí smyček objektů PolyCurve.
es_es: No se ha podido recortar la superficie con bucles de PolyCurve.
fr_fr: Échec de la relimitation de surface avec des boucles de polycourbe.
it_it: Impossibile tagliare la superficie con perimetri chiusi di PolyCurve.
pl_pl: Nie można uciąć powierzchni za pomocą pętli krzywej PolyCurve.
pt_br: Falha na operação de aparar superfície com contornos de PolyCurves.
ru_ru: Не удалось обрезать поверхность контурами сложных кривых.

source: Failed to trim PolyCurve at start parameter.
cs_cz: Nepodařilo se oříznout objekt PolyCurve v počátečním parametru.
es_es: No se ha podido recortar la PolyCurve en el parámetro inicial.
fr_fr: Échec de l'ajustement de la polycourbe au paramètre de départ.
it_it: Impossibile tagliare PolyCurve in corrispondenza del parametro iniziale.
pl_pl: Nie można uciąć krzywej PolyCurve przy parametrze początkowym.
pt_br: Falha na operação de aparar PolyCurve no parâmetro inicial.
ru_ru: Не удалось обрезать PolyCurve в месте начального параметра.

source: Failed to trim PolyCurve at end parameter.
cs_cz: Nepodařilo se oříznout objekt PolyCurve v koncovém parametru.
es_es: No se ha podido recortar la PolyCurve en el parámetro final.
fr_fr: Échec de l'ajustement de la polycourbe au paramètre de fin.
it_it: Impossibile tagliare PolyCurve in corrispondenza del parametro finale.
pl_pl: Nie można uciąć krzywej PolyCurve przy parametrze końcowym.
pt_br: Falha na operação de aparar PolyCurve no parâmetro final.
ru_ru: Не удалось обрезать PolyCurve в месте конечного параметра.

source: Failed to trim PolyCurve at start and end parameters.
cs_cz: Nepodařilo se oříznout objekt PolyCurve v počátečním a v koncovém parametru.
es_es: No se ha podido recortar la PolyCurve en los parámetros inicial y final.
fr_fr: Échec de l'ajustement de la polycourbe au niveau des paramètres de début et de fin.
it_it: Impossibile tagliare PolyCurve in corrispondenza dei parametri iniziale e finale.
pl_pl: Nie można uciąć krzywej PolyCurve przy parametrach początkowym i końcowym.
pt_br: Falha na operação de aparar PolyCurve nos parâmetros inicial e final.
ru_ru: Не удалось обрезать PolyCurve в месте начального и конечного параметров.

source: unable to convert PolyCurve to NURBS curve.
cs_cz: nelze převést křivku PolyCurve na křivku NURBS.
es_es: No se puede convertir la PolyCurve en una curva NURBS.
fr_fr: impossible de convertir la PolyCurve en courbe NURBS.
it_it: Impossibile convertire la PolyCurve nella curva NURBS.
pl_pl: nie można przekonwertować krzywej PolyCurve na krzywą NURBS.
pt_br: não é possível converter a PolyCurve em uma curva NURBS.
ru_ru: Невозможно преобразовать элемент PolyCurve в NURBS-кривую.

source: Error computing parameter on PolyCurve. The requested parameter may be outside the PolyCurve range.
cs_cz: Při výpočtu parametru u objektu PolyCurve došlo k chybě. Požadovaný parametr by mohl být mimo rozsah objektu PolyCurve.
es_es: Error al calcular el parámetro en la PolyCurve. El parámetro solicitado puede estar fuera del rango de la PolyCurve.
fr_fr: Erreur lors du calcul du paramètre sur la polycourbe. Le paramètre demandé est peut-être en dehors de la plage de la polycourbe.
it_it: Errore durante il calcolo del parametro su PolyCurve. Il parametro richiesto potrebbe essere esterno all'intervallo PolyCurve.
pl_pl: Błąd obliczania parametru krzywej PolyCurve. Żądany parametr może być poza zakresem krzywej PolyCurve.
pt_br: Erro durante o cálculo do parâmetro na PolyCurve. O parâmetro solicitado pode estar fora do intervalo da PolyCurve.
ru_ru: Ошибка при вычислении параметра на объекте PolyCurve. Запрошенный параметр может находиться вне диапазона PolyCurve.

source: Failed to compute length of polycurve at given parameter.
cs_cz: Nepodařilo se vypočítat délku objektu PolyCurve v daném parametru.
es_es: No se ha podido calcular la longitud de la PolyCurve en el parámetro especificado.
fr_fr: Échec du calcul de la longueur de la polycourbe au paramètre donné.
it_it: Impossibile calcolare la lunghezza della PolyCurve in corrispondenza del parametro specificato.
pl_pl: Nie można obliczyć długości krzywej PolyCurve przy danym parametrze.
pt_br: Falha durante o cálculo do comprimento da PolyCurve no parâmetro especificado.
ru_ru: Не удалось рассчитать длину сложной кривой в заданном параметре.

source: Failed to compute arc-length between parameters.
cs_cz: Nepodařilo se vypočítat délku oblouku mezi parametry.
es_es: No se ha podido calcular la longitud de arco entre parámetros.
fr_fr: Échec du calcul de la longueur d'arc entre les paramètres.
it_it: Impossibile calcolare la lunghezza dell'arco tra i parametri.
pl_pl: Nie można obliczyć długości łuku między parametrami.
pt_br: Falha durante o cálculo do comprimento do arco entre parâmetros.
ru_ru: Не удалось рассчитать длину дуги между параметрами.

source: Failed to determine if given PolyCurve is planar.
cs_cz: Nepodařilo se určit, zda je daný objekt PolyCurve rovinný.
es_es: No se ha podido determinar si la PolyCurve especificada es plana.
fr_fr: Impossible de déterminer si la polycourbe spécifiée est plate.
it_it: Impossibile determinare se la PolyCurve specificata è piana.
pl_pl: Nie można określić, czy dana krzywa PolyCurve jest płaska.
pt_br: Falha para determinar se a PolyCurve fornecida é plana.
ru_ru: Не удалось определить, является ли объект PolyCurve плоским.

source: PolyCurve is either a degenerate Point or is linear or is not planar.
cs_cz: Objekt PolyCurve je buď degenerovaný bod, nebo je lineární, případně není rovinný.
es_es: La PolyCurve es un punto degenerado, es lineal o no es plana.
fr_fr: La polycourbe est un point dégénéré ou est linéaire ou non plate.
it_it: PolyCurve è un punto degenerato oppure è lineare o non è piana.
pl_pl: Krzywa PolyCurve jest zdegenerowanym punktem, jest liniowa lub nie jest płaska.
pt_br: PolyCurve é um ponto degenerado, ou é linear ou não é plano.
ru_ru: PolyCurve является вырожденной точкой либо линейной или неплоской кривой.

source: Can not close polycurve.
cs_cz: Nelze uzavřít objekt PolyCurve.
es_es: No se puede cerrar PolyCurve
fr_fr: Impossible de fermer la polycurve.
it_it: Impossibile chiudere PolyCurve.
pl_pl: Nie można zamknąć polycurve.
pt_br: Não é possível fechar a PolyCurve.
ru_ru: Не удалось замкнуть polycurve.

source: Can not determine plane of polycurve extension.
cs_cz: Nelze určit rovinu rozšíření objektu PolyCurve.
es_es: No se puede determinar plano de extensión de PolyCurve
fr_fr: Impossible de déterminer le plan d'extension de la polycurve.
it_it: Impossibile determinare il piano dell'estensione di PolyCurve.
pl_pl: Nie można określić płaszczyzny rozszerzenia polycurve.
pt_br: Não é possível determinar o plano da extensão da PolyCurve.
ru_ru: Не удалось определить плоскость удлинения polycurve.

source: Could not add length of a full circle or more.
cs_cz: Nelze přidat délku celé kružnice nebo více.
es_es: No se ha podido añadir longitud de círculo completo o más
fr_fr: Impossible d'ajouter la longueur d'un cercle complet ou plus.
it_it: Impossibile aggiungere la lunghezza di un cerchio completo o una lunghezza superiore.
pl_pl: Nie można dodać długości pełnego okręgu lub więcej.
pt_br: Não foi possível adicionar o comprimento de um círculo completo ou mais.
ru_ru: Не удалось добавить длину полной окружности или более.

source: Different sign of radii values.
cs_cz: Odlišné znaménko hodnot poloměru
es_es: Signo diferente de valores de radios
fr_fr: Signe différent de valeurs de rayon.
it_it: I valori dei raggi hanno segni diversi.
pl_pl: Inny znak wartości promieni.
pt_br: Sinal diferente de valores do raio.
ru_ru: Знаки значений радиусов различаются.

source: Failed to facet polycurve.
cs_cz: Nepodařilo se oploškovat objekt PolyCurve.
es_es: No se ha podido facetar la PolyCurve.
fr_fr: Échec du facettage de la polycourbe.
it_it: Impossibile sfaccettare PolyCurve.
pl_pl: Nie można utworzyć płaszczyzn krzywej PolyCurve.
pt_br: Falha na operação de facetar a PolyCurve.
ru_ru: Не удалось создать грани на сложной кривой.

source: Could not sweep PolyCurve
cs_cz: U objektu PolyCurve nebylo možné použít tažení.
es_es: No se ha podido barrer PolyCurve
fr_fr: Impossible de balayer une PolyCurve
it_it: Impossibile eseguire lo sweep di PolyCurve
pl_pl: Nie można przeciągnąć PolyCurve
pt_br: Não foi possível efetuar a extrusão por percurso da PolyCurve
ru_ru: Не удалось сдвинуть кривую PolyCurve

source: Failed to convert PolyCurve to wire body.
cs_cz: Nepodařilo se převést objekt PolyCurve na drátové těleso.
es_es: No se ha podido convertir una PolyCurve en un cuerpo alámbrico.
fr_fr: Échec de la conversion de la polycourbe en corps filaire.
it_it: Impossibile convertire PolyCurve in corpo wire.
pl_pl: Nie można przekonwertować krzywej PolyCurve na bryłę przewodu.
pt_br: Falha durante a conversão da PolyCurve em corpo de fio.
ru_ru: Не удалось преобразовать PolyCurve в каркасное тело.

source: Could not make patch surfaces
cs_cz: Povrchy záplat nebylo možné vytvořit.
es_es: No se ha podido crear superficies de parche
fr_fr: Impossible de créer des surfaces de correction
it_it: Impossibile creare superfici di chiusura
pl_pl: Nie udało się utworzyć powierzchni zamknięcia
pt_br: Não foi possível criar superfícies de correção
ru_ru: Не удалось создать замыкающие поверхности

source: Could not patch PolyCurve
cs_cz: Objekt PolyCurve nebylo možné opravit.
es_es: No se ha podido aplicar parche a PolyCurve
fr_fr: Impossible de corriger la PolyCurve
it_it: Impossibile creare patch PolyCurve
pl_pl: Nie można zaślepić PolyCurve
pt_br: Não foi possível corrigir a PolyCurve
ru_ru: Не удалось замкнуть PolyCurve

source: Failed to offset polycurve.
cs_cz: Nepodařilo se odsadit objekt PolyCurve.
es_es: No se ha podido desfasar la PolyCurve.
fr_fr: Échec du décalage de la polycourbe.
it_it: Impossibile eseguire l'offset di PolyCurve.
pl_pl: Nie można odsunąć krzywej PolyCurve.
pt_br: Falha durante o deslocamento da PolyCurve.
ru_ru: Не удалось сместить сложную кривую.
