Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: T-Spline Surface Sphere creation failed
cs_cz: Nepodařilo se vytvořit kouli povrchu T-spline
es_es: No se pudo crear la esfera de superficie de T-Spline
fr_fr: Échec de la création de la sphère de la surface T-Spline
it_it: Creazione sfera superficie T-Spline non riuscita
pl_pl: Nie można utworzyć powierzchni kuli T-splajn
pt_br: Falha na criação da esfera da superfície da T-Spline
ru_ru: Не удалось создать сферу Т-сплайновой поверхности

source: Inner radius should be greater than or equal to 1e-3
cs_cz: Vnitřní poloměr by měl být větší nebo roven 1e-3
es_es: El valor de radio interior debe ser superior o igual a 1e-3.
fr_fr: Le rayon interne doit être supérieur ou égal à 1e-3
it_it: Il raggio interno deve essere maggiore di o uguale a 1e-3
pl_pl: Promień wewnętrzny powinien być większy niż lub równy 1e-3
pt_br: O raio interno deve ser maior ou igual a 1e-3
ru_ru: Внутренний радиус должен быть больше или равен 1e-3

source: Inner radius should be less than or equal to 1e8
cs_cz: Vnitřní poloměr by měl být menší nebo roven 1e8
es_es: El valor de radio interior debe ser inferior o igual a 1e8.
fr_fr: Le rayon interne doit être inférieur ou égal à 1e8
it_it: Il raggio interno deve essere minore di o uguale a 1e8
pl_pl: Promień wewnętrzny powinien być mniejszy niż lub równy 1e8
pt_br: O raio interno deve ser menor ou igual a 1e8
ru_ru: Внутренний радиус должен быть меньше или равен 1e8

source: Outer radius should be greater than or equal to 1e-3
cs_cz: Vnější poloměr by měl být větší nebo roven 1e-3
es_es: El valor de radio exterior debe ser superior o igual a 1e-3.
fr_fr: Le rayon extérieur doit être supérieur ou égal à 1e-3
it_it: Il raggio esterno deve essere maggiore di o uguale a 1e-3
pl_pl: Promień zewnętrzny powinien być większy niż lub równy 1e-3
pt_br: O raio externo deve ser maior ou igual a 1e-3
ru_ru: Наружный радиус должен быть больше или равен 1e-3

source: Outer radius should be less than or equal to 1e8
cs_cz: Vnější poloměr by měl být menší nebo roven 1e8
es_es: El valor de radio exterior debe ser inferior o igual a 1e8.
fr_fr: Le rayon extérieur doit être inférieur ou égal à 1e8
it_it: Il raggio esterno deve essere minore di o uguale a 1e8
pl_pl: Promień zewnętrzny powinien być mniejszy niż lub równy 1e8
pt_br: O raio externo deve ser menor ou igual a 1e8
ru_ru: Наружный радиус должен быть меньше или равен 1e8

source: Inner and outer radius spans should be greater or equal to 3
cs_cz: Rozpětí vnitřních a vnějších poloměrů musí být větší než nebo rovna 3
es_es: Los tramos de radios interiores y exteriores deben ser mayores o iguales que 3.
fr_fr: Les travées de rayon intérieur et extérieur doivent être supérieures ou égales à 3
it_it: Le campate nel raggio interno ed esterno devono essere maggiori di o uguali a 3
pl_pl: Rozpiętości wewnętrznego i zewnętrznego promienia powinny być większe lub równe 3
pt_br: Os vãos do raio interno e externo devem ser maiores ou iguais a 3
ru_ru: Пролеты по внутреннему и внешнему радиусу должны быть больше или равны 3

source: Inner and outer radius spans should be greater or equal to 4 if any axial symmetry is selected
cs_cz: Pokud je vybrána jakákoli osová symetrie, rozpětí vnitřních a vnějších poloměrů musí být větší nebo rovna 4
es_es: Los tramos de radios interiores y exteriores deben ser mayores o iguales que 4 si se selecciona una simetría axial.
fr_fr: Les travées de rayon intérieur et extérieur doivent être supérieures ou égales à 4 si une symétrie axiale est sélectionnée
it_it: Le campate nel raggio interno ed esterno devono essere maggiori di o uguali a 4, se è selezionata la simmetria assiale
pl_pl: Rozpiętości wewnętrznego i zewnętrznego promienia powinny być większe lub równe 4, jeśli wybrano jakąkolwiek symetrię osiową
pt_br: Os vãos do raio interno e externo deverão ser maiores ou iguais a 4 se alguma simetria axial for selecionada
ru_ru: Если выбрана осевая симметрия, пролеты по внутреннему и внешнему радиусу должны быть больше или равны 4

source: Outer radius spans should be multiple of 4 when X and Y symmetry is selected
cs_cz: Když je vybrána symetrie X a Y, rozpětí vnějších poloměrů musí být násobkem 4
es_es: Los tramos de radios exteriores deben ser múltiplos de 4 si se selecciona simetría de X e Y.
fr_fr: Les travées de rayon extérieur doivent être un multiple de 4 lorsqu'une symétrie d'axe X et Y est sélectionnée
it_it: Le campate nel raggio esterno devono essere multipli di 4 quando è selezionata la simmetria X e Y
pl_pl: Rozpiętości promieni zewnętrznych powinny być wielokrotnością 4, gdy wybrano symetrię X i Y
pt_br: Os vãos do raio externo deverão ser um múltiplo de 4 quando a simetria X e Y estiver selecionada
ru_ru: Если выбрана симметрия по осям X и Y, пролеты по внешнему радиусу должны быть кратны 4

source: Inner radius spans should be less than or equal to 256 when radial symmetry is not selected
cs_cz: Pokud není vybrána radiální symetrie, rozpětí vnitřních poloměrů by měla být menší nebo rovna 256
es_es: Los tramos de radios interiores deben ser inferiores o iguales a 256 si no se ha seleccionado la simetría radial.
fr_fr: Les travées de rayon intérieur doivent être inférieures ou égales à 256 lorsque la symétrie radiale n'est pas sélectionnée
it_it: Le campate nel raggio interno devono essere minori di o uguali a 256 quando non è selezionata la simmetria radiale
pl_pl: Rozpiętości promieni wewnętrznych powinny być mniejsze niż lub równe 256, gdy nie wybrano symetrii promieniowej
pt_br: Os vãos do raio interno deverão ser menores ou iguais a 256 quando a simetria radial não estiver selecionada
ru_ru: Если не выбрана радиальная симметрия, количество пролетов по внутреннему радиусу должно быть меньше или равно 256

source: Outer radius spans should be less than or equal to 256 when radial symmetry is not selected
cs_cz: Pokud není vybrána radiální symetrie, rozpětí vnějších poloměrů by měla být menší nebo rovna 256
es_es: Los tramos de radios exteriores deben ser inferiores o iguales a 256 si no se ha seleccionado la simetría radial.
fr_fr: Les travées de rayon extérieur doivent être inférieures ou égales à 256 lorsque la symétrie radiale n'est pas sélectionnée
it_it: Le campate nel raggio esterno devono essere minori di o uguali a 256 quando non è selezionata la simmetria radiale
pl_pl: Rozpiętości promieni zewnętrznych powinny być mniejsze niż lub równe 256, gdy nie wybrano symetrii promieniowej
pt_br: Os vãos do raio externo deverão ser menores ou iguais a 256 quando a simetria radial não estiver selecionada
ru_ru: Если не выбрана радиальная симметрия, количество пролетов по внешнему радиусу должно быть меньше или равно 256

source: Inner radius spans should be less than or equal to 64 when radial symmetry is selected
cs_cz: Pokud je vybrána radiální symetrie, rozpětí vnitřních poloměrů by měla být menší nebo rovna 64
es_es: Los tramos de radios interiores deben ser inferiores o iguales a 64 si se ha seleccionado la simetría radial.
fr_fr: Les travées de rayon intérieur doivent être inférieures ou égales à 64 lorsque la symétrie radiale est sélectionnée
it_it: Le campate nel raggio interno devono essere minori di o uguali a 64 quando è selezionata la simmetria radiale
pl_pl: Rozpiętości promieni wewnętrznych powinny być mniejsze niż lub równe 64, gdy wybrano symetrię promieniową
pt_br: Os vãos do raio interno deverão ser menores ou iguais a 64 quando a simetria radial estiver selecionada
ru_ru: Если выбрана радиальная симметрия, количество пролетов по внутреннему радиусу должно быть меньше или равно 64

source: Outer radius spans should be less than or equal to 64 when radial symmetry is selected
cs_cz: Pokud je vybrána radiální symetrie, rozpětí vnějších poloměrů by měla být menší nebo rovna 64.
es_es: Los tramos de radios exteriores deben ser inferiores o iguales a 64 si se ha seleccionado la simetría radial.
fr_fr: Les travées de rayon extérieur doivent être inférieures ou égales à 64 lorsque la symétrie radiale est sélectionnée
it_it: Le campate del raggio esterno devono essere minori di o uguali a 64 quando la simmetria radiale è selezionata
pl_pl: Rozpiętości promieni zewnętrznych powinny być mniejsze niż lub równe 64, gdy wybrano symetrię promieniową
pt_br: Os vãos do raio externo devem ser menores ou iguais a 64 quando a simetria radial estiver selecionada
ru_ru: Если выбрана радиальная симметрия, количество пролетов по наружному радиусу должно быть меньше или равно 64

source: T-Spline Surface Torus creation failed
cs_cz: Nepodařilo se vytvořit anuloid povrchu T-spline
es_es: Error en la creación del toroide de superficie de T-Spline.
fr_fr: Échec de la création du tore de la surface T-Spline
it_it: Creazione toro superficie T-Spline non riuscita
pl_pl: Nie można utworzyć powierzchni torusa T-splajn
pt_br: Falha na criação do toroide da superfície da T-Spline
ru_ru: Не удалось создать тор Т-сплайновой поверхности

source: Each span should be less than or equal to 128
cs_cz: Každé rozpětí by mělo být menší nebo rovno 128
es_es: Cada tramo debe ser inferior o igual a 128.
fr_fr: Chaque travée doit être inférieure ou égale à 128
it_it: Ciascuna campata deve essere minore di o uguale a 128
pl_pl: Poszczególne rozpiętości powinny być mniejsze niż lub równe 128
pt_br: Todos os vãos devem ser menores ou iguais a 128
ru_ru: Каждый пролет должен быть меньше или равен 128

source: Zero dimensions are not allowed
cs_cz: Nulové rozměry nejsou povoleny
es_es: No se admiten las dimensiones cero.
fr_fr: Les cotes nulles ne sont pas autorisées
it_it: Dimensioni pari a zero non consentite
pl_pl: Zerowe wymiary nie są dozwolone
pt_br: Não são permitidas cotas iguais a zero
ru_ru: Нулевые размеры не допускаются

source: T-Spline Surface Box creation failed
cs_cz: Nepodařilo se vytvořit kvádr povrchu T-spline
es_es: No se pudo crear cuadro de superficie de T-Spline
fr_fr: Échec de la création de la surface T-Spline
it_it: Creazione riquadro superficie T-Spline non riuscita
pl_pl: Nie można utworzyć prostopadłościanu powierzchni T-splajn
pt_br: Falha na criação da caixa da superfície da T-Spline
ru_ru: Не удалось создать рамку Т-сплайновой поверхности

source: Spans should be less than or equal to 32
cs_cz: Rozpětí by měla být menší nebo rovna 32
es_es: Los tramos deben ser inferiores o iguales a 32.
fr_fr: Les travées doivent être inférieures ou égales à 32
it_it: Le campate devono essere minori di o uguali a 32
pl_pl: Rozpiętości powinny być mniejsze niż lub równe 32
pt_br: Os vãos devem ser menores ou iguais a 32
ru_ru: Количество пролетов должно быть меньше или равно 32

source: T-Spline Surface Quadball creation failed
cs_cz: Nepodařilo se vytvořit čtyřúhelníkovou kouli povrchu T-spline
es_es: No se pudo crear esfera de malla cuadrada de T-Spline
fr_fr: Échec de la création du quadball de la surface T-Spline
it_it: Creazione quadball superficie T-Spline non riuscita
pl_pl: Nie można utworzyć kuli kwadrantowej powierzchni T-splajn
pt_br: Falha na criação da quadball da superfície da T-Spline
ru_ru: Не удалось создать тетрагональную сферу Т-сплайновой поверхности

source: Cannot construct FACE from surface
cs_cz: Nelze postavit PLOCHU z povrchu
es_es: No se puede construir FACE a partir de superficie.
fr_fr: Impossible de construire la FACE à partir de la surface
it_it: Impossibile costruire la FACCIA dalla superficie
pl_pl: Nie można zbudować POWIERZCHNI z powierzchni
pt_br: Não é possível criar a FACE com base na superfície
ru_ru: Не удалось сформировать элемент FACE на основе поверхности

source: Cannot get bounding box from FACE
cs_cz: Nelze získat ohraničující rámeček z PLOCHY
es_es: No se puede obtener un cuadro de delimitación a partir de FACE.
fr_fr: Impossible d'obtenir une zone de délimitation à partir de la FACE
it_it: Impossibile ottenere il riquadro di delimitazione dalla FACCIA
pl_pl: Nie można pobrać ramki ograniczającej z POWIERZCHNI
pt_br: Não é possível obter a caixa delimitadora da FACE
ru_ru: Не удалось получить ограничивающую рамку из элемента FACE

source: The input surface must have finite parameter ranges
cs_cz: Vstupní povrch musí mít konečné rozsahy parametrů
es_es: La superficie de entrada debe tener rangos de parámetros finitos.
fr_fr: La surface d'entrée doit posséder des plages de paramètres limitées
it_it: La superficie di input deve avere intervalli finiti per i parametri
pl_pl: Powierzchnia wejściowa musi mieć określone zakresy parametrów
pt_br: A superfície de entrada deve ter intervalos de parâmetros finitos
ru_ru: Для входной поверхности должны быть заданы конечные диапазоны параметров

source: Impossible to refit given surface
cs_cz: Daný povrch není možné znovu přizpůsobit
es_es: No es posible reajustar la superficie especificada.
fr_fr: Impossible de réajuster la surface spécifiée
it_it: Impossibile riadattare la superficie specificata
pl_pl: Nie można ponownie dopasować danej powierzchni
pt_br: Nâo é possível reajustar a superfície fornecida
ru_ru: Невозможно исправить данную поверхность

source: Knots is not match control vertices
cs_cz: Uzly se neshodují s řídicími vrcholy
es_es: Los nudos no coinciden con los vértices de control.
fr_fr: Les noeuds ne correspondent pas aux sommets de contrôle
it_it: I nodi non soddisfano i vertici di controllo
pl_pl: Węzły nie są zgodne z wierzchołkami sterującymi
pt_br: Os nós não coincidem com os vértices de controle
ru_ru: Узлы не соответствуют управляющим вершинам

source: Failed to create ASM B-Spline curve
cs_cz: Nepodařilo se vytvořit křivku B-Spline ASM
es_es: No se ha podido crear una curva B-Spline ASM.
fr_fr: Impossible de créer la courbe B-Spline ASM
it_it: Impossibile creare la curva B-Spline ASM
pl_pl: Nie można utworzyć krzywej b-splajn ASM
pt_br: Falha ao criar a curva B-spline ASM
ru_ru: Не удалось создать B-сплайновую кривую ASM

source: Failed to convert Nurbs curve
cs_cz: Nepodařilo se převést křivku Nurbs
es_es: No se pudo convertir curva NURBS
fr_fr: Échec de la conversion de la courbe NURBS
it_it: Impossibile convertire una curva NURBS
pl_pl: Nie można przekształcić krzywej NURBS
pt_br: Falha durante a conversão da curva NURBS
ru_ru: Не удалось преобразовать NURBS-кривую

source: Failed to convert Nurbs surface
cs_cz: Nepodařilo se převést povrch Nurbs
es_es: No se pudo convertir superficie NURBS
fr_fr: Échec de la conversion de la surface NURBS
it_it: Impossibile convertire una superficie NURBS
pl_pl: Nie można przekształcić powierzchni NURBS
pt_br: Falha durante a conversão da superfície NURBS
ru_ru: Не удалось преобразовать NURBS-поверхность

source: Unable to set T-Spline for conversion
cs_cz: Nelze nastavit křivku T-Spline pro převod
es_es: No se puede definir T-Spline para la conversión.
fr_fr: Impossible de définir la T-Spline pour la conversion
it_it: Impossibile impostare la conversione della T-Spline
pl_pl: Nie można ustawić bryły T-splajn do konwersji
pt_br: Não é possível definir a T-Spline para conversão
ru_ru: Не удалось настроить T-сплайн для преобразования

source: Impossible to get face from surface
cs_cz: Není možné získat plochu z povrchu
es_es: No es posible obtener cara de superficie
fr_fr: Impossible d'obtenir la face à partir de la surface
it_it: Impossibile ottenere una faccia dalla superficie
pl_pl: Nie można pobrać płaszczyzny z powierzchni
pt_br: Não é possível obter a face com base na superfície
ru_ru: Невозможно получить грань на основе поверхности

source: Impossible to get edges from face
cs_cz: Není možné získat hrany z plochy
es_es: No es posible obtener aristas de superficie
fr_fr: Impossible d'obtenir les arêtes à partir de la face
it_it: Impossibile ottenere bordi dalla faccia
pl_pl: Nie można pobrać krawędzi z powierzchni
pt_br: Não é possível obter as arestas com base na face
ru_ru: Невозможно получить ребра на основе грани

source: Impossible to get curve from edge
cs_cz: Není možné získat křivku z hrany
es_es: No es posible obtener curva de arista
fr_fr: Impossible d'obtenir la courbe à partir de l'arête
it_it: Impossibile ottenere una curva da un bordo
pl_pl: Nie można pobrać krzywej z krawędzi
pt_br: Não é possível obter a curva com base na aresta
ru_ru: Невозможно получить кривую на основе ребра

source: Cast Coedge is not a TSplineCoedge
cs_cz: Vrhaná společná hrana není objekt TSplineCoedge
es_es: La arista coincidente proyectada no es una TSplineCoedge.
fr_fr: L'arête concourante projetée n'est pas une TSplineCoedge
it_it: Il cospigolo proiettato non è un TSplineCoedge
pl_pl: Rzutowana krawędź wspólna nie jest TSplineCoedge
pt_br: A coaresta projetada não é uma TSplineCoedge
ru_ru: Приведенный объект Coedge не является TSplineCoedge

source: Cast Edge is not a TSplineEdge
cs_cz: Vrhaná hrana není objekt TSplineCoedge
es_es: La arista proyectada no es una TSplineEdge.
fr_fr: L'arête projetée n'est pas une TSplineEdge
it_it: Il bordo proiettato non è un TSplineEdge
pl_pl: Rzutowana krawędź nie jest TSplineEdge
pt_br: A aresta projetada não é uma TSplineEdge
ru_ru: Приведенный объект Edge не является TSplineEdge

source: Cast object is not a TSplineEdge
cs_cz: Vrhaný objekt není objekt TSplineCoedge
es_es: El objeto proyectado no es una TSplineEdge.
fr_fr: L'objet projeté n'est pas une TSplineEdge
it_it: L'oggetto proiettato non è un TSplineEdge
pl_pl: Rzutowany obiekt nie jest TSplineEdge
pt_br: O objeto projetado não é uma TSplineEdge
ru_ru: Приведенный объект не является объектом TSplineEdge

source: Edge has invalid parent
cs_cz: Hrana nemá platný nadřazený prvek
es_es: La arista tiene un elemento superior no válido.
fr_fr: Le parent de l'arête est incorrect
it_it: L'elemento principale del bordo non è valido
pl_pl: Krawędź ma nieprawidłowy element nadrzędny
pt_br: A aresta tem principal inválido
ru_ru: Для ребра задан недопустимый родительский элемент

source: Edge index is invalid
cs_cz: Index hrany není platný
es_es: El índice de aristas no es válido.
fr_fr: L'index de l'arête est incorrect
it_it: L'indice del bordo non è valido
pl_pl: Indeks krawędzi jest niewłaściwy
pt_br: Índice da aresta inválido
ru_ru: Недопустимый индекс ребра

source: Cast Face is not a TSplineFace
cs_cz: Vrhaná plocha není objekt TSplineFace
es_es: La cara proyectada no es una TSplineFace.
fr_fr: La face projetée n'est pas une TSplineFace
it_it: La faccia proiettata non è una TSplineFace
pl_pl: Rzutowana powierzchnia nie jest TSplineFace
pt_br: A face projetada não é uma TSplineFace
ru_ru: Приведенный объект Face не является TSplineFace

source: Cast object is not a TSplineFace
cs_cz: Vrhaný objekt není objekt TSplineFace
es_es: El objeto proyectado no es una TSplineFace.
fr_fr: L'objet projeté n'est pas une TSplineFace
it_it: L'oggetto proiettato non è una TSplineFace
pl_pl: Rzutowany obiekt nie jest TSplineFace
pt_br: O objeto projetado não é uma TSplineFace
ru_ru: Приведенный объект не является TSplineFace

source: Face has invalid parent
cs_cz: Plocha nemá platný nadřazený prvek
es_es: La cara tiene un elemento superior no válido.
fr_fr: Le parent de la face est incorrect
it_it: L'elemento principale della faccia non è valido
pl_pl: Powierzchnia ma nieprawidłowy element nadrzędny
pt_br: A face tem principal inválido
ru_ru: Грань имеет недопустимый родительский объект

source: Could not get bezier patches from the given TSplineFace
cs_cz: Nebylo možné získat Beziérovy záplaty z dané položky TSplineFace
es_es: No se han podido obtener los parches de Bezier desde la TSplineFace especificada.
fr_fr: Impossible d'obtenir les correctifs de Bézier à partir de la TSplineFace indiquée
it_it: Impossibile ottenere superfici chiuse Bezier dalla TSplineFace specificata
pl_pl: Nie można uzyskać ścieżek Beziera z podanego elementu TSplineFace
pt_br: Não foi possível obter os patches de Bezier da TSplineFace fornecida
ru_ru: Не удалось получить замыкающие поверхности Безье из указанного элемента TSplineFace

source: Surface creation error.
cs_cz: Chyba při vytváření povrchu.
es_es: Error de creación de superficie.
fr_fr: Erreur de création de la surface.
it_it: Errore di creazione della superficie.
pl_pl: Błąd podczas tworzenia powierzchni.
pt_br: Erro na criação da superfície.
ru_ru: Ошибка при создании поверхности.

source: Face index is invalid
cs_cz: Index plochy není platný
es_es: El índice de caras no es válido.
fr_fr: L'index de la face est incorrect
it_it: L'indice della faccia non è valido
pl_pl: Niewłaściwy indeks powierzchni
pt_br: Índice da face inválido
ru_ru: Недопустимый индекс грани

source: Cast Loop is not a TSplineLoop
cs_cz: Vrhaná smyčka není objekt TSplineLoop
es_es: El bucle proyectado no es un TSplineLoop.
fr_fr: La boucle projetée n'est pas une TSplineLoop
it_it: Il perimetro proiettato non è un TSplineLoop
pl_pl: Rzutowana pętla nie jest TSplineLoop
pt_br: O contorno projetado não é um TSplineLoop
ru_ru: Приведенный объект Loop не является TSplineLoop

source: Cast object is not a TSplineTopology
cs_cz: Vrhaný objekt není objekt TSplineTopology
es_es: El objeto proyectado no es una TSplineTopology.
fr_fr: L'objet projeté n'est pas une TSplineTopology
it_it: L'oggetto proiettato non è una TSplineTopology
pl_pl: Rzutowany obiekt nie jest TSplineTopology
pt_br: O objeto projetado não é uma TSplineTopology
ru_ru: Приведенный объект не является TSplineTopology

source: Vertex with given index is not present on the t-spline
cs_cz: Na křivce t-spline se nenachází vrchol s daným indexem
es_es: El vértice con el índice especificado no está presente en la T-Spline.
fr_fr: Le sommet avec l'index spécifié n'est pas présent sur la T-Spline
it_it: Il vertice con l'indice specificato non è presente nella T-Spline
pl_pl: Wierzchołek o podanym indeksie nie istnieje na bryle T-splajn
pt_br: O vértice com o índice especificado não está presente na T-Spline
ru_ru: Вершина с заданным индексом отсутствует на Т-сплайне

source: Edge with given index is not present on the t-spline
cs_cz: Na křivce t-spline se nenachází hrana s daným indexem
es_es: La arista con el índice especificado no está presente en la T-Spline.
fr_fr: L'arête avec l'index spécifié n'est pas présente sur la T-Spline
it_it: Nella T-Spline non è presente alcun bordo con l'indice specificato
pl_pl: Brak krawędzi o podanym indeksie w bryle T-splajn
pt_br: A aresta com o índice especificado não está presente na T-Spline
ru_ru: Ребро с заданным индексом отсутствует на Т-сплайне

source: Face with given index is not present on the t-spline
cs_cz: Na křivce t-spline se nenachází plocha s daným indexem
es_es: La cara con el índice especificado no está presente en la T-Spline.
fr_fr: La face avec l'index spécifié n'est pas présente sur la T-Spline
it_it: La faccia con l'indice specificato non è presente nella T-Spline
pl_pl: Brak powierzchni o podanym indeksie w bryle T-splajn
pt_br: A face com o índice especificado não está presente na T-Spline
ru_ru: Грань с заданным индексом отсутствует на Т-сплайне

source: Invalid topology index
cs_cz: Neplatný index topologie
es_es: Índice de topología no válido.
fr_fr: Index de topologie incorrect
it_it: Indice della topologia non valido
pl_pl: Niewłaściwy indeks topologii
pt_br: Índice da topologia inválido
ru_ru: Недопустимый индекс топологии

source: Cast Vertex is not a TSplineVertex
cs_cz: Vrhaný vrchol není objekt TSplineVertex
es_es: El vértice proyectado no es un TSplineVertex.
fr_fr: Le sommet projeté n'est pas un TSplineVertex
it_it: Il vertice proiettato non è un TSplineVertex
pl_pl: Rzutowany wierzchołek nie jest TSplineVertex
pt_br: O vértice projetado não é um TSplineVertex
ru_ru: Приведенная вершина не является TSplineVertex
