Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Unable to compute Curve point at parameter
cs_cz: Nelze vypočítat bod křivky v parametru.
es_es: No se puede calcular Curve point at parameter
fr_fr: Impossible de calculer le point de Curve au niveau du paramètre
it_it: Impossibile calcolare il punto della curva in corrispondenza del parametro
pl_pl: Nie można obliczyć punktu krzywej dla parametru
pt_br: Não é possível calcular o ponto da curva no parâmetro
ru_ru: Не удалось рассчитать точку кривой Curve в параметре

source: Curve has infinite length
cs_cz: Křivka má nekonečnou délku.
es_es: Curve tiene longitud infinita
fr_fr: La courbe possède une longueur infinie
it_it: La curva presenta una lunghezza infinita
pl_pl: Krzywa ma nieskończoną długość
pt_br: A curva tem comprimento infinito
ru_ru: Кривая имеет бесконечную длину

source: Unable to query edges from curve
cs_cz: Nelze se dotázat na hrany z křivky
es_es: No se pueden consultar las aristas de la curva.
fr_fr: Impossible d'obtenir les arêtes à partir de la courbe
it_it: Impossibile eseguire query sui bordi dalla curva
pl_pl: Nie można zbadać krawędzi na podstawie krzywej
pt_br: Nâo foi possível consultar as arestas na curva
ru_ru: Невозможно запросить ребра от кривой

source: Unable to make wire from edge body
cs_cz: Nelze vytvořit drát z hrany tělesa.
es_es: No se puede crear cable a partir de cuerpo de arista
fr_fr: Impossible de créer le fil à partir du corps de l'arête
it_it: Impossibile creare un wire dal corpo dello spigolo
pl_pl: Nie można utworzyć przewodu z bryły krawędzi
pt_br: Não é possível criar a fiação a partir do corpo da aresta
ru_ru: Не удалось создать провод на основе ребра тела

source: Unable to create coedge array
cs_cz: Nelze vytvořit společnou hranu pole.
es_es: No se puede crear matriz de aristas coincidentes
fr_fr: Impossible de créer le réseau d'arêtes concourantes
it_it: Impossibile creare una matrice di cospigoli
pl_pl: Nie można utworzyć szyku wspólnej krawędzi
pt_br: Não é possível criar a matriz coedge
ru_ru: Не удалось создать массив смежных граней

source: Unable to compute edge from curve
cs_cz: Nelze vypočítat hranu z položky Curve.
es_es: No se ha podido calcular arista a partir de Curve
fr_fr: Impossible de calculer l'arête à partir de la curve
it_it: Impossibile calcolare lo spigolo da Curve
pl_pl: Nie można obliczyć krawędzi z curve
pt_br: Não é possível calcular a aresta da curva
ru_ru: Не удалось рассчитать ребро от кривой curve

source: Curve geometry is degenerate or invalid
cs_cz: Geometrie křivky je poškozená nebo není platná.
es_es: La geometría de curva ha degenerado o no es válida
fr_fr: La géométrie de courbe est dégénérée ou incorrecte
it_it: La geometria delle curve è degenerata o non valida
pl_pl: Geometria krzywej jest uszkodzona lub nieprawidłowa
pt_br: A geometria da curva está degenerada ou é inválida
ru_ru: Геометрия кривой является вырожденной или недопустимой

source: Unable to determine if curve is planar
cs_cz: Nelze určit, zda je křivka rovinná.
es_es: No se puede determinar si la curva es plana
fr_fr: Impossible de déterminer si la courbe est plane
it_it: Impossibile determinare se la curva è piana
pl_pl: Nie można określić, czy krzywa jest płaska
pt_br: Não é possível determinar se uma curva é plana
ru_ru: Не удается определить, является ли кривая плоской

source: Curve is not planar: cannot get Curve normal.
cs_cz: Křivka není rovinná: nelze získat normálu křivky.
es_es: Curve no es plana: no se puede obtener normal de Curve.
fr_fr: La courbe n'est pas plane : impossible d'obtenir la normale de la courbe.
it_it: La curva non è piana: impossibile ottenere la normale della curva.
pl_pl: Krzywa nie jest płaska: nie można uzyskać normalnej krzywej.
pt_br: A curva não é plana: não é possível obter a normal da curva.
ru_ru: Кривая не является плоской: не удается получить нормаль кривой.

source: Could not approximate curve
cs_cz: Nelze aproximovat křivku.
es_es: No se ha podido aproximar la curva
fr_fr: Impossible de créer une courbe approximative
it_it: Impossibile eseguire l'approssimazione della curva
pl_pl: Uśrednianie krzywej nie powiodło się
pt_br: Não foi possível estimar a curva
ru_ru: Не удалось аппроксимировать кривую

source: Unable to set extrusion wire
cs_cz: Nelze nastavit drát vysunutí.
es_es: No se puede definir cable de extrusión
fr_fr: Impossible de définir un fil d'extrusion
it_it: Impossibile impostare il wire di estrusione
pl_pl: Nie można ustawić przewodu wyciągnięcia
pt_br: Não é possível definir a fiação da extrusão
ru_ru: Не удалось настроить провод для выдавливания

source: Unable to compute extrude curve
cs_cz: Nelze vypočítat křivku vysunutí.
es_es: No se puede calcular curva de extrusión
fr_fr: Impossible de calculer une courbe d'extrusion
it_it: Impossibile calcolare la curva di estrusione
pl_pl: Nie można obliczyć krzywej wyciągnięcia
pt_br: Não é possível calcular a curva com extrusão
ru_ru: Не удалось рассчитать выдавливание кривой

source: Unable to convert sheet to double sided
cs_cz: Nelze převést list na oboustranný.
es_es: No se puede convertir plano a dos lados
fr_fr: Impossible de convertir la feuille en feuille à deux faces
it_it: Impossibile convertire il foglio in bilaterale
pl_pl: Nie można przekształcić arkusza na dwustronny
pt_br: Não é possível converter a folha em dupla face
ru_ru: Не удалось преобразовать лист в двусторонний

source: Cannot create a Solid from an open Curve
cs_cz: Nelze vytvořit těleso z otevřené křivky.
es_es: No se puede crear un Solid a partir de una Curve abierta
fr_fr: Impossible de créer un solide à partir d'une Curve ouverte
it_it: Impossibile creare un solido da una curva aperta
pl_pl: Nie można utworzyć bryły z otwartej krzywej
pt_br: Não é possível criar um sólido a partir de uma curva aberta
ru_ru: Невозможно создать тело из разомкнутой кривой

source: Unable to set Curve and Vector for extrusion.
cs_cz: Nelze nastavit křivku a vektor pro vysunutí.
es_es: No se puede definir Curve y Vector para extrusión.
fr_fr: Impossible de définir une Curve et un Vector pour l'extrusion.
it_it: Impossibile impostare la curva e il vettore per l'estrusione.
pl_pl: Nie można ustawić krzywej i wektora do wyciągania.
pt_br: Não é possível definir curva e vetor para extrusão.
ru_ru: Не удалось настроить кривую и вектор для выдавливания.

source: Unable to instruct ASM to extrude Curve as a Solid.
cs_cz: Nelze instruovat ASM k vysunutí křivky jako tělesa.
es_es: No se puede indicar a ASM para extruir Curve como Solid.
fr_fr: Impossible de demander à ASM d'extruder la Curve en tant que Solid.
it_it: Impossibile impostare ASM per estrudere la curva come solido.
pl_pl: Nie można ustawić ASM w celu wyciągnięcia krzywej jako bryły.
pt_br: Não é possível instruir o ASM para efetuar a extrusão da curva como um sólido.
ru_ru: Не удалось настроить ASM для выдавливания кривой в качестве тела.

source: Unable to extrude curve.
cs_cz: Nelze vysunout křivku.
es_es: No se puede extruir curva.
fr_fr: Impossible d'extruder la courbe.
it_it: Impossibile estrudere la curva.
pl_pl: Nie można wyciągnąć krzywej.
pt_br: Não é possível efetuar extrusão da curva.
ru_ru: Не удалось выдавить кривую.

source: Extrusion computed but cannot determine result type
cs_cz: Vysunutí je vypočteno, ale nelze určit typ výsledku.
es_es: Extrusión calculada pero no se puede determinar tipo de resultado
fr_fr: Extrusion calculée, mais impossible de déterminer le type de résultat
it_it: Estrusione calcolata, ma non è possibile determinare il tipo di risultato
pl_pl: Wyciągnięcie obliczone, ale nie można określić typu wyniku
pt_br: Extrusão calculada, mas não é possível determinar o tipo de resultado
ru_ru: Выдавливание вычислено, но определить тип результата не удалось

source: Unable to set sweep profile and path
cs_cz: Nelze vypočítat tažení povrchu na trajektorii.
es_es: No se puede definir trayectoria y perfil de barrido
fr_fr: Impossible de définir le profil et la trajectoire de balayage
it_it: Impossibile impostare il profilo e il percorso di sweep
pl_pl: Nie można ustawić profilu przeciągnięcia i ścieżki
pt_br: Não é possível definir o perfil e o caminho da extrusão por percurso
ru_ru: Не удалось настроить профиль и траекторию сдвига

source: Unable to set the result to be solid or not!
cs_cz: Nelze nastavit, zda bude výsledek těleso, či nikoli!
es_es: No se puede definir que el resultado sea sólido o no
fr_fr: Impossible de définir le résultat pour obtenir un solide ou non.
it_it: Impossibile definire se il risultato è un solido.
pl_pl: Nie można ustawić, aby wynik był bryłą lub nie!
pt_br: Não é possível definir o resultado para ser ou não um sólido!
ru_ru: Не удалось задать результат (тело или нет).

source: Unable to compute surface sweep on rail
cs_cz: Nelze provést aproximaci povrchu.
es_es: No se puede calcular barrido de superficie en barandal
fr_fr: Impossible de calculer la surface de balayage sur traverse
it_it: Impossibile calcolare l'estrusione su percorso della superficie lungo la guida
pl_pl: Nie można obliczyć przeciągnięcia powierzchni na poręczy
pt_br: Não é possível calcular a extrusão por percurso da superfície no corrimão
ru_ru: Не удалось рассчитать сдвиг поверхности по направляющей

source: Unable to revolve curve
cs_cz: Nelze otočit křivku.
es_es: No se puede girar curva
fr_fr: Impossible de faire subir une révolution à une courbe
it_it: Impossibile eseguire la rivoluzione della curva
pl_pl: Nie można obrócić krzywej
pt_br: Não é possível girar a curva
ru_ru: Не удалось выполнить вращение кривой

source: Unable to set as solid or not
cs_cz: Nelze nastavit jako plné nebo nikoli.
es_es: No se puede definir como sólido o no
fr_fr: Impossible de définir en tant que solide ou non
it_it: Impossibile impostare come solido o non solido
pl_pl: Nie można ustawić jako bryłę lub nie
pt_br: Não é possível definir como sólido ou não
ru_ru: Не удалось задать (тело или нет)

source: Unable to set as double sided
cs_cz: Nelze nastavit jako oboustranné.
es_es: No se puede definir como de dos lados
fr_fr: Impossible d'attribuer deux côtés
it_it: Impossibile impostare come bilaterale
pl_pl: Nie można ustawić jako dwustronnej
pt_br: Não é possível definir como dupla face
ru_ru: Не удалось задать как двусторонний

source: Unable to retain mergeable edges
cs_cz: Nelze zachovat slučitelné hrany.
es_es: No se puede conservar aristas fusionables
fr_fr: Impossible de conserver les arêtes fusionnables
it_it: Impossibile conservare i bordi unibili
pl_pl: Nie można zachować krawędzi możliwych do połączenia
pt_br: Não é possível reter as arestas mescláveis
ru_ru: Не удалось сохранить ребра, пригодные для объединения

source: Unable to compute revolve
cs_cz: Nelze vypočítat otočení.
es_es: No se puede calcular revolución
fr_fr: Impossible de calculer une révolution
it_it: Impossibile calcolare la rivoluzione
pl_pl: Nie można obliczyć obrotu
pt_br: Não é possível calcular o giro
ru_ru: Не удалось рассчитать вращение

source: Unable to convert Curve to NURBS curve.
cs_cz: Nelze převést křivku na křivku NURBS.
es_es: No se puede convertir la curva en una curva NURBS.
fr_fr: Impossible de convertir la Curve en courbe NURBS.
it_it: Impossibile convertire la curva nella curva NURBS.
pl_pl: Nie można przekonwertować krzywej na krzywą NURBS.
pt_br: Não foi possível converter a curva em uma curva NURBS.
ru_ru: Невозможно преобразовать кривую в NURBS-кривую.

source: The input normal vector is not parallel to the curve's plane normal
cs_cz: Vstupní normálový vektor není rovnoběžný s normálou roviny křivky.
es_es: El vector normal de entrada no es paralelo a la normal del plano de la curva.
fr_fr: Le vecteur de la normale d'entrée n'est pas parallèle à la normale du plan de la courbe
it_it: Il vettore della normale di input non è parallelo alla normale del piano della curva
pl_pl: Wejściowy wektor normalny nie jest równoległy do wektora normalnego płaszczyzny krzywej
pt_br: O vetor normal de entrada não é paralelo à normal do plano da curva
ru_ru: Входной вектор нормали не параллелен нормали плоскости кривой

source: Unable to offset curve
cs_cz: Nelze odsadit křivku.
es_es: No se puede desfasar curva
fr_fr: Impossible de décaler la courbe
it_it: Impossibile eseguire l'offset della curva
pl_pl: Nie można odsunąć krzywej
pt_br: Não é possível deslocar a curva
ru_ru: Не удалось сместить кривую

source: Unable to get edge from wire
cs_cz: Nelze získat hranu z drátu.
es_es: No se puede obtener arista a partir de cable.
fr_fr: Impossible d'obtenir l'arête du fil
it_it: Impossibile ottenere il bordo dal wire
pl_pl: Nie można pobrać krawędzi z przewodu
pt_br: Não é possível obter a aresta da fiação
ru_ru: Не удалось получить ребро из провода

source: WireCurve does not support wires with more than one edge
cs_cz: Prvek WireCurve nepodporuje dráty s více hranami.
es_es: WireCurve no admite cables con más de una arista
fr_fr: WireCurve ne prend pas en charge les fils avec plusieurs arêtes
it_it: WireCurve non supporta i wire con più di un bordo
pl_pl: WireCurve nie obsługuje przewodów z więcej niż jedną krawędzią
pt_br: WireCurve não suporta fiações com mais de uma aresta
ru_ru: WireCurve не поддерживает провода с более чем одной кромкой

source: Unable to extract curve from edge
cs_cz: Nelze extrahovat položku Curve z položky Edge.
es_es: No se puede extraer Curve a partir de Edge
fr_fr: Impossible d'extraire la curve à partir de l'edge
it_it: Impossibile estrarre Curve da Edge
pl_pl: Nie można wyodrębnić curve z edge
pt_br: Não é possível extrair a curva a partir da aresta
ru_ru: Не удалось извлечь кривую curve из ребра edge

source: Unable to blend between curves
cs_cz: Nelze vytvořit přechod mezi křivkami.
es_es: No se puede fusionar entre curvas
fr_fr: Impossible de fusionner des courbes
it_it: Impossibile effettuare l'unione tra curve
pl_pl: Nie można wykonać połączenia między krzywymi
pt_br: Não é possível mesclar entre curvas
ru_ru: Не удалось выполнить переход между кривыми

source: Unable to make parameter line on surface
cs_cz: Nelze vytvořit parametrickou čáru na povrchu.
es_es: No se puede crear línea de parámetro en superficie
fr_fr: Impossible de créer la ligne de paramètre sur la surface
it_it: Impossibile creare la linea del parametro sulla superficie
pl_pl: Nie można utworzyć linii parametru na powierzchni
pt_br: Não é possível criar a linha de parâmetro na superfície
ru_ru: Не удалось создать параметрическую линию на поверхности

source: Unable to make geodesic curves with ASM 219
cs_cz: Nelze vytvořit geodetické křivky pomocí ASM 219.
es_es: No se puede crear curvas geodésicas con ASM 219
fr_fr: Impossible de créer des courbes géodésiques avec ASM 219
it_it: Impossibile creare curve geodetiche con ASM 219
pl_pl: Nie można utworzyć krzywych geodezyjnych przy użyciu ASM 219
pt_br: Não é possível criar curvas geodésicas com ASM 219
ru_ru: Не удалось создать геодезические кривые с ASM 219

source: Unable to make iso curve on surface
cs_cz: Nelze vytvořit izometrickou křivku na povrchu.
es_es: No se puede crear iso curve en superficie
fr_fr: Impossible de créer une courbe iso sur la surface
it_it: Impossibile creare una curva iso sulla superficie
pl_pl: Nie można utworzyć izokrzywej na powierzchni
pt_br: Não é possível criar a curva iso na superfície
ru_ru: Не удалось создать ISO-кривую на поверхности

source: Unable to project curve on plane
cs_cz: Nelze promítnout křivku na rovinu.
es_es: No se puede Project curva en Plane
fr_fr: Impossible de projeter la courbe sur le plan
it_it: Impossibile proiettare la curva sul piano
pl_pl: Nie można wykonać rzutowania krzywej na płaszczyźnie
pt_br: Não é possível projetar a curva no plano
ru_ru: Не удалось спроецировать кривую на плоскость

source: Unable to compute Curve projection on Surface
cs_cz: Nelze vypočítat promítnutí křivky na povrch.
es_es: No se puede calcular proyección de Curve en Surface
fr_fr: Impossible de calculer la projection de la Curve sur la Surface
it_it: Impossibile calcolare la proiezione delle curve sulla superficie
pl_pl: Nie można obliczyć rzutowania krzywej na powierzchnię
pt_br: Não é possível calcular a projeção da curva na superfície
ru_ru: Не удалось рассчитать проекцию кривой Curve на поверхность

source: Unable to pull Curve onto Surface
cs_cz: Nelze táhnout křivku na povrch.
es_es: No se puede desplazar Curve en Surface
fr_fr: Impossible d'extraire une Curve sur la Surface
it_it: Impossibile estrarre la curva sulla superficie
pl_pl: Nie można wyciągnąć krzywej na płaszczyźnie
pt_br: Não é possível empurrar a curva para a superfície
ru_ru: Не удалось перетащить кривую на поверхность

source: Unable to make geodesic curves
cs_cz: Nelze vytvořit geodetické křivky.
es_es: No se puede crear curvas geodésicas
fr_fr: Impossible de créer des courbes géodésiques
it_it: Impossibile creare curve geodetiche
pl_pl: Nie można utworzyć krzywych geodezyjnych
pt_br: Não é possível criar curvas geodésicas
ru_ru: Не удалось создать геодезические кривые

source: Unable to approximate curve with arc and line segments
cs_cz: Nelze aproximovat křivku se segmenty oblouků a úseček.
es_es: No se puede aproximar curva con segmentos de línea y arco
fr_fr: Impossible de créer une courbe approximative avec des segments de ligne et d'arc
it_it: Impossibile approssimare la curva con segmenti di arco e linea
pl_pl: Nie można przybliżyć krzywej z segmentami łuków i linii
pt_br: Não é possível estimar a curva com segmentos de linha e arco
ru_ru: Не удалось аппроксимировать кривую с сегментами линий и дуг

source: Conversion to Arcs and Lines failed, some parts of Curve could not be converted
cs_cz: Převod na oblouky a úsečky se nezdařil, některé části křivky nelze převést.
es_es: Error en conversión en Arcs y Lines; no se ha podido convertir algunas partes de Curve
fr_fr: La conversion des Arcs et des Lines a échoué, certaines parties de la Curve n'ont pas pu être converties
it_it: Conversione da archi e linee non riuscita, non è stato possibile convertire alcune parti della curva
pl_pl: Konwersja do łuków i linii nie powiodła się; niektórych części krzywej nie można przekształcić
pt_br: Falha na conversão para arcos e linhas, algumas partes da curva não puderam ser convertidas
ru_ru: Преобразование в дуги и отрезки не удалось, некоторые части кривой невозможно преобразовать

source: Curve must be divided into one or more parts
cs_cz: Křivka musí být rozdělena na jednu nebo více částí.
es_es: Curve debe estar dividida en una o más partes
fr_fr: La Curve doit être divisée en un ou plusieurs éléments
it_it: La curva deve essere divisa in una o più parti
pl_pl: Krzywa musi zostać podzielona na jedną lub więcej części
pt_br: A curva deve ser dividida em uma ou mais partes
ru_ru: Кривая должна быть разделена на одну или несколько частей

source: Unable to divide infinite curve equally by length
cs_cz: Nelze rozdělit nekonečnou křivku rovnoměrně podle délky.
es_es: No se puede dividir curva infinita uniformemente por longitud
fr_fr: Impossible de diviser la courbe infinie de façon égale par la longueur
it_it: Impossibile dividere una curva infinita in modo uniforme in base alla lunghezza
pl_pl: Nie można równo podzielić nieskończonej krzywej według długości
pt_br: Não é possível dividir a curva infinita igualmente pelo comprimento
ru_ru: Не удалось разделить бесконечную кривую на равные части по длине

source: Unable to divide curve equally by length
cs_cz: Nelze rozdělit křivku rovnoměrně podle délky.
es_es: No se puede dividir curva uniformemente por longitud
fr_fr: Impossible de diviser la courbe de façon égale par la longueur
it_it: Impossibile dividere la curva in modo uniforme in base alla lunghezza
pl_pl: Nie można równo podzielić krzywej według długości
pt_br: Não é possível dividir a curva igualmente pelo comprimento
ru_ru: Не удалось разделить кривую на равные части по длине

source: Input segment length must be greater than 0
cs_cz: Zadaná délka segmentu musí být větší než 0
es_es: La longitud del segmento de entrada debe ser mayor que 0.
fr_fr: La longueur du segment d'entrée doit être supérieure à 0
it_it: La lunghezza del segmento di input deve essere superiore a 0
pl_pl: Długość segmentu wejściowego musi być większa niż 0
pt_br: O comprimento do segmento de entrada deve ser maior do que 0
ru_ru: Длина входного сегмента должна быть больше 0

source: Unable to divide infinite curve by length
cs_cz: Nelze rozdělit nekonečnou křivku podle délky.
es_es: No se puede dividir curva infinita por longitud
fr_fr: Impossible de diviser la courbe infinie par la longueur
it_it: Impossibile dividere una curva infinita in base alla lunghezza
pl_pl: Nie można podzielić nieskończonej krzywej według długości
pt_br: Não é possível dividir a curva infinita pelo comprimento
ru_ru: Не удалось разделить бесконечную кривую по длине

source: Unable to divide infinite curve equally by distance
cs_cz: Nelze rozdělit nekonečnou křivku rovnoměrně podle vzdálenosti.
es_es: No se puede dividir curva infinita uniformemente por distancia
fr_fr: Impossible de diviser la courbe infinie de façon égale par la distance
it_it: Impossibile dividere una curva infinita in modo uniforme in base alla distanza
pl_pl: Nie można równo podzielić nieskończonej krzywej według odległości
pt_br: Não é possível dividir a curva infinita igualmente pela distância
ru_ru: Не удалось разделить бесконечную кривую на равные части по расстоянию

source: Unable to divide curve equally by distance
cs_cz: Nelze rozdělit křivku rovnoměrně podle vzdálenosti.
es_es: No se puede dividir curva uniformemente por distancia
fr_fr: Impossible de diviser la courbe de façon égale par la distance
it_it: Impossibile dividere in modo uniforme la curva in base alla distanza
pl_pl: Nie można równo podzielić krzywej według odległości
pt_br: Não é possível dividir a curva igualmente pela distância
ru_ru: Не удалось разделить кривую на равные части по расстоянию

source: could not solve for equal distances
cs_cz: nelze vyřešit pro stejné vzdálenosti.
es_es: no se ha podido resolver para distancias iguales
fr_fr: impossible de résoudre pour les distances égales
it_it: Impossibile risolvere per distanze uguali
pl_pl: nie można znaleźć rozwiązania dla równych odległości
pt_br: não foi possível solucionar para distâncias iguais
ru_ru: не удалось выполнить расчет для равных расстояний

source: could not solve for equal chord lengths
cs_cz: nepodařilo se vyřešit pro shodné délky tětiv
es_es: no se ha podido resolver para longitudes de cordón uniformes.
fr_fr: résolution impossible pour des longueurs de corde égales
it_it: impossibile risolvere problemi di uguale lunghezza della corda
pl_pl: nie można znaleźć rozwiązania dla równych długości cięciwy
pt_br: não foi possível solucionar para comprimentos de corda iguais
ru_ru: Не удалось выполнить расчет для равных длин хорды

source: Unable to divide curve by distance
cs_cz: Nelze rozdělit křivku podle vzdálenosti.
es_es: No se puede dividir curva por distancia
fr_fr: Impossible de diviser la courbe par la distance
it_it: Impossibile dividere la curva in base alla distanza
pl_pl: Nie można podzielić krzywej według odległości
pt_br: Não é possível dividir a curva pela distância
ru_ru: Не удалось разделить кривую по расстоянию

source: Cannot simplify Curve
cs_cz: Nelze zjednodušit křivku.
es_es: No se puede simplificar Curve.
fr_fr: Impossible de simplifier la courbe
it_it: Impossibile semplificare la curva
pl_pl: Nie można uprościć krzywej
pt_br: Não é possível simplificar a curva
ru_ru: Невозможно упростить кривую
