Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Unable to get the FACE's range in Surface constructor.
cs_cz: Nelze získat rozsah PLOCHY v konstruktoru povrchu.
es_es: No se puede obtener el rango de FACE del constructor de Surface.
fr_fr: Impossible d'obtenir l'intervalle de la FACE dans le constructeur de Surface.
it_it: Impossibile ottenere l'intervallo della FACCIA nel costruttore della superficie.
pl_pl: Nie można pobrać zakresu POWIERZCHNI w konstruktorze powierzchni.
pt_br: Não é possível obter o intervalo da FACE no construtor de superfície.
ru_ru: Невозможно получить диапазон элемента FACE в конструкторе поверхности.

source: Cast object is not a Surface
cs_cz: Vrhaný objekt není povrch.
es_es: El objeto proyectado no es una Surface
fr_fr: L'objet projeté n'est pas une surface
it_it: L'oggetto proiettato non è una superficie
pl_pl: Rzutowany obiekt nie jest powierzchnią
pt_br: O objeto projetado não é uma superfície
ru_ru: Приведенный объект не является поверхностью

source: Unable to patch a single, non-closed curve
cs_cz: Nelze opravit jednu, nezavřenou křivku
es_es: No se puede aplicar un parche a una única curva no cerrada.
fr_fr: Impossible de corriger une seule courbe non fermée
it_it: Impossibile coprire una curva singola non chiusa
pl_pl: Nie można zaślepić pojedynczej krzywej niezamkniętej
pt_br: Não é possível corrigir uma curva única, não fechada
ru_ru: Невозможно замкнуть одинарную незамкнутую кривую

source: Unable to patch curve
cs_cz: Nelze opravit křivku.
es_es: No se puede aplicar parche a curva
fr_fr: Impossible de corriger la courbe
it_it: Impossibile coprire la curva
pl_pl: Nie można zaślepić krzywej
pt_br: Não é possível corrigir a curva
ru_ru: Не удалось замкнуть кривую

source: Error creating Surface: Points are coincident
cs_cz: Chyba při vytváření povrchu: Body jsou totožné.
es_es: Error al crear Surface: los Points son coincidentes
fr_fr: Erreur lors de la création de la Surface: les points sont coïncidents.
it_it: Errore durante la creazione della superficie: i punti sono coincidenti
pl_pl: Błąd podczas tworzenia powierzchni: punkty są współliniowe
pt_br: Erro ao criar a superfície: os pontos são coincidentes
ru_ru: Ошибка при создании поверхности: точки совпадают

source: Error creating Surface perimeter Curves
cs_cz: Chyba při vytváření obvodových křivek povrchu
es_es: Error al crear curvas de perímetro de superficie.
fr_fr: Erreur lors de la création des courbes du périmètre de la surface
it_it: Errore durante la creazione di curve per il perimetro della superficie
pl_pl: Błąd podczas tworzenia krzywych obwodu powierzchni
pt_br: Erro ao criar as curvas do perímetro da superfície
ru_ru: Ошибка при создании кривых для периметра поверхности

source: Error using perimeter Curves to make Surface
cs_cz: Chyba při vytváření povrchu pomocí obvodových křivek
es_es: Error al utilizar las curvas del perímetro para crear una superficie.
fr_fr: Erreur d'utilisation des courbes du périmètre pour créer une surface
it_it: Errore durante l'utilizzo delle curve del perimetro per creare una superficie
pl_pl: Błąd podczas tworzenia powierzchni za pomocą parametrów krzywych
pt_br: Erro ao usar as curvas do perímetro para criar a superfície
ru_ru: Ошибка при использовании кривых периметра для создания поверхности

source: Unable to make wire from edges
cs_cz: Nelze vytvořit drát z hran.
es_es: No se puede crear cable a partir de aristas.
fr_fr: Impossible de créer le fil à partir des arêtes
it_it: Impossibile creare wire dai bordi
pl_pl: Nie można utworzyć przewodu z krawędzi
pt_br: Não é possível criar a fiação com base nas arestas
ru_ru: Не удалось создать провод из ребер

source: Unable to create polygon
cs_cz: Nelze vytvořit polygon.
es_es: No se puede crear polígono
fr_fr: Impossible de créer un polygone
it_it: Impossibile creare il poligono
pl_pl: Nie można utworzyć wielokąta
pt_br: Não é possível criar o polígono
ru_ru: Не удалось создать полигон

source: Invalid face!
cs_cz: Neplatná plocha
es_es: Cara no válida
fr_fr: Face incorrecte.
it_it: Faccia non valida.
pl_pl: Nieprawidłowa powierzchnia!
pt_br: Face inválida!
ru_ru: Недопустимая грань!

source: Lofted Curve, but could not convert to double-sided
cs_cz: Šablonovaná křivka. Nelze ji však převést na oboustranný objekt.
es_es: La Curve se ha solevado, pero no se ha podido convertir a dos lados
fr_fr: Curve lissée, mais impossible de convertir en deux côtés
it_it: Curva di loft; impossibile convertirla in curva bilaterale
pl_pl: Wyciągnięto krzywą, ale nie można przekształcić na dwustronną
pt_br: Curva elevada, mas não foi possível converter em dupla face
ru_ru: Лофтинг кривой удался, но ее не удалось преобразовать в двустороннюю

source: Swept Curve, but could not convert to double sided
cs_cz: Tažená křivka. Nelze ji však převést na oboustranný objekt.
es_es: Se ha barrido la Curve, pero no se ha podido convertir a dos lados
fr_fr: Curve balayée, mais impossible de convertir en deux côtés
it_it: Curva di sweep; impossibile convertirla in curva bilaterale
pl_pl: Wyciągnięto krzywą po ścieżce, ale nie można przekształcić na dwustronną
pt_br: Curva com extrusão por percurso, mas não foi possível converter em dupla face
ru_ru: Кривая была сдвинута, но не удалось преобразовать ее в двустороннюю

source: Unable to approximate surface
cs_cz: Nelze aproximovat povrch
es_es: No se puede aproximar la superficie.
fr_fr: Impossible d'obtenir la surface approximative
it_it: Impossibile definire un'approssimazione della superficie
pl_pl: Nie można przybliżyć powierzchni
pt_br: Não é possível aproximar a superfície
ru_ru: Не удалось аппроксимировать поверхность

source: Unable to extrude non-planar face without vector
cs_cz: Nelze vysunout nerovinnou plochu bez vektoru.
es_es: No se puede extruir cara no plana sin vector
fr_fr: Impossible d'extruder une face non plane sans vecteur
it_it: Impossibile estrudere una faccia non piana senza un vettore
pl_pl: Nie można wyciągnąć niepłaskiej powierzchni bez wektora
pt_br: Não é possível efetuar a extrusão de uma face não plana sem vetor
ru_ru: Не удалось выдавить неплоскую грань без вектора

source: Unable to extrude surface
cs_cz: Nelze vysunout povrch
es_es: No se puede extruir la superficie.
fr_fr: Impossible d'extruder une surface
it_it: Impossibile estrudere la superficie
pl_pl: Nie można wyciągnąć powierzchni
pt_br: Não é possível efetuar extrusão da superfície
ru_ru: Не удалось выдавить поверхность

source: Unable to compute extrusion of surface
cs_cz: Nelze vypočítat vysunutí povrchu
es_es: No se puede calcular la extrusión de la superficie.
fr_fr: Impossible de calculer l'extrusion de surface
it_it: Impossibile calcolare l'estrusione della superficie
pl_pl: Nie można obliczyć wyciągnięcia powierzchni
pt_br: Não é possível calcular a extrusão da superfície
ru_ru: Не удалось рассчитать выдавливание поверхности

source: Unable to set BODY thicken data
cs_cz: Nelze nastavit data zesílení TĚLESA.
es_es: No se puede definir datos de ensanchado de BODY
fr_fr: Impossible de définir les données d'épaississement BODY
it_it: Impossibile impostare i dati di ispessimento del CORPO
pl_pl: Nie można ustawić danych pogrubienia bryły
pt_br: Não é possível definir os dados da espessura de BODY
ru_ru: Не удалось настроить данные утолщения тела BODY

source: Unable to set thicken operation to both sides
cs_cz: Nelze nastavit operaci zesílení obou stran.
es_es: No se puede definir operación de ensanchado en ambos lados
fr_fr: Impossible de définir l'opération d'épaississement sur deux côtés
it_it: Impossibile impostare l'operazione di ispessimento per entrambi i lati
pl_pl: Nie można ustawić operacji pogrubienia dla obu stron
pt_br: Não é possível definir a operação de espessura para ambos os lados
ru_ru: Не удалось настроить операцию утолщения для обеих сторон

source: Unable to compute thickened face
cs_cz: Nelze vypočítat zesílenou plochu.
es_es: No se puede calcular cara ensanchada
fr_fr: Impossible de calculer une face épaissie
it_it: Impossibile calcolare la faccia ispessita
pl_pl: Nie można obliczyć pogrubionej powierzchni
pt_br: Não é possível calcular a face espessa
ru_ru: Не удалось рассчитать утолщенную грань

source: Unable to set BODY offset data
cs_cz: Nelze nastavit data odsazení TĚLESA.
es_es: No se puede definir datos de desfase de BODY
fr_fr: Impossible de définir les données de décalage BODY
it_it: Impossibile impostare i dati di offset del CORPO
pl_pl: Nie można ustawić danych przesunięcia bryły
pt_br: Não é possível definir os dados de deslocamento de BODY
ru_ru: Не удалось настроить данные смещения тела BODY

source: Unable to set whether the result is attached or not
cs_cz: Nelze nastavit, zda je výsledek připojen či nikoli.
es_es: No se puede definir si el resultado se enlaza o no
fr_fr: Impossible de définir si le résultat est associé ou non
it_it: Impossibile definire se il risultato è associato o meno
pl_pl: Nie można ustawić, czy wynik jest dołączany, czy nie
pt_br: Não é possível definir se o resultado é ou não anexado
ru_ru: Не удалось настроить тип результата — присоединен или нет

source: Could not offset surface
cs_cz: Nelze odsadit povrch.
es_es: No se ha podido desfasar la superficie.
fr_fr: Impossible de décaler la surface
it_it: Impossibile eseguire l'offset della superficie
pl_pl: Nie można odsunąć powierzchni
pt_br: Não foi possível deslocar a superfície
ru_ru: Не удалось сместить поверхность

source: Unable to evaluate normal of Surface.
cs_cz: Nelze vyhodnotit normálu povrchu.
es_es: No se puede evaluar normal de Surface
fr_fr: Impossible d'évaluer la normale de la Surface.
it_it: Impossibile valutare la normale della superficie.
pl_pl: Nie można wyznaczyć normalnej powierzchni.
pt_br: Não é possível avaliar a normal da superfície.
ru_ru: Не удалось вычислить нормаль поверхности Surface.

source: Unable union two surfaces
cs_cz: Nepodařilo se sjednotit dva povrchy
es_es: No se pueden unir dos superficies.
fr_fr: Impossible d'unir deux surfaces
it_it: Impossibile unire due superfici
pl_pl: Nie można zsumować dwóch powierzchni
pt_br: Não é possível unir duas superfícies
ru_ru: Не удалось объединить две поверхности

source: Cannot union an empty list of surfaces
cs_cz: Není možné sjednotit prázdný seznam povrchů
es_es: No se puede unir una lista vacía de superficies.
fr_fr: Impossible d'unir une liste de surfaces vide
it_it: Impossibile unire un elenco vuoto di superfici
pl_pl: Nie można połączyć pustej listy powierzchni
pt_br: Não é possível unir uma lista de superfícies vazia
ru_ru: Невозможно объединить пустой список поверхностей

source: Unable difference two surfaces
cs_cz: Nepodařilo se rozdělit dva povrchy
es_es: No se pueden restar dos superficies.
fr_fr: Impossible de différentier deux surfaces
it_it: Impossibile definire la differenza tra due superfici
pl_pl: Nie można utworzyć różnicy dwóch powierzchni
pt_br: Não é possível diferenciar duas superfícies
ru_ru: Не удалось дифференцировать две поверхности

source: can not evaluate curvature
cs_cz: Zakřivení nelze vyhodnotit.
es_es: no se puede evaluar curvatura
fr_fr: impossible d'évaluer la courbure
it_it: impossibile valutare la curvatura
pl_pl: nie można ocenić krzywizny
pt_br: não é possível avaliar a curvatura
ru_ru: не удалось вычислить кривизну

source: Unable to reverse the body
cs_cz: Nelze obrátit těleso
es_es: No se puede invertir el cuerpo.
fr_fr: Impossible d'inverser le corps
it_it: Impossibile invertire il corpo
pl_pl: Nie można odwrócić bryły
pt_br: Não é possível inverter o corpo
ru_ru: Невозможно обратить тело

source: Cannot instruct ASM to make a Surface.
cs_cz: Nelze instruovat ASM k vytvoření povrchu.
es_es: No se puede instruir a ASM para crear una Surface.
fr_fr: Impossible de demander à ASM de créer une surface.
it_it: Impossibile impostare ASM per creare una superficie.
pl_pl: Nie można ustawić ASM, aby utworzyć powierzchnię.
pt_br: Não é possível instruir o ASM para criar uma superfície.
ru_ru: Не удалось настроить ASM для создания поверхности.

source: The distance between base and the first pick point must be greater than 0.
cs_cz: Vzdálenost mezi základním a prvním vybraným bodem musí být větší než 0.
es_es: La distancia entre la base y el primer punto de selección debe ser mayor que 0.
fr_fr: La distance entre la base et le premier point de sélection doit être supérieure à 0.
it_it: La distanza tra la base e il primo punto di selezione deve essere maggiore di 0.
pl_pl: Odległość między podstawą a pierwszym punktem wskazania musi być większa niż 0.
pt_br: A distância entre a base e o primeiro ponto de seleção deve ser maior do que 0.
ru_ru: Расстояние между базовой и первой точкой выбора должно быть больше 0.

source: The distance between base and the second pick point must be greater than 0.
cs_cz: Vzdálenost mezi základním a druhým vybraným bodem musí být větší než 0.
es_es: La distancia entre la base y el segundo punto de selección debe ser mayor que 0.
fr_fr: La distance entre la base et le second point de sélection doit être supérieure à 0.
it_it: La distanza tra la base e il secondo punto di selezione deve essere maggiore di 0.
pl_pl: Odległość między podstawą a drugim punktem wskazania musi być większa niż 0.
pt_br: A distância entre a base e o segundo ponto de seleção deve ser maior do que 0.
ru_ru: Расстояние между базовой и второй точкой выбора должно быть больше 0.

source: The base point and first pick point must not be coincident!
cs_cz: Základní bod a první vybraný bod nesmí být totožné.
es_es: El punto base y el primer punto de selección no deben ser coincidentes.
fr_fr: Le point de base et le premier point de sélection ne doivent pas coïncider.
it_it: Il punto di base e il primo punto di selezione non devono essere coincidenti.
pl_pl: Punkt bazowy i pierwszy punkt wskazania nie mogą się pokrywać!
pt_br: O ponto base e o primeiro ponto de seleção não devem ser coincidentes!
ru_ru: Базовая точка и первая точка выбора не должны совпадать!

source: The scale factor is 0! The base point and second pick point may be coincident!
cs_cz: Měřítko má hodnotu 0. Základní bod a druhý vybraný bod jsou pravděpodobně totožné.
es_es: El factor de escala es 0. El punto base y el segundo punto de selección pueden ser coincidentes.
fr_fr: Le facteur d'échelle est de 0. Le point de base et le second point de sélection peuvent coïncider.
it_it: Il fattore di scala è 0. Il punto base e il secondo punto di selezione potrebbero essere coincidenti.
pl_pl: Współczynnik skali jest 0! Punkt bazowy i drugi punkt wskazania mogą się pokrywać!
pt_br: O fator de escala é 0! O ponto base e o segundo ponto de seleção podem ser coincidentes!
ru_ru: Масштабный коэффициент равен 0! Базовая точка и вторая точка выбора должны совпадать!

source: Cast object is not a Vector
cs_cz: Vrhaný objekt není položka Vector.
es_es: El objeto proyectado no es un Vector
fr_fr: L'objet projeté n'est pas un Vector
it_it: L'oggetto proiettato non è Vector
pl_pl: Rzutowany obiekt nie jest Vector
pt_br: O objeto projetado não é um vetor
ru_ru: Приведенный объект не является объектом Vector

source: attempt to set length of zero length vector
cs_cz: pokus o nastavení délky vektoru s nulovou délkou
es_es: intento de definir longitud de vector con longitud cero
fr_fr: tentative de définition de la longueur du vecteur de longueur nulle
it_it: Si è tentato di impostare la lunghezza di un vettore di lunghezza zero
pl_pl: próba ustawienia wektora o zerowej długości
pt_br: tentativa de definir o comprimento do vetor de comprimento zero
ru_ru: попытка установить длину вектора нулевой длины

source: Can't get curve from coedge
cs_cz: Nelze získat křivku ze společné hrany
es_es: No se puede obtener una curva de una arista coincidente.
fr_fr: Impossible d'obtenir la courbe à partir de l'arête concourante
it_it: Impossibile ottenere la curva dal cospigolo
pl_pl: Nie można otrzymać krzywej z krawędzi wspólnej
pt_br: Não é possível obter a curva da coaresta
ru_ru: Не удалось получить кривую из смежного ребра

source: The CoEdge belongs to a degenerate Edge.
cs_cz: Společná hrana patří poškozené hraně.
es_es: La arista coincidente pertenece a una arista degenerada.
fr_fr: L'arête concourante appartient à une arête dégénérée.
it_it: Il CoEdge appartiene ad un bordo degenerato.
pl_pl: Krawędź wspólna należy do krawędzi zdegenerowanej.
pt_br: A coaresta pertence a uma aresta degenerada.
ru_ru: Смежное ребро принадлежит вырожденному ребру.

source: Error getting coedges of the edge!
cs_cz: Při načítání společných hran dané hrany došlo k chybě.
es_es: Error al obtener aristas coincidentes de la arista.
fr_fr: Erreur lors de l'obtention des arêtes concourantes de l'arête.
it_it: Errore durante il recupero di cospigoli del bordo.
pl_pl: Błąd podczas pobierania krawędzi wspólnych danej krawędzi!
pt_br: Erro ao obter as coarestas da aresta.
ru_ru: Ошибка при получении смежных ребер для ребра.

source: Error copying an edge!
cs_cz: Chyba při kopírování hrany!
es_es: Error al copiar una arista
fr_fr: Erreur de copie d'une arête.
it_it: Errore durante la copia di uno spigolo.
pl_pl: Błąd podczas kopiowania krawędzi!
pt_br: Erro ao copiar uma aresta!
ru_ru: Ошибка при копировании ребра!

source: Unable to transform EDGE
cs_cz: Nelze transformovat položku EDGE
es_es: No se puede transformar EDGE.
fr_fr: Impossible de transformer ARÊTE
it_it: Impossibile trasformare lo SPIGOLO
pl_pl: Nie można przekształcić KRAWĘDZI
pt_br: Não é possível transformar a ARESTA
ru_ru: Не удалось преобразовать объект EDGE

source: Failed to convert Edge to Curve.
cs_cz: Nepodařilo se převést hranu na křivku.
es_es: No se ha podido convertir la arista en una curva.
fr_fr: Échec de la conversion de l'arête en courbe.
it_it: Impossibile convertire un bordo in una curva.
pl_pl: Nie można przekształcić krawędzi w krzywą.
pt_br: Falha durante a conversão de aresta em curva.
ru_ru: Не удалось преобразовать объект Edge в объект Curve.

source: Curve geometry is degenerate or invalid.
cs_cz: Geometrie křivky je degenerovaná nebo nepodporovaná.
es_es: La geometría de la curva no se ha generado correctamente o no es válida.
fr_fr: La géométrie de courbe est dégénérée ou incorrecte.
it_it: La geometria della curva è degenerata o non valida.
pl_pl: Geometria krzywej jest zdegenerowana lub niepoprawna.
pt_br: A geometria da curva está degenerada ou é inválida.
ru_ru: Геометрия кривой является вырожденной или недопустимой.

source: doesn't support curve geometry query operation on its Edge!
cs_cz: nepodporuje operaci dotazu na geometrii křivky u hrany.
es_es: no admite la operación de consulta de geometría de curva en su Edge.
fr_fr: ne prend pas en charge l'opération de requête de géométrie de courbe sur son arête.
it_it: non supporta l'operazione di query della geometria della curva sul relativo bordo.
pl_pl: nie obsługuje zapytania o geometrię krzywej na krawędzi!
pt_br: não suporta a operação de consulta da geometria da curva em sua aresta.
ru_ru: не поддерживает операцию запроса геометрии кривой для объекта Edge.

source: Error getting face vertices!
cs_cz: Při načítání vrcholů plochy došlo k chybě.
es_es: Error al obtener vértices de cara.
fr_fr: Erreur lors de l'obtention des sommets de la face.
it_it: Errore di restituzione dei vertici della faccia.
pl_pl: Błąd podczas pobierania wierzchołków powierzchni!
pt_br: Erro ao obter os vértices da face.
ru_ru: Ошибка при получении вершин граней.

source: Error getting face edges!
cs_cz: Při načítání hran plochy došlo k chybě.
es_es: Error al obtener aristas de cara.
fr_fr: Erreur lors de l'obtention des arêtes de la face.
it_it: Errore durante il recupero dei bordi della faccia.
pl_pl: Błąd pobierania krawędzi powierzchni!
pt_br: Erro ao obter as arestas da face!
ru_ru: Ошибка при получении ребер грани!

source: Error getting face loops!
cs_cz: Při načítání smyček plochy došlo k chybě.
es_es: Error al obtener bucles de cara.
fr_fr: Erreur lors de l'obtention des boucles de la face.
it_it: Errore di restituzione di perimetri delle facce.
pl_pl: Błąd pobierania pętli powierzchni!
pt_br: Erro ao obter os contornos da face.
ru_ru: Ошибка при извлечении контуров граней.

source: Error getting loop coedges!
cs_cz: Při načítání hran v jedné přímce smyčky došlo k chybě.
es_es: Error al obtener aristas coincidentes del bucle.
fr_fr: Erreur lors de l'obtention des arêtes concourantes de la boucle.
it_it: Errore durante il recupero di cospigoli del perimetro.
pl_pl: Błąd podczas pobierania krawędzi wspólnych pętli!
pt_br: Erro ao obter as coarestas do contorno.
ru_ru: Ошибка при получении смежных ребер контура.

source: Failed to define loop direction
cs_cz: Nepodařilo se definovat směr smyčky
es_es: No se ha podido definir la dirección del bucle.
fr_fr: Impossible de définir la direction de la boucle
it_it: Definizione della direzione del perimetro non riuscita
pl_pl: Nie można zdefiniować kierunku pętli
pt_br: Falha ao definir a direção do contorno
ru_ru: Не удалось определить направление контура

source: doesn't support Vertex query operation!
cs_cz: operace dotazu na vrchol není podporována.
es_es: no admite la operación de consulta de Vertex.
fr_fr: ne prend pas en charge l'opération de requête de sommet.
it_it: non supporta l'operazione di query del vertice.
pl_pl: nie obsługuje zapytania o wierzchołek!
pt_br: não suporta a operação de consulta do vértice.
ru_ru: не поддерживает операцию запроса объекта Vertex.

source: doesn't support Edge query operation!
cs_cz: operace dotazu na hranu není podporována.
es_es: no admite la operación de consulta de Edge.
fr_fr: ne prend pas en charge l'opération de requête d'arête.
it_it: non supporta l'operazione di query del bordo.
pl_pl: nie obsługuje zapytania o krawędź!
pt_br: não suporta a operação de consulta da aresta.
ru_ru: не поддерживает операцию запроса объекта Edge.

source: doesn't support Face query operation!
cs_cz: operace dotazu na plochu není podporována.
es_es: no admite la operación de consulta de Face.
fr_fr: ne prend pas en charge l'opération de requête de face.
it_it: non supporta l'operazione di query della faccia.
pl_pl: nie obsługuje zapytania o powierzchnię!
pt_br: não suporta a operação de consulta da face.
ru_ru: не поддерживает операцию запроса объекта Face.

source: could not repair geometry
cs_cz: nebylo možné opravit geometrii
es_es: No se ha podido reparar la geometría.
fr_fr: impossible de réparer la géométrie
it_it: Impossibile riparare la geometria
pl_pl: nie można naprawić geometrii
pt_br: não foi possível reparar a geometria
ru_ru: Не удалось восстановить геометрию

source: unexpected result, please report to dynamo team:
cs_cz: neočekávaný výsledek, nahlaste to týmu aplikace dynamo:
es_es: Resultado inesperado; informe al equipo de Dynamo:
fr_fr: résultat inattendu, veuillez le signaler à l'équipe dynamo :
it_it: Risultato imprevisto; segnalare al team di Dynamo:
pl_pl: nieoczekiwany wynik, zgłoś go zespołowi dodatku Dynamo:
pt_br: resultado inesperado, reporte à equipe do dynamo:
ru_ru: Непредвиденный результат, сообщите команде разработчиков Dynamo:

source: Error getting adjacent edges of a vertex!
cs_cz: Při načítání přilehlých hran vrcholu došlo k chybě.
es_es: Error al obtener aristas adyacentes de un vértice.
fr_fr: Erreur lors de l'obtention des arêtes adjacentes d'un sommet.
it_it: Errore durante il recupero di bordi adiacenti di un vertice.
pl_pl: Błąd pobierania przylegających krawędzie wierzchołka!
pt_br: Erro ao obter as arestas adjacentes de um vértice.
ru_ru: Ошибка при получении смежных ребер вершины.
