Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Cannot simplify a curve below 1.0e-9 tolerance
cs_cz: Nelze zjednodušit křivku pod toleranci 1,0e-9.
es_es: No se puede simplificar una curva por debajo de la tolerancia 1.0e-9.
fr_fr: Impossible de simplifier la courbe au-dessous de la tolérance 1.0e-9
it_it: Impossibile semplificare una curva con una tolleranza inferiore a 1.0e-9
pl_pl: Nie można uprościć krzywej poniżej tolerancji 1,0e-9
pt_br: Não é possível simplificar uma curva abaixo da tolerância 1.0e-9
ru_ru: Невозможно упростить кривую с допуском ниже 1,0e – 9

source: Unable to approximate simplified spline
cs_cz: Nelze aproximovat zjednodušenou křivku spline.
es_es: No se puede aproximar spline simplificada
fr_fr: Impossible de créer une spline simplifiée approximative
it_it: Impossibile approssimare la spline semplificata
pl_pl: Nie można przybliżyć uproszczonego splajnu
pt_br: Não é possível estimar a spline simplificada
ru_ru: Не удалось аппроксимировать упрощенный сплайн

source: Unable to simplify spline
cs_cz: Nelze zjednodušit křivku spline.
es_es: No se puede simplificar spline
fr_fr: Impossible de simplifier la spline
it_it: Impossibile semplificare la Spline
pl_pl: Nie można uprościć splajnu
pt_br: Não é possível simplificar a spline
ru_ru: Не удалось упростить сплайн

source: Casted object is not a Cylinder
cs_cz: Vrhaný objekt není položka Cylinder.
es_es: El objeto proyectado no es un Cylinder
fr_fr: L'objet projeté n'est pas un Cylinder
it_it: L'oggetto proiettato non è Cylinder
pl_pl: Rzutowany obiekt nie jest Cylinder
pt_br: O objeto projetado não é um Cylinder
ru_ru: Приведенный объект не является объектом Cylinder

source: Cast object is not a Ellipse
cs_cz: Vrhaný objekt není položka Ellipse.
es_es: El objeto proyectado no es una Ellipse
fr_fr: L'objet projeté n'est pas une Ellipse
it_it: L'oggetto proiettato non è Ellipse
pl_pl: Rzutowany obiekt nie jest Ellipse
pt_br: O objeto projetado não é uma Ellipse
ru_ru: Приведенный объект не является объектом Ellipse

source: Error creating an ellipse! Ellipse radius must be non-zero
cs_cz: Chyba při vytváření elipsy. Poloměr elipsy musí být nenulový.
es_es: Error al crear una elipse. El radio de la elipse no puede ser distinto de cero
fr_fr: Erreur lors de la création d'une ellipse. Le rayon d'ellipse doit être différent de zéro.
it_it: Errore durante la creazione di un'ellisse. Il raggio dell'ellisse deve essere diverso da zero
pl_pl: Błąd podczas tworzenia ellipsy! Promień elipsy musi być różny od zera
pt_br: Erro ao criar uma elipse! O raio da elipse deve ser diferente de zero
ru_ru: Ошибка при создании эллипса! Радиус эллипса должен быть ненулевым

source: Error creating an ellipse!
cs_cz: Chyba při vytváření elipsy.
es_es: Error al crear una elipse.
fr_fr: Erreur de création d'une ellipse.
it_it: Errore durante la creazione di un'ellipse.
pl_pl: Błąd podczas tworzenia elipsy!
pt_br: Erro ao criar uma elipse.
ru_ru: Ошибка при создании эллипса.

source: Casted object is not an EllipseArc
cs_cz: Vrhaný objekt není objekt EllipseArc.
es_es: El objeto proyectado no es un EllipseArc
fr_fr: L'objet projeté n'est pas un EllipseArc
it_it: L'oggetto proiettato non è EllipseArc
pl_pl: Rzutowany obiekt nie jest EllipseArc
pt_br: O objeto projetado não é um EllipseArc
ru_ru: Приведенный объект не является объектом EllipseArc

source: EllipseArc radius must be non-zero
cs_cz: Poloměr objektu EllipseArc musí být nenulový.
es_es: El radio de EllipseArc debe ser distinto de cero
fr_fr: Le rayon EllipseArc doit être différent de zéro
it_it: Il raggio di EllipseArc deve essere diverso da zero
pl_pl: Promień łuku eliptycznego musi być różny od zera
pt_br: O raio de EllipseArc deve ser diferente de zero
ru_ru: Радиус объекта EllipseArc должен быть ненулевым

source: EllipseArc sweep angle must be non-zero
cs_cz: Úhel tažení objektu EllipseArc musí být nenulový
es_es: El ángulo de barrido de EllipseArc debe ser distinto a cero.
fr_fr: L'angle de balayage de l'EllipseArc doit être différent de zéro
it_it: L'angolo di sweep di EllipseArc deve essere diverso da zero
pl_pl: Kąt przeciągnięcia łuku eliptycznego musi być różny od zera
pt_br: O ângulo de varredura do EllipseArc deve ser diferente de zero
ru_ru: Угол сдвига для объекта EllipseArc должен быть ненулевым

source: Unexpected error creating the EllipseArc!
cs_cz: Neočekávaná chyba při vytváření objektu EllipseArc.
es_es: Error inesperado al crear EllipseArc.
fr_fr: Une erreur inattendue s'est produite lors de la création de EllipseArc.
it_it: Errore imprevisto durante la creazione di EllipseArc.
pl_pl: Nieoczekiwany błąd podczas tworzenia EllipseArc!
pt_br: Erro inesperado ao criar o EllipseArc.
ru_ru: Непредвиденная ошибка при создании объекта EllipseArc.

source: Cast object is not Geometry
cs_cz: Vrhaný objekt není položka Geometry.
es_es: El objeto proyectado no es Geometry
fr_fr: L'objet projeté n'est pas une Geometry
it_it: L'oggetto proiettato non è Geometry
pl_pl: Rzutowany obiekt nie jest Geometry
pt_br: O objeto projetado não é uma geometria
ru_ru: Приведенный объект не является объектом Geometry

source: Could not find distance.
cs_cz: Nelze najít vzdálenost.
es_es: No se ha podido encontrar la distancia
fr_fr: Impossible de trouver la distance.
it_it: Distanza non trovata.
pl_pl: Nie można znaleźć odległości.
pt_br: Não foi possível localizar a distância.
ru_ru: Не удалось найти расстояние.

source: Unable to get extremum point
cs_cz: Nelze načíst bod extrému.
es_es: No se puede obtener punto extremo
fr_fr: Impossible d'obtenir le point d'extremum
it_it: Impossibile ottenere punto estremo
pl_pl: Nie można pobrać punktu ekstremum
pt_br: Não é possível obter o ponto extremo
ru_ru: Не удалось получить точку экстремума

source: Unable to create intersection boolean
cs_cz: Nelze vytvořit průsečík Boolean.
es_es: No se puede crear boolean de intersección
fr_fr: Impossible de créer une intersection boolean
it_it: Impossibile creare Boolean di intersezione
pl_pl: Nie można utworzyć boolean przecięcia
pt_br: Não é possível criar a intersecção booleana
ru_ru: Не удалось создать операцию пересечения boolean

source: Unable to slice bodies
cs_cz: Nelze odříznout tělesa.
es_es: No se puede seccionar cuerpos
fr_fr: Impossible de couper les corps
it_it: Impossibile tagliare i corpi
pl_pl: Nie można utworzyć płatów bryły
pt_br: Não é possível fatiar corpos
ru_ru: Не удалось разрезать тела

source: Unable to transform the entity!
cs_cz: Nelze transformovat entitu.
es_es: No se puede transformar la entidad.
fr_fr: Impossible de transformer l'entité.
it_it: Impossibile trasformare l'entità.
pl_pl: Nie można przekształcić jednostki!
pt_br: Não é possível transformar a entidade.
ru_ru: Невозможно преобразовать объект.

source: Unable to get EDGEs while decomposing BODY
cs_cz: Nelze získat položky EDGE při rozkládání položky BODY.
es_es: No se puede obtener EDGEs al descomponer BODY
fr_fr: Impossible d'obtenir les EDGEs lors de la décomposition du BODY
it_it: Impossibile ottenere gli spigoli dalla scomposizione del corpo
pl_pl: Nie można pobrać EDGEs podczas rozkładu BODY
pt_br: Não é possível obter as arestas ao decompor o corpo
ru_ru: Не удалось получить ребра при разложении тела

source: Unable to get WIREs while decomposing BODY
cs_cz: Nelze získat položky WIRE při rozkládání položky BODY.
es_es: No se puede obtener WIRE al descomponer BODY
fr_fr: Impossible d'obtenir les fils lors de la décomposition du BODY
it_it: Impossibile ottenere wire dalla scomposizione del corpo
pl_pl: Nie można pobrać WIREs podczas rozkładu BODY
pt_br: Não é possível obter as fiações ao decompor o corpo
ru_ru: Не удалось получить провода при разложении тела

source: Error getting coedges
cs_cz: Při získávání hran v jedné přímce došlo k chybě
es_es: Error al obtener aristas coincidentes.
fr_fr: Erreur lors de l'obtention des arêtes concourantes
it_it: Errore durante il recupero di cospigoli
pl_pl: Błąd podczas pobierania krawędzi wspólnych
pt_br: Erro ao obter as coarestas
ru_ru: Ошибка при получении смежных ребер

source: Could not separate BODYs before decomposition
cs_cz: Nepodařilo se rozdělit TĚLESA před rozložením
es_es: No se han podido separar elementos BODY antes de la descomposición.
fr_fr: Impossible de séparer les BODYs avant la décomposition
it_it: Impossibile separare CORPI prima della scomposizione
pl_pl: Nie można rozdzielić elementów BRYŁ przed rozkładem
pt_br: Não foi possível separar os CORPOS antes da decomposição
ru_ru: Не удалось разделить элементы BODY перед разложением

source: Could not get EDGEs from BODY when extracting Curves
cs_cz: Nelze získat HRANY z TĚLESA při extrahování položek křivek.
es_es: No se puede obtener EDGEs de BODY al extraer Curves
fr_fr: Impossible d'obtenir les EDGE du BODY lors de l'extraction des Curves
it_it: Impossibile ottenere i bordi dal corpo durante l'estrazione di curve
pl_pl: Nie można pobrać krawędzi z bryły podczas wyodrębniania krzywych
pt_br: Não foi possível obter EDGES a partir de BODY ao extrair curvas
ru_ru: Не удалось получить ребра на основе тела при извлечении кривых

source: Could not get COEDGEs from BODY when extracting Curves
cs_cz: Nelze získat SPOLEČNÉ HRANY z TĚLESA při extrahování křivek.
es_es: No se ha podido obtener COEDGEs de BODY al extraer Curves
fr_fr: Impossible d'obtenir les COEDGE du BODY lors de l'extraction des Curves
it_it: Impossibile ottenere i cospigoli dal corpo durante l'estrazione di curve
pl_pl: Nie można pobrać wspólnych krawędzi z bryły podczas wyodrębniania krzywych
pt_br: Não foi possível obter COEDGEs a partir de BODY ao extrair curvas
ru_ru: Не удалось получить смежные ребра на основе тела при извлечении кривых

source: Could not get EDGEs from FACE when extracting Curves
cs_cz: Nelze získat HRANY z PLOCHY při extrahování křivek.
es_es: No se ha podido obtener EDGEs de FACE al extraer Curves
fr_fr: Impossible d'obtenir les EDGE de la FACE lors de l'extraction des Curves
it_it: Impossibile ottenere i bordi dalla faccia durante l'estrazione di curve
pl_pl: Nie można pobrać krawędzi z powierzchni podczas wyodrębniania krzywych
pt_br: Não foi possível obter EDGEs a partir de FACE ao extrair curvas
ru_ru: Не удалось получить ребра на основе грани при извлечении кривых

source: Unable to create Curve from COEDGE when extracting Curves
cs_cz: Nelze vytvořit křivku ze SPOLEČNÉ HRANY při extrahování křivek.
es_es: No se puede crear Curve a partir de COEDGE al extraer Curves
fr_fr: Impossible de créer une Curve à partir de la COEDGE concourante lors de l'extraction des Curves
it_it: Impossibile creare la Curva da un cospigolo durante l'estrazione di Curve
pl_pl: Nie można utworzyć krzywej ze wspólnej krawędzi podczas wyodrębniania krzywych
pt_br: Não é possível criar a curva a partir de COEDGE ao extrair curvas
ru_ru: Не удалось создать кривую от смежной грани при извлечении кривых

source: Error getting length of the edge
cs_cz: Chyba při získávání délky hrany
es_es: Error al obtener longitud de la arista
fr_fr: Erreur d'obtention de la longueur de l'arête
it_it: Errore di restituzione della lunghezza dello spigolo
pl_pl: Błąd podczas pobierania długości krawędzi
pt_br: Erro ao obter o comprimento da aresta
ru_ru: Ошибка при получении длины ребра

source: Unable to get start Point of zero length EDGE
cs_cz: Nelze získat počáteční položku POINT položky EDGE s nulovou délkou.
es_es: No se puede obtener Point inicial de EDGE de longitud cero
fr_fr: Impossible d'obtenir le Point de début d'une EDGE de longueur nulle
it_it: Impossibile ottenere il punto di inizio dello spigolo con lunghezza zero
pl_pl: Nie można uzyskać Point początkowego o EDGE mającej zerową długość
pt_br: Não é possível obter o ponto inicial da EDGE com comprimento zero
ru_ru: Не удается получить начальную точку ребра нулевой длины

source: Unable to get area
cs_cz: Nelze získat oblast.
es_es: No se puede obtener área
fr_fr: Impossible d'obtenir la surface
it_it: Impossibile ottenere l'area
pl_pl: Nie można uzyskać powierzchni
pt_br: Não é possível obter a área
ru_ru: Не удалось получить площадь

source: Could not compare Geometry
cs_cz: Nelze porovnat položku Geometry.
es_es: No se puede comparar Geometry
fr_fr: Impossible de comparer la Geometry
it_it: Impossibile confrontare Geometry
pl_pl: Nie można porównać Geometry
pt_br: Não foi possível comparar a geometria
ru_ru: Не удалось сравнить геометрию

source: Unable to get FACE from BODY: no faces in BODY
cs_cz: Nelze získat položku FACE z položky BODY: žádné plochy v položce BODY.
es_es: No se puede obtener FACE de BODY: en BODY no hay caras
fr_fr: Impossible d'obtenir la FACE du BODY: aucune face dans le BODY
it_it: Impossibile ottenere una faccia dal corpo: il corpo non ha nessuna faccia
pl_pl: Nie można uzyskać FACE z BODY: brak powierzchni w BODY
pt_br: Não é possível obter a FACE do BODY: não há faces no BODY
ru_ru: Не удалось получить грань тела: тело не имеет граней

source: Unable to make sheet double sided
cs_cz: Nelze učinit list oboustranným.
es_es: No se puede crear plano de dos lados
fr_fr: Impossible de créer une feuille à deux côtés
it_it: Impossibile definire il foglio come bilaterale
pl_pl: Nie można utworzyć arkusza dwustronnie
pt_br: Não é possível criar a folha de dupla face
ru_ru: Не удалось сделать лист двусторонним

source: Unable to create brep around face
cs_cz: Nelze vytvořit brep kolem plochy.
es_es: No se puede crear BREP en torno a cara
fr_fr: Impossible de créer une brep autour de la face
it_it: Impossibile creare la rappresentazione contorno intorno alla faccia
pl_pl: Nie można utworzyć reprezentacji bryłowej wokół powierzchni
pt_br: Não foi possível criar REPRLIMITE em torno da face
ru_ru: Не удалось создать контурное представление вокруг грани

source: Unable to create BRep BODY from FACEs
cs_cz: Nelze vytvořit TĚLESO BRep z PLOCH
es_es: No se puede crear BODY de BREP a partir de elementos FACE.
fr_fr: Impossible de créer le BODY BRep à partir des FACEs
it_it: Impossibile creare il CORPO di BRep dalle FACCE
pl_pl: Nie można utworzyć BRYŁY BRep z POWIERZCHNI
pt_br: Não foi possível criar um CORPO BRep com base nas FACES
ru_ru: Невозможно создать элемент BODY контурного представления из элементов FACE

source: Unable make FACEs BODY double sided.
cs_cz: Nelze učinit položku BODY u položek FACE oboustrannou.
es_es: No se puede crear BODY de FACE de dos lados
fr_fr: Impossible de convertir le BODY des FACE en corps à deux côtés.
it_it: Impossibile impostare il corpo delle facce come bilaterale.
pl_pl: Nie można utworzyć FACEs BODY dwustronnie.
pt_br: Não é possível criar o BODY das FACEs com dupla face.
ru_ru: Не удалось сделать грани тела двусторонними.

source: Failed to query edges from body!
cs_cz: Nepodařilo se dotazovat hrany z tělesa
es_es: No se han podido consultar las aristas del cuerpo.
fr_fr: Échec de l'obtention des arêtes à partir du corps.
it_it: Impossibile eseguire query sui bordi del corpo.
pl_pl: Nie można sprawdzić krawędzi bryły.
pt_br: Falha durante a consulta das arestas do corpo.
ru_ru: Не удалось запросить ребра из тела.

source: Unable to create non regular subtraction boolean
cs_cz: Nelze vytvořit jiné než standardní logické operace odečítání.
es_es: No se puede crear sustracción booleana no regular
fr_fr: Impossible de créer la soustraction booléenne non standard
it_it: Impossibile creare il valore booleano per la sottrazione non regolare
pl_pl: Nie można utworzyć nietypowej operacji logicznej odejmowania
pt_br: Não é possível criar a subtração booleana não regular
ru_ru: Не удалось создать нестандартную логическую операцию вычитания

source: Unable to approximate body
cs_cz: Nelze aproximovat těleso.
es_es: No se puede aproximar cuerpo
fr_fr: Impossible de créer un corps approximatif
it_it: Impossibile definire un'approssimazione del corpo
pl_pl: Nie można przybliżyć bryły
pt_br: Não é possível aproximar o corpo
ru_ru: Не удалось аппроксимировать тело

source: Unable to compute equality between bodies
cs_cz: Nelze vypočítat rovnost mezi tělesy.
es_es: No se puede calcular igualdad entre cuerpos
fr_fr: Impossible de calculer l'égalité entre les corps
it_it: Impossibile calcolare l'uguaglianza tra corpi
pl_pl: Nie można obliczyć równości między bryłami
pt_br: Não é possível calcular a igualdade entre os corpos
ru_ru: Не удалось рассчитать равенство между телами

source: Unable to extract a bounding box from ASM ENTITY
cs_cz: Nelze extrahovat ohraničující rámeček z položky ASM ENTITY.
es_es: No se puede extraer un cuadro delimitador de ASM ENTITY
fr_fr: Impossible d'extraire une zone de délimitation à partir de l'ENTITY ASM
it_it: Impossibile estrarre un riquadro di delimitazione dall'entità ASM
pl_pl: Nie można wyodrębnić ramki ograniczającej z ASM ENTITY
pt_br: Não é possível extrair uma caixa delimitadora a partir da ASM ENTITY
ru_ru: Не удалось извлечь ограничивающую рамку из ASM ENTITY

source: Unable to create planar face of BoundingBox
cs_cz: Nelze vytvořit rovinnou plochu objektu BoundingBox.
es_es: No se puede crear cara plana a partir de BoundingBox
fr_fr: Impossible de créer la face plane de BoundingBox
it_it: Impossibile creare faccia piana di BoundingBox
pl_pl: Nie można utworzyć płaskiej powierzchni BoundingBox
pt_br: Não é possível criar a face plana da BoundingBox
ru_ru: Не удалось создать плоскую грань объекта BoundingBox

source: Unable to compute closest approach on BoundingBox face
cs_cz: Nelze vypočítat nejbližší přístup na ploše BoundingBox.
es_es: No se puede calcular aproximación más cercana en cara de BoundingBox
fr_fr: Impossible de calculer la méthode la plus proche sur la face BoundingBox
it_it: Impossibile calcolare l'approccio più prossimo sulla faccia di BoundingBox
pl_pl: Nie można obliczyć najbliższego podejścia na powierzchni BoundingBox
pt_br: Não é possível calcular a aproximação mais próxima da face da BoundingBox.
ru_ru: Не удалось рассчитать ближайшую грань BoundingBox

source: Cast object is not a helix
cs_cz: Vrhaný objekt není položka Helix.
es_es: El objeto proyectado no es una Helix
fr_fr: L'objet projeté n'est pas une hélice
it_it: L'oggetto proiettato non è un'elica
pl_pl: Rzutowany obiekt nie jest spiralą
pt_br: O objeto projetado não é uma hélice
ru_ru: Приведенный объект не является спиралью

source: Cannot make helix
cs_cz: Nelze vytvořit šroubovici.
es_es: No se puede crear hélice
fr_fr: Impossible de créer l'hélice
it_it: Impossibile creare un'elica
pl_pl: Nie można utworzyć spirali
pt_br: Não é possível criar uma hélice
ru_ru: Не удалось создать спираль

source: Cast object is not a Line
cs_cz: Vrhaný objekt není položka Line.
es_es: El objeto proyectado no es una Line
fr_fr: L'objet projeté n'est pas une Line
it_it: L'oggetto proiettato non è Line
pl_pl: Rzutowany obiekt nie jest Line
pt_br: O objeto projetado não é uma linha
ru_ru: Приведенный объект не является объектом Line

source: Unable to create Line. Points are likely coincident
cs_cz: Nelze vytvořit položku Line. Položky Point jsou pravděpodobně totožné.
es_es: No se puede crear Line. Probablemente los Points son coincidentes
fr_fr: Impossible de créer une Line. Les Points sont probablement coïncidents
it_it: Impossibile creare Line. È possibile che i Point siano coincidenti
pl_pl: Nie można utworzyć Line. Points mogą się pokrywać
pt_br: Não é possível criar a linha. Os pontos são provavelmente coincidentes
ru_ru: Не удалось создать линию Line. Возможно, точки Points совпадают

source: Best fit line needs 2 points or more!
cs_cz: Optimálně umístěná přímka vyžaduje dva body nebo více!
es_es: Línea de ajuste óptimo requiere dos puntos o más
fr_fr: La ligne d'ajustement optimal requiert deux points ou plus.
it_it: La linea di adattamento richiede due o più punti.
pl_pl: Najlepiej dopasowana linia wymaga co najmniej 2 punktów!
pt_br: A linha com melhor ajuste precisa de 2 pontos ou mais!
ru_ru: Для линии наилучшего вписывания требуется 2 или более точек!

source: Cast object is not a Plane
cs_cz: Vrhaný objekt není položka Plane.
es_es: El objeto proyectado no es un Plane
fr_fr: L'objet projeté n'est pas un Plane
it_it: L'oggetto proiettato non è Plane
pl_pl: Rzutowany obiekt nie jest Plane
pt_br: O objeto projetado não é um Plane
ru_ru: Приведенный объект не является объектом Plane

source: Could not create Plane! one or more of the desired axes of this plane have zero length!
cs_cz: Rovinu nebylo možné vytvořit. Nejméně jedna z požadovaných os této roviny má nulovou délku.
es_es: No se ha podido crear Plane. Uno o más vértices seleccionados de este plano tienen longitud cero.
fr_fr: Impossible de créer le plan. La longueur d'un ou de plusieurs axes souhaités pour ce plan est nulle.
it_it: Impossibile creare il piano. Uno o più degli assi desiderati di questo piano hanno lunghezza pari a zero.
pl_pl: Nie można utworzyć płaszczyzny! Długość co najmniej jednej z osi na płaszczyźnie jest zerowa!
pt_br: Não foi possível criar o plano. Um ou mais dos eixos desejados desse plano têm comprimento igual zero.
ru_ru: Не удалось создать плоскость. Одна или несколько требуемых осей этой плоскости имеют нулевую длину.

source: Could not create Plane! The desired axes of this plane are parallel!
cs_cz: Rovinu nebylo možné vytvořit. Požadované osy této roviny jsou rovnoběžné.
es_es: No se ha podido crear Plane. Los ejes seleccionados de este plano son paralelos.
fr_fr: Impossible de créer le plan. Les axes souhaités pour ce plan sont parallèles.
it_it: Impossibile creare il piano. Gli assi desiderati di questo piano sono paralleli.
pl_pl: Nie można utworzyć płaszczyzny! Żądane osie płaszczyzny są równoległe!
pt_br: Não foi possível criar o plano. Os eixos desejados desse plano são paralelos.
ru_ru: Не удалось создать плоскость. Требуемые оси этой плоскости параллельны.

source: Intersecting two infinite geometries such as Planes is an invalid operation!
cs_cz: Protnutí dvou nekonečných geometrií, jako jsou například roviny, je neplatná operace.
es_es: La intersección de dos geometrías infinitas, como los planos, es una operación no válida.
fr_fr: Impossible d'entrecouper deux géométries infinies (par exemple des plans).
it_it: L'intersezione di due geometrie infinite come i piani è un'operazione non valida.
pl_pl: Nie można utworzyć części wspólnej dwóch geometrii nieskończonych, takich jak płaszczyzny!
pt_br: Efetuar a interseção de duas geometrias infinitas, como planos, é uma operação inválida.
ru_ru: Пересечение двух бесконечных геометрий, например плоскостей, недопустимо.

source: Unable to split Plane
cs_cz: Nelze rozdělit položku Plane.
es_es: No se puede dividir Plane
fr_fr: Impossible de scinder le Plane
it_it: Impossibile dividere Plane
pl_pl: Nie można podzielić Plane
pt_br: Não é possível dividir o plano
ru_ru: Не удалось разделить плоскость

source: SetAttributes not implemented for Plane.
cs_cz: Hodnoty SetAttributes nejsou pro rovinu implementovány.
es_es: SetAttributes no implementado para Plane.
fr_fr: SetAttributes non mis en oeuvre pour le Plane.
it_it: SetAttributes non implementato per il piano.
pl_pl: Nie zaimplementowano metody SetAttributes dla powierzchni.
pt_br: SetAttributes não foi implementado para o plano.
ru_ru: SetAttributes: не реализовано для плоскости.

source: Unable to trim Plane
cs_cz: Nelze oříznout položku Plane.
es_es: No se puede recortar Plane
fr_fr: Impossible de couper le Plane
it_it: Impossibile ritagliare Plane
pl_pl: Nie można przyciąć Plane
pt_br: Não é possível aparar o plano
ru_ru: Не удалось подрезать плоскость
