Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Error getting adjacent faces of a vertex!
cs_cz: Při načítání přilehlých ploch vrcholu došlo k chybě.
es_es: Error al obtener caras adyacentes de un vértice.
fr_fr: Erreur lors de l'obtention des faces adjacentes d'un sommet.
it_it: Errore durante il recupero delle facce adiacenti di un vertice.
pl_pl: Błąd pobierania sąsiednich powierzchni wierzchołka!
pt_br: Erro ao obter as faces adjacentes de um vértice.
ru_ru: Ошибка при получении смежных граней вершины.

source: doesn't support point geometry query operation on its Vertex!
cs_cz: nepodporuje operaci dotazu na geometrii bodu u hrany.
es_es: no admite la operación de consulta de geometría de punto en su Vertex.
fr_fr: ne prend pas en charge l'opération de requête de géométrie de point sur son sommet.
it_it: non supporta l'operazione di query della geometria del punto sul relativo vertice.
pl_pl: nie obsługuje zapytania o geometrię punktu na wierzchołku!
pt_br: não suporta a operação de consulta da geometria do ponto em seu vértice.
ru_ru: не поддерживает операцию запроса геометрии точки для объекта Vertex.

source: Could not get vertex point
cs_cz: Bod vrcholu nebylo možné načíst.
es_es: No se ha podido obtener punto de vértice
fr_fr: Impossible d'obtenir le point de sommet
it_it: Impossibile ottenere il punto del vertice
pl_pl: Nie można pobrać punktu wierzchołka
pt_br: Não foi possível obter o ponto do vértice
ru_ru: Не удалось получить точку вершины

source: Num symmetric faces must be greater than zero.
cs_cz: Počet symetrických ploch musí být větší než nula.
es_es: El número de caras simétricas debe ser mayor que cero.
fr_fr: Le nombre de faces symétriques doit être supérieur à zéro.
it_it: Il numero di facce simmetriche deve essere superiore a zero.
pl_pl: Liczba symetrycznych powierzchni musi być większa niż zero.
pt_br: O número de faces simétricas deve ser maior do que zero.
ru_ru: Количество симметричных граней должно быть больше нуля.

source: Number of symmetric segments must be greater than or equal to 2
cs_cz: Počet symetrických segmentů musí být větší nebo roven 2
es_es: La cantidad de segmentos simétricos debe ser mayor o igual que 2.
fr_fr: Le nombre de segments symétriques doit être supérieur ou égal à 2
it_it: Il numero di segmenti simmetrici deve essere superiore o pari a 2
pl_pl: Liczba symetrycznych segmentów musi być większa lub równa 2
pt_br: O número de segmentos simétricos deve ser maior ou igual a 2
ru_ru: Количество симметричных сегментов должно быть больше или равно 2

source: Reflection has null parent
cs_cz: Odraz má nadřazený prvek s hodnotou null
es_es: La reflexión tiene un elemento superior nulo.
fr_fr: Le parent de la réflexion est défini sur NULL
it_it: Il riflesso ha un elemento principale nullo
pl_pl: Odbicie ma obiekt nadrzędny null
pt_br: A reflexão tem principal nulo
ru_ru: Для отражения задан нулевой родительский элемент

source: Reflection has invalid index
cs_cz: Odraz má neplatný index
es_es: La reflexión tiene un índice no válido.
fr_fr: L'index de la réflexion est incorrect
it_it: L'indice del riflesso non è valido
pl_pl: Odbicie ma nieprawidłowy indeks
pt_br: A reflexão tem índice inválido
ru_ru: Отражение имеет недопустимый индекс

source: Reflection has invalid plane
cs_cz: Odraz nemá platnou rovinu.
es_es: La reflexión tiene un plano no válido
fr_fr: Le plan de la réflexion est incorrect
it_it: Il piano del riflesso non è valido
pl_pl: Odbicie ma nieprawidłową płaszczyznę
pt_br: A reflexão tem um plano inválido
ru_ru: Недопустимая плоскость отражения

source: Reflection has unimplemented symmetry type
cs_cz: Odraz nemá implementovaný typ symetrie.
es_es: La reflexión tiene un tipo de simetría no implementado.
fr_fr: La réflexion présente un type de symétrie non mis en oeuvre
it_it: Il riflesso ha un tipo di simmetria non implementato
pl_pl: Odbicie ma niezaimplementowany typ symetrii
pt_br: A reflexão tem um tipo de simetria não implementado
ru_ru: Для отражения задан нереализованный тип симметрии

source: The provided topology inputs should create equal count of contiguous groups
cs_cz: Zadané vstupy topologie by měly vytvořit stejný počet souvislých skupin.
es_es: Las entradas de topología especificadas deben crear el mismo número de grupos contiguos.
fr_fr: Les entrées de topologie fournies doivent créer un nombre identique de groupes contigus
it_it: Gli input della topologia forniti devono creare un numero uguale di gruppi contigui
pl_pl: Podane dane wejściowe topologii powinny tworzyć równą liczbę grup ciągłych
pt_br: As entradas de topologia fornecidas devem criar um número igual de grupos contíguos
ru_ru: Предоставленными входными данными топологии предусмотрено создание равного количества смежных групп

source: Span counts list should have the same length as input contiguous group count, 1 for replication or be empty. Detected contiguous group count:
cs_cz: Seznam počtů rozpětí by měl mít stejnou délku jako počet vstupních souvislých skupin, 1 pro replikaci nebo by měl být prázdný. Detekovaný počet souvislých skupin:
es_es: La lista de recuentos de tramo debe tener la misma longitud que el recuento de grupos contiguos de entrada; 1 para la replicación o vacía. Recuento de grupos contiguos detectados:
fr_fr: La liste de nombres de travées doit être de la même longueur que le nombre de groupes contigus d'entrée, de 1 pour la réplication ou être vide. Nombre de groupes contigus détectés:
it_it: L'elenco dei numeri di campate deve avere la stessa lunghezza del numero di gruppi contigui di input, 1 per la replica o essere vuoto. Numero di gruppi contigui di input rilevato:
pl_pl: Lista liczb rozpiętości powinna mieć taką samą długość jak liczba wejściowych grup ciągłych, 1 dla replikacji lub być pusta. Wykryto liczbę grup ciągłych:
pt_br: A lista de contagens de vãos deve ter o mesmo comprimento da contagem de grupos contíguos de entrada, 1 para replicação ou estar vazia. Contagem de grupos contíguos detectados:
ru_ru: Список числа пролетов должен иметь длину, равную количеству входных смежных групп или единице для репликации, либо быть пустым. Обнаружено смежных групп:

source: Rotation counts list should have the same length as input contiguous group count, 1 for replication or be empty. Detected contiguous group count:
cs_cz: Seznam počtů otočení by měl mít stejnou délku jako počet vstupních souvislých skupin, 1 pro replikaci nebo by měl být prázdný. Detekovaný počet souvislých skupin:
es_es: La lista de recuentos de rotación debe tener la misma longitud que el recuento de grupos contiguos de entrada; 1 para la replicación o vacía. Recuento de grupos contiguos detectados:
fr_fr: La liste de nombres de rotations doit être de la même longueur que le nombre de groupes contigus d'entrée, de 1 pour la réplication ou être vide. Nombre de groupes contigus détectés:
it_it: L'elenco dei numeri di rotazioni deve avere la stessa lunghezza del numero di gruppi contigui di input, 1 per la replica o essere vuoto. Numero di gruppi contigui di input rilevato:
pl_pl: Lista liczb obrotów powinna mieć taką samą długość jak liczba wejściowych grup ciągłych, 1 dla replikacji lub być pusta. Wykryto liczbę grup ciągłych:
pt_br: A lista de contagens de rotações deve ter o mesmo comprimento da contagem de grupos contíguos de entrada, 1 para replicação ou estar vazia. Contagem de grupos contíguos detectados:
ru_ru: Список числа поворотов должен иметь длину, равную количеству входных смежных групп или единице для репликации, либо быть пустым. Обнаружено смежных групп:

source: Follow curves list should have the same length as inputcontiguous group count, 1 for replication or be empty. Detected contiguous group count:
cs_cz: Seznam řízení se křivkami by měl mít stejnou délku jako počet vstupních souvislých skupin, 1 pro replikaci nebo by měl být prázdný. Detekovaný počet souvislých skupin:
es_es: La lista de seguir las curvas debe tener la misma longitud que el recuento de grupos contiguos de entrada; 1 para la replicación o vacía. Recuento de grupos contiguos detectados:
fr_fr: La liste de courbes de suivi doit être de la même longueur que le nombre de groupes contigus d'entrée, de 1 pour la réplication ou être vide. Nombre de groupes contigus détectés:
it_it: L'elenco delle curve da seguire deve avere la stessa lunghezza del numero di gruppi contigui di input, 1 per la replica o essere vuoto. Numero di gruppi contigui di input rilevato:
pl_pl: Lista zgodności z krzywą powinna mieć taką samą długość jak liczba wejściowych grup ciągłych, 1 dla replikacji lub być pusta. Wykryto liczbę grup ciągłych:
pt_br: A lista de curvas de acompanhamento deve ter o mesmo comprimento da contagem de grupos contíguos de entrada, 1 para replicação ou estar vazia. Contagem de grupos contíguos detectados:
ru_ru: Список кривых для следования должен иметь длину, равную количеству входных смежных групп или единице для репликации, либо быть пустым. Обнаружено смежных групп:

source: Align vertices list should have the same length as input contiguous group count or be empty. Detected contiguous group count:
cs_cz: Seznam zarovnání vrcholů by měl mít stejnou délku jako počet vstupních souvislých skupin nebo by měl být prázdný. Detekovaný počet souvislých skupin:
es_es: La lista de alinear vértices debe tener la misma longitud que el recuento de grupos contiguos de entrada o estar vacía. Recuento de grupos contiguos detectados:
fr_fr: La liste de sommets d'alignement doit être de la même longueur que le nombre de groupes contigus d'entrée ou être vide. Nombre de groupes contigus détectés:
it_it: L'elenco di allineamento dei vertici deve avere la stessa lunghezza del numero di gruppi contigui di input o essere vuoto. Numero di gruppi contigui di input rilevato:
pl_pl: Lista dopasowania wierzchołków powinna mieć taką samą długość jak liczba wejściowych grup ciągłych lub być pusta. Wykryto liczbę grup ciągłych:
pt_br: A lista de vértices alinhados deve ter o mesmo comprimento da contagem de grupos contíguos de entrada ou estar vazia. Contagem de grupos contíguos detectados:
ru_ru: Список выровненных вершин должен иметь длину, равную количеству входных смежных групп, либо быть пустым. Обнаружено смежных групп:

source: Flip alignment flags list should have the same length as input contiguous group count, 1 for replication or be empty. Detected contiguous group count:
cs_cz: Seznam příznaků obrácení zarovnání by měl mít stejnou délku jako počet vstupních souvislých skupin, 1 pro replikaci nebo by měl být prázdný. Detekovaný počet souvislých skupin:
es_es: La lista de cambio de indicadores de alineación debe tener la misma longitud que el recuento de grupos contiguos de entrada; 1 para la replicación o vacía. Recuento de grupos contiguos detectados:
fr_fr: La liste d'indicateurs d'inversion d'axe doit être de la même longueur que le nombre de groupes contigus d'entrée, de 1 pour la réplication ou être vide. Nombre de groupes contigus détectés:
it_it: L'elenco dei flag di inversione dell'allineamento deve avere la stessa lunghezza del numero di gruppi contigui di input, 1 per la replica o essere vuoto. Numero di gruppi contigui di input rilevato:
pl_pl: Lista znaczników obrócenia wyrównania powinna mieć taką samą długość jak liczba wejściowych grup ciągłych, 1 dla replikacji lub być pusta. Wykryto liczbę grup ciągłych:
pt_br: A lista de sinalizadores de alinhamento de inversão deve ter o mesmo comprimento da contagem de grupos contíguos de entrada, 1 para replicação ou estar vazia. Contagem de grupos contíguos detectados:
ru_ru: Список флагов для перевернутых трасс должен иметь длину, равную количеству входных смежных групп или единице для репликации, либо быть пустым. Обнаружено смежных групп:

source: Failed to combine two T-Spline surfaces during bridge operation
cs_cz: Nepodařilo se spojit dva povrchy T-Spline během operace přemostění
es_es: No se han podido combinar dos superficies de T-Spline durante la operación de puente.
fr_fr: Impossible de combiner deux surfaces T-Spline lors de l'opération de pont
it_it: Impossibile combinare due superfici T-Spline durante l'operazione del ponte
pl_pl: Nie można połączyć dwóch powierzchni T-splajn w trakcie operacji mostowania
pt_br: Falha ao combinar duas superfícies da T-Spline durante a operação de ponte
ru_ru: Не удалось объединить две Т-сплайновые поверхности во время работы с мостом

source: The given inputs are invalid - make sure the first group belongs to the input surface and the second group belongs to either the same surface or another surface
cs_cz: Dané vstupy nejsou platné – ujistěte se, že první skupina patří ke vstupnímu povrchu a druhá skupina patří buď ke stejnému povrchu, nebo jinému povrchu
es_es: Las entradas especificadas no son válidas: asegúrese de que el primer grupo pertenece a la superficie de entrada y que el segundo grupo pertenece a la misma superficie u otra.
fr_fr: Les entrées spécifiées ne sont pas valides. Assurez-vous que le premier groupe appartient à la surface d'entrée et que le second groupe appartient soit à la même surface, soit à une autre surface
it_it: Gli input forniti non sono validi. Assicurarsi che il primo gruppo appartenga alla superficie di input e che il secondo gruppo appartenga alla stessa superficie o ad un'altra superficie
pl_pl: Podane dane wejściowe są nieprawidłowe — upewnij się, że pierwsza grupa należy do powierzchni wejściowej, a druga grupa należy do tej samej powierzchni lub do innej powierzchni
pt_br: As entradas especificadas são inválidas. Assegure-se de que o primeiro grupo pertença à superfície de entrada e que o segundo grupo pertença à mesma superfície ou a outra superfície
ru_ru: Указанные входные данные недопустимы. Убедитесь, что первая группа принадлежит к входной поверхности, а вторая — к той же или другой поверхности

source: Segments count should be greater than or equal to 1
cs_cz: Počet segmentů by měl být větší než nebo roven 1.
es_es: El recuento de segmentos debe ser mayor o igual que 1.
fr_fr: Le nombre de segments doit être supérieur ou égal à 1
it_it: Il numero di segmenti deve essere maggiore di o uguale a 1
pl_pl: Liczba segmentów musi być większa lub równa 1
pt_br: A contagem de segmentos deve ser maior ou igual a 1
ru_ru: Число сегментов должно быть больше или равно 1

source: Segments count should be greater than rotations count
cs_cz: Počet segmentů by měl být větší než počet otočení
es_es: El número de segmentos debe ser mayor que el número de rotaciones.
fr_fr: Le nombre de segments doit être supérieur au nombre de rotations
it_it: Il numero di segmenti deve essere maggiore di quello delle rotazioni
pl_pl: Liczba segmentów powinna być większa niż liczba obrotów
pt_br: A contagem de segmentos deve ser maior do que a contagem de rotações
ru_ru: Число сегментов должно превышать число поворотов

source: Wrong first orient vertex
cs_cz: Chybný první orientovaný vrchol
es_es: Orientación de primer vértice errónea
fr_fr: Premier sommet d'orientation incorrect
it_it: Il primo vertice di orientamento è errato
pl_pl: Nieprawidłowy pierwszy wierzchołek orientacji
pt_br: Orientação incorreta do primeiro vértice
ru_ru: Первая вершина ориентации не верна

source: Wrong second orient vertex
cs_cz: Chybný druhý orientovaný vrchol
es_es: Orientación de segundo vértice errónea
fr_fr: Deuxième sommet d'orientation incorrect
it_it: Il secondo vertice di orientamento è errato
pl_pl: Nieprawidłowy drugi wierzchołek orientacji
pt_br: Orientação incorreta do segundo vértice
ru_ru: Вторая вершина ориентации не верна

source: Bridge cannot be built
cs_cz: Nelze postavit most
es_es: No se puede crear el puente.
fr_fr: Impossible de créer le pont
it_it: Impossibile creare il ponte
pl_pl: Nie można utworzyć mostu
pt_br: Não é possível construir a ponte
ru_ru: Не удается создать перемычку

source: Cast object is not a TSplineSurface
cs_cz: Vrhaný objekt není položka TSplineSurface
es_es: El objeto proyectado no es una TSplineSurface.
fr_fr: L'objet projeté n'est pas une TSplineSurface
it_it: L'oggetto proiettato non è una TSplineSurface
pl_pl: Rzutowany obiekt nie jest TSplineSurface
pt_br: O objeto projetado não é uma TSplineSurface
ru_ru: Приведенный объект не является объектом TSplineSurface

source: Spans should be greater than or equal to 1
cs_cz: Rozpětí by měla být větší než nebo rovna 1.
es_es: Los tramos deben ser mayores o iguales que 1.
fr_fr: Les travées doivent être supérieures ou égales à 1
it_it: Le campate devono essere maggiori di o uguali a 1
pl_pl: Rozpiętości powinny być większe lub równe 1
pt_br: Os vãos devem ser maiores ou iguais a 1
ru_ru: Количество пролетов должно быть больше или равно 1

source: Error loading T-Spline surface from the given file path.
cs_cz: Při načítání T-Spline povrchu z dané cesty k souboru došlo k chybě.
es_es: Error al cargar la superficie de T-Spline desde la ruta de archivo especificada.
fr_fr: Erreur lors du chargement de la surface T-Spline à partir du chemin de fichier spécifié.
it_it: Errore durante il caricamento della superficie T-Spline dal percorso file specificato.
pl_pl: Błąd podczas wczytywania powierzchni T-splajn z podanej ścieżki pliku.
pt_br: Erro ao carregar a superfície da T-Spline com base no caminho do arquivo fornecido.
ru_ru: Ошибка загрузки Т-сплайновой поверхности из указанного пути файла.

source: Unable to open the given T-Spline Scene file.
cs_cz: Není možné otevřít daný soubor scény T-Spline.
es_es: No se puede abrir el archivo de escena de T-Spline especificado.
fr_fr: Impossible d'ouvrir le fichier de scène T-Spline spécifié.
it_it: Impossibile aprire il file della scena T-Spline specificato.
pl_pl: Nie można otworzyć danego pliku sceny T-splajn.
pt_br: Não é possível abrir o arquivo de cena fornecido da T-Spline.
ru_ru: Невозможно открыть указанный файл T-Spline Scene.

source: Unable to load T-Spline surfaces.
cs_cz: Není možné načíst povrchy T-Spline.
es_es: No se pueden cargar las superficies de T-Spline.
fr_fr: Impossible de charger les surfaces T-Spline.
it_it: Impossibile caricare le superfici T-Spline.
pl_pl: Nie można wczytać powierzchni T-splajn.
pt_br: Não é possível carregar as superfícies da T-Spline.
ru_ru: Невозможно загрузить T-сплайновые поверхности.

source: Error saving TSM
cs_cz: Chyba při ukládání souboru TSM
es_es: Error al guardar TSM.
fr_fr: Erreur lors de l'enregistrement du fichier TSM
it_it: Errore durante il salvataggio di TSM
pl_pl: Błąd zapisywania TSM
pt_br: Erro ao salvar o TSM
ru_ru: Ошибка при сохранении TSM

source: Error saving TSS
cs_cz: Chyba při ukládání souboru TSS
es_es: Error al guardar TSS.
fr_fr: Erreur lors de l'enregistrement du fichier TSS
it_it: Errore durante il salvataggio di TSS
pl_pl: Błąd zapisywania TSS
pt_br: Erro ao salvar o TSS
ru_ru: Ошибка при сохранении TSS

source: Error saving a T-Spline surface to a string
cs_cz: Při ukládání povrchu T-Spline do řetězce došlo k chybě
es_es: Error al guardar una superficie de T-Spline en una cadena.
fr_fr: Erreur lors de l'enregistrement d'une surface T-Spline dans une chaîne
it_it: Errore durante il salvataggio di una superficie T-Spline in una stringa
pl_pl: Błąd podczas zapisywania powierzchni T-splajn w ciągu
pt_br: Erro ao salvar uma superfície da T-Spline em uma sequência de caracteres
ru_ru: Ошибка при сохранении Т-сплайновой поверхности в строку

source: Error loading T-Spline surface from the given string.
cs_cz: Při načítání povrchu T-Spline z daného řetězce došlo k chybě.
es_es: Error al cargar la superficie de T-Spline desde la cadena especificada.
fr_fr: Erreur lors du chargement de la surface T-Spline à partir de la chaîne spécifiée.
it_it: Errore durante il caricamento della superficie T-Spline dalla stringa specificata.
pl_pl: Błąd podczas wczytywania powierzchni T-splajn z podanego ciągu.
pt_br: Erro ao carregar a superfície da T-Spline da sequência de caracteres fornecida.
ru_ru: Ошибка при загрузке Т-сплайновой поверхности из заданной строки.

source: This T-Spline is not BRep convertible
cs_cz: Tuto křivku T-Spline nelze převést na položku BRep.
es_es: Esta T-Spline no se puede convertir en BRep.
fr_fr: Cette T-spline n'est pas convertible en BRep
it_it: Questa T-Spline non è convertibile in BRep
pl_pl: Nie można przekształcić bryły T-splajn w reprezentację bryłową
pt_br: Não é possível converter esta T-Spline em BRep
ru_ru: Данный Т-сплайн невозможно преобразовать в контурное представление

source: Unable to convert to BRep
cs_cz: Nelze provést převod na BRep
es_es: No se puede convertir a BRep.
fr_fr: Impossible de convertir en BRep
it_it: Impossibile convertire in BRep
pl_pl: Nie można przekształcić w reprezentację bryłową
pt_br: Não é possível converter em REPRLIMITE
ru_ru: Не удалось преобразовать в объект BRep

source: Minimum segments count must be greater or equal to 0.
cs_cz: Minimální počet segmentů musí být větší nebo roven 0.
es_es: El número mínimo de segmentos debe ser mayor o igual a 0.
fr_fr: Le nombre minimal de segments doit être supérieur ou égal à 0.
it_it: Il numero minimo di segmenti deve essere maggiore di o uguale a 0.
pl_pl: Minimalna liczba segmentów musi być większa lub równa 0.
pt_br: A contagem mínima de segmentos deve ser maior ou igual a 0.
ru_ru: Минимальное количество сегментов должно быть больше или равно 0.

source: The mesh is empty
cs_cz: Sítě jsou prázdné
es_es: La malla está vacía.
fr_fr: Le maillage est vide
it_it: La mesh è vuota
pl_pl: Siatka jest pusta
pt_br: A malha está vazia
ru_ru: Сеть пуста

source: Groups sizes don't match.
cs_cz: Velikosti skupin se neshodují.
es_es: Los tamaños de grupo no coinciden.
fr_fr: Les tailles des groupes sont différentes.
it_it: Le dimensioni dei gruppi non corrispondono.
pl_pl: Rozmiary grup nie pasują do siebie.
pt_br: Os tamanhos dos grupos não coincidem.
ru_ru: Размеры групп не совпадают.

source: T-Spline Surface is not extractable and can not be displayed in smooth mode
cs_cz: Povrch T-Spline není extrahovatelný a nelze jej zobrazit ve vyhlazeném režimu.
es_es: La superficie de T-Spline no se puede extraer ni visualizar en modo suavizado.
fr_fr: La surface T-Spline n'est pas extractible et ne peut pas être affichée dans le mode lisse
it_it: Impossibile estrarre la superficie T-Spline e visualizzarla in modalità uniforme
pl_pl: Nie można wyodrębnić powierzchni T-splajn i nie można jej wyświetlić w trybie wygładzania
pt_br: A superfície da T-Spline não é extraível e não pode ser exibida no modo suave
ru_ru: Т-сплайновую поверхность невозможно извлечь и отобразить в режиме сглаживания

source: T-Spline Surface requires segments count to be greater or equal to 1
cs_cz: Povrch T-Spline vyžaduje, aby byl počet segmentů větší než nebo roven 1.
es_es: La superficie de T-Spline requiere que el número de segmentos sea mayor o igual que 1.
fr_fr: La surface T-spline requiert un nombre de segments supérieur ou égal à 1
it_it: La superficie T-Spline richiede che il numero di segmenti sia maggiore di o uguale a 1
pl_pl: Powierzchnia T-splajn wymaga liczby segmentów większej lub równej 1
pt_br: A superfície da T-Spline requer que a contagem de segmentos seja maior ou igual a 1
ru_ru: Количество сегментов Т-сплайновой поверхности должно быть больше или равно 1

source: Failed to bevel edges
cs_cz: Nepodařilo se zkosit hrany
es_es: Error al biselar aristas
fr_fr: Échec du biseautage des arêtes
it_it: Impossibile smussare i bordi
pl_pl: Ścięcie krawędzi nie powiodło się
pt_br: Falha durante o chanfro das arestas
ru_ru: Не удалось выполнить скос ребер

source: Failed to slide edges
cs_cz: Nepodařilo se posunout hrany
es_es: No se han podido deslizar las aristas.
fr_fr: Échec du glissement des arêtes
it_it: Impossibile far scorrere i bordi
pl_pl: Nie można przesunąć krawędzi
pt_br: Falha durante a operação de deslizar as arestas
ru_ru: Не удалось сдвинуть ребра
