Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Unable to attach cellular analyzer to Polysurface
cs_cz: Nelze připojit analyzátor buněk k objektu PolySurface.
es_es: No se puede enlazar analizador celular a PolySurface
fr_fr: Impossible d'attacher l'analyseur cellulaire à la Polysurface
it_it: Impossibile associare l'analizzatore cellulare per PolySurface
pl_pl: Nie można dołączyć do Polysurface analizatora komórkowego
pt_br: Não é possível anexar o analisador celular para a PolySurface
ru_ru: Не удалось присоединить ячеистый анализатор к поверхности Polysurface

source: Unable to extract solids from Polysurface
cs_cz: Nelze extrahovat tělesa z objektu PolySurface.
es_es: No se puede extraer sólidos de PolySurface
fr_fr: Impossible d'extraire des solides de la Polysurface
it_it: Impossibile estrarre solidi da PolySurface
pl_pl: Nie można wyodrębnić brył z Polysurface
pt_br: Não é possível extrair os sólidos a partir da PolySurface
ru_ru: Не удалось извлечь тела из поверхности Polysurface

source: Could not project_point on polysurface.
cs_cz: Metodu project_point nebylo možné u objektu PolySurface použít.
es_es: No se ha podido project_point en PolySurface.
fr_fr: Impossible de project_point sur une polysurface.
it_it: Impossibile proiettare il punto sulla PolySurface.
pl_pl: Rzutowanie punktu project_point na polysurface zakończone niepowodzeniem .
pt_br: Não foi possível projetar o ponto na PolySurface.
ru_ru: Не удалось выполнить project_point на поверхности polysurface.

source: Cannot create a PolySurface from an empty list
cs_cz: Nelze vytvořit objekt PolySurface z prázdného seznamu.
es_es: No se puede crear una PolySurface a partir de una lista vacía
fr_fr: Impossible de créer une PolySurface depuis une liste vide
it_it: Impossibile creare una PolySurface da un elenco vuoto
pl_pl: Nie można utworzyć PolySurface z pustej listy
pt_br: Não é possível criar uma PolySurface partir de uma lista vazia
ru_ru: Невозможно создать PolySurface на основе пустого списка

source: Could not make patched polysurface.
cs_cz: Opravený objekt PolySurface nebylo možné vytvořit.
es_es: No se ha podido crear PolySurface con parche.
fr_fr: Impossible de créer une polysurface corrigée.
it_it: Impossibile creare una PolySurface chiusa.
pl_pl: Nie udało się utworzyć zamkniętej PolySurface.
pt_br: Não foi possível criar a PolySurface corrigida.
ru_ru: Не удалось создать замыкающую polysurface.

source: Unable to get edges from polysurface
cs_cz: Nelze načíst hrany z objektu PolySurface.
es_es: No se puede obtener aristas de PolySurface
fr_fr: Impossible d'obtenir les arêtes à partir de la polysurface
it_it: Impossibile ottenere spigoli dalla PolySurface
pl_pl: Nie można pobrać krawędzi z Polysurface
pt_br: Não foi possível obter as arestas da PolySurface
ru_ru: Не удалось получить ребра из Polysurface

source: Input Points don't form a valid Rectangle
cs_cz: Zadané body netvoří platný obdélník.
es_es: Los Points de entrada no forman un Rectangle válido
fr_fr: Les points d'entrée ne forment pas un Rectangle valide
it_it: I punti di input non formano un rettangolo valido
pl_pl: Punkty wejściowe nie tworzą prawidłowego prostokąta
pt_br: Os pontos de entrada não formam um retângulo válido
ru_ru: Точки входа не образуют подходящий прямоугольник Rectangle

source: Casted object is not a Rectangle
cs_cz: Vrhaný objekt není položka Rectangle.
es_es: El objeto proyectado no es un Rectangle
fr_fr: L'objet projeté n'est pas un Rectangle
it_it: L'oggetto proiettato non è Rectangle
pl_pl: Rzutowany obiekt nie jest Rectangle
pt_br: O objeto projetado não é um retângulo
ru_ru: Приведенный объект не является объектом Rectangle

source: Rectangle needs 3 or 4 corner points
cs_cz: Obdélník potřebuje 3 nebo 4 rohové body
es_es: Rectangle necesita 3 o 4 puntos de esquina.
fr_fr: Le rectangle requiert 3 ou 4 points de coin
it_it: Il rettangolo richiede 3 o 4 punti d'angolo
pl_pl: Prostokąt wymaga 3 lub 4 punktów narożnych
pt_br: O retângulo deve ter 3 ou 4 pontos de canto
ru_ru: Прямоугольник должен содержать 3–4 угловые точки

source: Cast object is not a Solid
cs_cz: Vrhaný objekt není položka Solid.
es_es: El objeto proyectado no es un Solid
fr_fr: L'objet projeté n'est pas un Solid
it_it: L'oggetto proiettato non è Solid
pl_pl: Rzutowany obiekt nie jest Solid
pt_br: O objeto projetado não é um sólido
ru_ru: Приведенный объект не является объектом Solid

source: Cannot facet Solid: it is a wire body
cs_cz: Nelze vytvořit složenou položku Solid: jedná se o drátové těleso.
es_es: No se puede facetar Solid: es un cuerpo alámbrico
fr_fr: Impossible de créer les facettes du Solid: il s'agit d'un corps filaire
it_it: Impossibile sfaccettare Solid: è un corpo wire
pl_pl: Nie można utworzyć fasety dla Solid: jest ona bryłą krawędziową
pt_br: Não é possível facetar o sólido: é um corpo da fiação
ru_ru: Не удается добавить грани на Solid: тело является каркасным

source: Unable to get volume
cs_cz: Nelze získat položku Volume.
es_es: No se puede obtener Volume
fr_fr: Impossible d'obtenir le volume
it_it: Impossibile ottenere volume
pl_pl: Nie można pobrać volume
pt_br: Não é possível obter o volume
ru_ru: Не удалось получить volume

source: Unable union two Solids
cs_cz: Nelze sjednotit dvě položky Solid.
es_es: No es posible unir dos Solids
fr_fr: Impossible d'unir deux Solids
it_it: Impossibile unire due Solid
pl_pl: Nie można połączyć dwóch Solids
pt_br: Não é possível unir dois sólidos
ru_ru: Не удается объединить два Solids

source: Cannot union an empty list
cs_cz: Nelze sjednotit prázdný seznam.
es_es: No se puede unir una lista vacía
fr_fr: Impossible d'unir une liste vide
it_it: Impossibile unire un elenco vuoto
pl_pl: Nie można połączyć pustej listy
pt_br: Não é possível unir uma lista vazia
ru_ru: Не допускается объединение пустого списка

source: Unable to difference two Solids
cs_cz: Nelze odlišit dvě tělesa
es_es: No se pueden restar dos Solids.
fr_fr: Impossible de différencier deux Solids
it_it: Impossibile definire la differenza tra due solidi
pl_pl: Nie można rozróżnić dwóch brył
pt_br: Não é possível diferenciar os dois sólidos
ru_ru: Невозможно дифференцировать два тела

source: The resulting solid is either a zero-volume solid or is invalid.
cs_cz: Výsledné tělese má buď nulový objem, nebo není platné.
es_es: El sólido resultante es un sólido de volumen cero o no es válido.
fr_fr: Soit le solide obtenu est de volume nul, soit il est incorrect.
it_it: Il solido risultante è un solido con volume pari a zero o non è valido.
pl_pl: Bryła wynikowa jest albo bryłą o zerowej objętości, albo jest niepoprawna.
pt_br: O sólido resultante tem o volume igual a zero ou é inválido.
ru_ru: Итоговое тело имеет нулевой объем или недействительно.

source: Cannot difference an empty list
cs_cz: Není možné rozdělit prázdný seznam
es_es: No se puede restar una lista vacía.
fr_fr: Impossible de différencier une liste vide
it_it: Impossibile definire la differenza in un elenco vuoto
pl_pl: Nie można rozróżnić pustej listy
pt_br: Não é possível diferenciar uma lista vazia
ru_ru: Невозможно дифференцировать пустой список

source: Unable intersect two Solids
cs_cz: Nepodařilo se protnout dvě tělesa
es_es: No se pueden intersecar dos sólidos.
fr_fr: Impossible d'entrecouper deux Solides
it_it: Impossibile intersecare due solidi
pl_pl: Nie można utworzyć części wspólnej dwóch brył
pt_br: Não é possível efetuar a intersecção de dois sólidos
ru_ru: Ошибка пересечения двух тел

source: Unable to loft
cs_cz: Není možné provést šablonování
es_es: No se puede solevar.
fr_fr: Lissage impossible
it_it: Impossibile eseguire il loft
pl_pl: Nie można utworzyć wyciągnięcia
pt_br: Não é possível elevar
ru_ru: Не удалось выполнить лофтинг

source: Unable to set sections for loft!
cs_cz: Nelze nastavit řezy pro šablonování.
es_es: No se pueden establecer secciones para la solevación.
fr_fr: Impossible de définir les coupes pour le lissage.
it_it: Impossibile impostare le sezioni per il loft.
pl_pl: Nie można ustawić przekrojów dla wyciągnięcia!
pt_br: Não é possível definir seções para transição.
ru_ru: Невозможно задать сечения для лофтинга.

source: Unable to set standard boundary condition at first loft section!
cs_cz: Nelze nastavit standardní okrajovou podmínku na první řez šablonování.
es_es: No se puede establecer la condición de contorno estándar en la primera sección de solevación.
fr_fr: Impossible de définir la condition aux limites standard lors de la première coupe de lissage.
it_it: Impossibile impostare la condizione di contorno standard nella prima sezione di loft.
pl_pl: Nie można ustawić standardowego warunku obwiedni przy pierwszym przekroju wyciągnięcia!
pt_br: Não é possível definir a condição padrão do limite na primeira seção de transição.
ru_ru: Невозможно задать стандартное граничное условие в первом лофтированном сечении.

source: Unable to set standard boundary condition at last loft section!
cs_cz: Nelze nastavit standardní okrajovou podmínku na poslední řez šablonování.
es_es: No se puede establecer la condición de contorno estándar en la última sección de solevación.
fr_fr: Impossible de définir la condition aux limites standard lors de la dernière coupe de lissage.
it_it: Impossibile impostare la condizione di contorno standard nell'ultima sezione di loft.
pl_pl: Nie można ustawić standardowego warunku obwiedni przy ostatnim przekroju wyciągnięcia!
pt_br: Não é possível definir a condição padrão do limite na última seção de transição.
ru_ru: Невозможно задать стандартное граничное условие в последнем лофтированном сечении.

source: Unable to set the sections or the centerline!
cs_cz: Nelze nastavit řezy nebo osu!
es_es: No se puede definir las secciones o el eje
fr_fr: Impossible de définir les sections ou l'axe.
it_it: Impossibile impostare le sezioni o la linea d'asse.
pl_pl: Nie można ustawić przekrojów ani osi!
pt_br: Não é possível definir os cortes ou a linha de centro!
ru_ru: Не удалось задать разрезы или осевую линию!

source: Unable to set the profile and the path!
cs_cz: Nelze nastavit profil a cestu!
es_es: No se puede definir el perfil y la trayectoria
fr_fr: Impossible de définir le profil et la trajectoire.
it_it: Impossibile impostare il profilo e il percorso.
pl_pl: Nie można ustawić profilu i ścieżki!
pt_br: Não é possível definir o perfil e o caminho!
ru_ru: Не удалось задать профиль и траекторию!

source: Unable to set miter type!
cs_cz: Nelze nastavit typ úkosu.
es_es: No se puede establecer el tipo de bisel.
fr_fr: Impossible de définir le type d'onglet.
it_it: Impossibile impostare il tipo di giunto d'angolo.
pl_pl: Nie można ustawić typu połączenia kątowego!
pt_br: Nâo é possível definir o tipo de chanfro.
ru_ru: Невозможно задать тип косого среза.

source: Unable to set whether to retain mergeable edges!
cs_cz: Nelze nastavit, zda se mají zachovat sloučitelné hrany!
es_es: No se puede definir si conservar aristas fusionables
fr_fr: Impossible de définir si vous souhaitez conserver les arêtes fusionnables.
it_it: Impossibile scegliere se conservare gli spigoli unibili.
pl_pl: Nie można ustawić, czy możliwe do połączenia krawędzie mają być zachowane!
pt_br: Não é possível definir se é para reter as arestas mescláveis!
ru_ru: Не удалось настроить, следует ли сохранять объединяемые ребра!

source: Unable to set the draft angle!
cs_cz: Nelze nastavit úhel zešikmení!
es_es: No se puede definir el ángulo de desmoldeo
fr_fr: Impossible de définir l'angle de dépouille.
it_it: Impossibile impostare l'angolo di sformo.
pl_pl: Nie można ustawić kąta pochylenia!
pt_br: Não é possível definir o ângulo de desenho.
ru_ru: Не удалось задать угол граничных условий!

source: Unable to set the gap type!
cs_cz: Nelze nastavit typ mezery!
es_es: No se puede definir el tipo de hueco
fr_fr: Impossible de définir le type d'écart.
it_it: Impossibile impostare il tipo di distanza.
pl_pl: Nie można ustawić typu odstępu!
pt_br: Não é possível definir o tipo de folga!
ru_ru: Не удалось задать тип зазора!

source: Unable to set cut-end-off option!
cs_cz: Nelze nastavit možnost odříznutí konce.
es_es: No se puede configurar la opción de corte de extremo "cut-end-off".
fr_fr: Impossible de configurer l'opération de coupure d'extrémité.
it_it: Impossibile impostare l'opzione di taglio estremità.
pl_pl: Nie można ustawić opcji wycięcia końca!
pt_br: Não é possível definir a opção Cortar final.
ru_ru: Не удалось настроить параметр обрезки конца.

source: The profile Curve must be planar to perform sweep
cs_cz: Křivka profilu musí být rovinná, aby bylo možné provést tažení.
es_es: La Curve de perfil debe ser plana para realizar barrido
fr_fr: La Curve de profil doit être plane pour effectuer le balayage
it_it: La curva del profilo deve essere piana per eseguire l'estrusione su percorso
pl_pl: Krzywa profilu musi być płaska, aby wykonać przeciągnięcie
pt_br: A curva do perfil deve ser plana para efetuar a extrusão por percurso
ru_ru: Кривая профиля должна быть плоской для выполнения сдвига

source: Unable to update solid by sweep
cs_cz: Nelze aktualizovat těleso pomocí tažení.
es_es: No se puede actualizar sólido mediante barrido
fr_fr: Impossible de mettre à jour un solide par balayage
it_it: Impossibile aggiornare un solido mediante estrusione su percorso
pl_pl: Nie można zaktualizować bryły przez przeciągnięcie
pt_br: Não é possível atualizar o sólido por extrusão por percurso
ru_ru: Не удалось обновить тело путем сдвига

source: Thicknesses must be positive
cs_cz: Zadaná délka segmentu musí být větší než 0.
es_es: El grosor debe ser positivo
fr_fr: L'épaisseur doit être positive
it_it: Gli spessori devono essere valori positivi
pl_pl: Grubość musi być dodatnia
pt_br: A espessura deve ser positiva
ru_ru: Значение толщины должно быть положительным

source: Could not set shelling body
cs_cz: Skořepinové těleso nebylo možné nastavit.
es_es: No se ha podido definir cuerpo de funda
fr_fr: Impossible de définir le corps de la coque
it_it: Impossibile impostare l'involucro di svuotamento
pl_pl: Nie można ustawić bryły skorupowej
pt_br: Não foi possível definir o corpo da casca
ru_ru: Не удалось установить оболочечное тело

source: Unable to set the external thickness
cs_cz: Nelze nastavit vnější tloušťku.
es_es: No se puede definir el grosor externo
fr_fr: Impossible de définir l'épaisseur externe
it_it: Impossibile impostare lo spessore esterno
pl_pl: Nie można ustawić grubości zewnętrznej
pt_br: Não é possível definir a espessura externa
ru_ru: Не удалось задать внешнюю толщину

source: Unable to set the internal thickness
cs_cz: Nelze nastavit vnitřní tloušťku.
es_es: No se puede definir el grosor interno
fr_fr: Impossible de définir l'épaisseur interne
it_it: Impossibile impostare lo spessore interno
pl_pl: Nie można ustawić grubości wewnętrznej
pt_br: Não é possível definir a espessura interna
ru_ru: Не удалось задать внутреннюю толщину

source: Unable to compute shell
cs_cz: Nelze vypočítat skořepinu.
es_es: No se puede calcular funda
fr_fr: Impossible de calculer la coque
it_it: Impossibile calcolare l'involucro
pl_pl: Nie można obliczyć powłoki
pt_br: Não é possível calcular a casca
ru_ru: Не удалось рассчитать оболочку

source: Unable to set Solid Edges to fillet
cs_cz: Nelze nastavit položky Solid Edge k zaoblení.
es_es: No se puede definir Edges Solid para empalme
fr_fr: Impossible de définir pour des Edges de Solid à raccorder
it_it: Impossibile impostare gli spigoli di Solid da raccordare
pl_pl: Nie można ustawić Solid Edges do zaokrąglenia
pt_br: Não é possível definir as arestas de sólidas para a concordância
ru_ru: Не удалось настроить сопряжение ребер тела

source: Unable to set Solid edges to chamfer
cs_cz: Nelze nastavit okraje tělesa ke zkosení
es_es: No se pueden establecer aristas de Solid en el chaflán.
fr_fr: Impossible de définir les arêtes du Solid à chanfreiner
it_it: Impossibile impostare gli spigoli di solidi da smussare
pl_pl: Nie można ustawić fazowania krawędzi bryły
pt_br: Não é possível definir as arestas do sólido para o chanfro
ru_ru: Невозможно задать скос ребер тела

source: Unable to compute chamfer
cs_cz: Nelze vypočítat zkosení.
es_es: No se puede calcular chaflán
fr_fr: Impossible de calculer le chanfrein
it_it: Impossibile calcolare lo smusso
pl_pl: Nie można obliczyć fazy
pt_br: Não foi possível calcular o chanfro
ru_ru: Не удалось рассчитать фаску

source: ByJoinedSurfaces requires at least one Surface
cs_cz: Objekt ByJoinedSurfaces vyžaduje alespoň jeden povrch.
es_es: ByJoinedSurfaces requiere al menos una Surface
fr_fr: ByJoinedSurfaces requiert au moins une Surface
it_it: ByJoinedSurfaces richiede almeno una Surface
pl_pl: ByJoinedSurfaces wymaga co najmniej jednej powierzchni
pt_br: ByJoinedSurfaces requer ao menos uma superfície
ru_ru: Для элемента ByJoinedSurfaces требуется по крайней мере одна поверхность

source: Surfaces could not be joined into a closed Solid!
cs_cz: Povrchy nebylo možné spojit do uzavřeného tělesa.
es_es: Las Surfaces no se han podido unir a un Solid cerrado.
fr_fr: Les surfaces ne peuvent pas former un solide fermé.
it_it: Impossibile unire le superfici in un solido chiuso.
pl_pl: Nie udało się połączyć powierzchni w zamkniętą bryłę!
pt_br: As superfícies não puderam ser unidas em um sólido fechado!
ru_ru: Поверхности Surfaces не могут быть соединены в замкнутом твердом теле Solid!

source: Surfaces could not be joined into a closed Solid, even with refinement!
cs_cz: Povrchy nebylo možné ani při použití zjemnění spojit do uzavřeného tělesa.
es_es: Las Surfaces no se han podido unir a un Solid cerrado, incluso con refinado.
fr_fr: Les surfaces ne peuvent pas former un solide fermé, même avec affinement.
it_it: Impossibile unire le superfici in un solido chiuso, anche con l'affinamento.
pl_pl: Powierzchni nie można połączyć w zamkniętą bryłą, nawet z użyciem funkcji wygładzania!
pt_br: As superfícies não puderam ser unidas em um sólido fechado, mesmo com o refinamento!
ru_ru: Поверхности Surfaces не могут быть соединены в замкнутом твердом теле Solid, даже при внесении уточнения!

source: Not implemented
cs_cz: Není implementováno.
es_es: No implementado
fr_fr: Non mis en oeuvre
it_it: Non implementato
pl_pl: Nie zaimplementowano
pt_br: Não implementado
ru_ru: Не реализовано

source: Profile Curve must be closed
cs_cz: Křivka profilu musí být uzavřená.
es_es: La Curve de perfil debe ser cerrada
fr_fr: La Curve de profil doit être fermée
it_it: La curva di profilo deve essere chiusa
pl_pl: Krzywa profilu musi być zamknięta
pt_br: A curva de perfil deve ser fechada
ru_ru: Кривая профиля должна быть замкнутой

source: Unable set up two rail sweep operation.
cs_cz: Nelze nastavit dvě operace tažení.
es_es: No se puede configurar operación de barrido de dos barandales
fr_fr: Impossible de configurer une opération d'extrusion de deux rails.
it_it: Impossibile impostare un'operazione di estrusione su percorso con due guide.
pl_pl: Nie można ustawić operacji przeciągnięcia dwóch torów.
pt_br: Não é possível definir a operação de varredura de dois corrimãos.
ru_ru: Не удалось осуществить операцию сдвига по двум направляющим.

source: Cannot instruct ASM to make a Solid.
cs_cz: Nelze instruovat ASM k vytvoření položky Solid.
es_es: No se puede instruir a ASM para crear un Solid
fr_fr: Impossible de demander à ASM de créer un Solid.
it_it: Impossibile impostare ASM per la creazione di Solid.
pl_pl: Nie można ustawić utworzenia Solid w ASM.
pt_br: Não é possível instruir ASM para criar um sólido.
ru_ru: Не удается настроить ASM для создания Solid.

source: Cannot set linear map for two-rail sweeping.
cs_cz: Nelze nastavit lineární mapu pro tažení podél dvou trajektorií.
es_es: No se puede definir asignación lineal para barrido de dos barandales
fr_fr: Impossible de définir le mappage linéaire pour le balayage de deux rails.
it_it: Impossibile impostare il mappaggio lineare per l'estrusione su percorso con due guide.
pl_pl: Nie można ustawić liniowej mapy dla przeciągnięcia dwóch torów.
pt_br: Não é possível definir uma mapa linear para a extrusão por percurso de dois corrimãos.
ru_ru: Не удалось определить линейную карту для сдвига по двум направляющим.

source: Unable to sweep profile Curve.
cs_cz: Nelze táhnout položku Curve profilu.
es_es: No se puede barrer Curve de perfil
fr_fr: Impossible de balayer la Curve du profil.
it_it: Impossibile eseguire l'estrusione su percorso di Curve del profilo.
pl_pl: Nie można przeciągnąć Curve profilu.
pt_br: Não é possível efetuar a extrusão por percurso em uma curva de perfil.
ru_ru: Сдвиг кривой профиля не удался.

source: Cannot union an empty list of Solids
cs_cz: Nelze sjednotit prázdný seznam položek Solids.
es_es: No se puede unir una lista vacía de Solids
fr_fr: Impossible d'unir une liste vide de Solids
it_it: Impossibile unire un elenco di Solid vuoto
pl_pl: Nie można połączyć pustej listy Solids
pt_br: Não é possível unir uma lista vazia de sólidos
ru_ru: Не допускается объединение пустого списка тел

source: Cannot create Solid, Curves are not closed
cs_cz: Nelze vytvořit položku Solid. Položky Curves nejsou uzavřeny.
es_es: No se puede crear Solid, las Curves no son cerradas
fr_fr: Impossible de créer un Solid, les Curves ne sont pas fermées
it_it: Impossibile creare Solid: Curve non chiuse
pl_pl: Nie można utworzyć Solid, Curves nie są zamknięte
pt_br: Não é possível criar um sólido, as curvas não estão fechadas
ru_ru: Не удалось создать Solid: кривые не замкнуты

source: Cast object is not a Sphere
cs_cz: Vrhaný objekt není položka Sphere.
es_es: El objeto proyectado no es una Sphere
fr_fr: L'objet projeté n'est pas une Sphere
it_it: L'oggetto proiettato non è Sphere
pl_pl: Rzutowany obiekt nie jest Sphere
pt_br: O objeto projetado não é uma esfera
ru_ru: Приведенный объект не является объектом Sphere

source: Sphere::by_four_points needs 4 points.
cs_cz: Položka Sphere::by_four_points vyžaduje čtyři body.
es_es: Sphere::by_four_points necesita cuatro puntos
fr_fr: Sphere::by_four_points nécessite 4 points.
it_it: Sphere::by_four_points richiede quattro punti.
pl_pl: Sphere::by_four_points wymaga 4 punktów.
pt_br: Esfera::by_four_points precisa de 4 pontos.
ru_ru: Sphere::by_four_points требует 4 точки.

source: Failed to make Sphere by four points.
cs_cz: Nepodařilo se vytvořit položku Sphere pomocí čtyř bodů.
es_es: Error al crear Sphere por cuatro puntos
fr_fr: Echec de la création de la Sphere par quatre points.
it_it: Impossibile creare Sphere mediante quattro punti.
pl_pl: Nie udało się utworzyć Sphere z czterech punktów.
pt_br: Falha ao criar a esfera por quatro pontos.
ru_ru: Не удалось создать сферу Sphere на основе четырех точек.

source: Sphere::by_four_points needs more than 4 points.
cs_cz: Položka Sphere::by_four_points vyžaduje alespoň 4 body.
es_es: Sphere::by_four_points necesita más de cuatro puntos.
fr_fr: Sphere::by_four_points nécessite plus de 4 points.
it_it: Sphere::by_four_points richiede più di 4 punti.
pl_pl: Sphere::by_four_points wymaga więcej niż 4 punktów.
pt_br: Sphere::by_four_points precisa de mais de 4 pontos.
ru_ru: Sphere::by_four_points требует более 4 точек.

source: Failed to fit Sphere.
cs_cz: Usazení položky Sphere se nezdařilo.
es_es: Error al ajustar Sphere
fr_fr: Echec de l'ajustement de la Sphere.
it_it: Impossibile adattare Sphere.
pl_pl: Nie można dopasować Sphere.
pt_br: Falha ao ajustar a esfera.
ru_ru: Не удалось вписать сферу.

source: Unable to create sphere
cs_cz: Nelze vytvořit kouli.
es_es: No se puede crear esfera
fr_fr: Impossible de créer une sphère
it_it: Impossibile creare una sfera
pl_pl: Nie można utworzyć sfery
pt_br: Não é possível criar a esfera
ru_ru: Не удалось создать сферу
