Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Cast object is not a TSplineVertex
cs_cz: Vrhaný objekt není objekt TSplineVertex
es_es: El objeto proyectado no es un TSplineVertex.
fr_fr: L'objet projeté n'est pas un TSplineVertex
it_it: L'oggetto proiettato non è un TSplineVertex
pl_pl: Rzutowany obiekt nie jest TSplineVertex
pt_br: O objeto projetado não é um TSplineVertex
ru_ru: Приведенный объект не является TSplineVertex

source: Vertex has invalid parent
cs_cz: Vrchol nemá platný nadřazený prvek
es_es: El vértice tiene un elemento superior no válido.
fr_fr: Le parent du sommet est incorrect
it_it: L'elemento principale del vertice non è valido
pl_pl: Wierzchołek ma nieprawidłowy element nadrzędny
pt_br: O vértice tem principal inválido
ru_ru: Для вершины задан недопустимый родительский объект

source: Vertex index is invalid
cs_cz: Index vrcholu není platný
es_es: El índice de vértices no es válido
fr_fr: L'index du sommet est incorrect
it_it: L'indice del vertice non valido
pl_pl: Indeks wierzchołka jest nieprawidłowy
pt_br: O índice do vértice é inválido
ru_ru: Недопустимый индекс вершины

source: Unable to write entity list as sat
cs_cz: Není možné zapsat seznam entit jako soubor SAT.
es_es: No se puede escribir lista de entidades como SAT.
fr_fr: Impossible d'écrire la liste des entités au format SAT
it_it: Impossibile scrivere l'elenco entità come file SAT
pl_pl: Nie można zapisać listy elementów jako elementu sat
pt_br: Não é possível gravar a lista de entidades como SAT
ru_ru: Не удается записать список объектов в формате SAT

source: Unable to open file
cs_cz: Nelze otevřít soubor
es_es: No se puede abrir el archivo.
fr_fr: Impossible d'ouvrir le fichier
it_it: Impossibile aprire il file
pl_pl: Nie można otworzyć pliku
pt_br: Não é possível abrir o arquivo
ru_ru: Не удалось открыть файл

source: Unable to restore entities
cs_cz: Nelze se obnovit entity
es_es: No se pueden restaurar las entidades.
fr_fr: Impossible de restaurer les entités
it_it: Impossibile ripristinare le entità
pl_pl: Nie można przywrócić elementów
pt_br: Não é possível restaurar as entidades
ru_ru: Не удалось восстановить объекты

source: Failed to create geometry from solid def JSON
cs_cz: Nepodařilo se vytvořit geometrii z definice tělesa JSON.
es_es: No se ha podido crear la geometría a partir del JSON de def. del sólido.
fr_fr: Echec de la création de la géométrie à partir du JSON def solide
it_it: Impossibile creare la geometria dalla stringa JSON contenente la geometria def solida
pl_pl: Nie można utworzyć geometrii z informacji JSON definicji bryły
pt_br: Falha ao criar a geometria com base no Solid Def JSON
ru_ru: Не удалось создать геометрию из тела формата DEF JSON

source: Unable to get units
cs_cz: Nelze získat jednotky
es_es: No se pueden obtener las unidades.
fr_fr: Impossible d'obtenir les unités
it_it: Impossibile ottenere unità
pl_pl: Nie można pobrać jednostek
pt_br: Não é possível obter as unidades
ru_ru: Не удалось получить единицы

source: Unable to delete entity
cs_cz: Nelze vymazat entitu
es_es: No se puede suprimir la entidad.
fr_fr: Impossible de supprimer l'entité
it_it: Impossibile eliminare l'entità
pl_pl: Nie można usunąć elementu
pt_br: Não é possível excluir a entidade
ru_ru: Не удалось удалить объект

source: Error in SMI_COPY.copy
cs_cz: Chyba v SMI_COPY.copy
es_es: Error en SMI_COPY.copy
fr_fr: Erreur dans SMI_COPY.copy
it_it: Errore in SMI_COPY.copy
pl_pl: Błąd w SMI_COPY.copy
pt_br: Erro em SMI_COPY.copy
ru_ru: Ошибка в SMI_COPY.copy

source: Unable to get param range for FACE while faceting
cs_cz: Při tvorbě plošek se nepodařilo načíst rozsah parametru pro položku FACE.
es_es: No se puede obtener el intervalo de parámetros de FACE al facetar.
fr_fr: Impossible d'obtenir l'intervalle de paramètres pour la face lors de la création de facettes
it_it: Impossibile ottenere l'intervallo di parametri per la FACCIA durante la creazione della sfaccettatura
pl_pl: Nie można pobrać zakresu parametru dla powierzchni podczas tworzenia powierzchni
pt_br: Não é possível obter a faixa de parâmetros da FACE durante o facetamento
ru_ru: Не удалось получить диапазон параметров для объекта FACE при фасетизации

source: Could not get bounding box
cs_cz: Ohraničující kvádr nebylo možné načíst
es_es: No se puede obtener el cuadro de delimitación.
fr_fr: Impossible d'obtenir la zone de délimitation
it_it: Impossibile ottenere un riquadro di delimitazione
pl_pl: Nie można pobrać obramowania
pt_br: Não foi possível obter a caixa delimitadora
ru_ru: Не удалось получить ограничивающую рамку

source: Too small to facet
cs_cz: Nedostatečná velikost pro dělení na plošky
es_es: Demasiado pequeño para facetar
fr_fr: Trop petit pour créer des facettes
it_it: Troppo piccolo per creare una sfaccettatura
pl_pl: Zbyt mały, aby określić jako powierzchniowy
pt_br: Muito pequeno para lapidar
ru_ru: Размер слишком мал для создания граней

source: Could not set facet edge count
cs_cz: Počet hran plošky nebylo možné nastavit
es_es: No se ha podido establecer el recuento de bordes de facetas.
fr_fr: Impossible de définir le nombre d'arêtes de facette
it_it: Impossibile impostare il conteggio degli spigoli per le sfaccettature
pl_pl: Nie można ustawić liczby krawędzi płaszczyzny
pt_br: Não foi possível definir a contagem das arestas da faceta
ru_ru: Не удалось установить количество ребер граней

source: Could not set facet tolerance
cs_cz: Nebylo možné nastavit toleranci facet
es_es: No se ha podido establecer la tolerancia de faceta.
fr_fr: Impossible de définir la tolérance des facettes
it_it: Impossibile impostare la tolleranza per le sfaccettature
pl_pl: Nie można ustawić tolerancji płaszczyzny
pt_br: Não foi possível definir a tolerância da faceta
ru_ru: Не удалось задать допуск для граней

source: Could not set max number of grid lines
cs_cz: Nebylo možné nastavit maximální počet čar osnovy
es_es: No se ha podido establecer el número máximo de líneas de rejilla.
fr_fr: Impossible de définir le nombre maximum de lignes de grille
it_it: Impossibile impostare il numero massimo di linee della griglia
pl_pl: Nie można ustawić maksymalnej liczby linii siatki
pt_br: Não foi possível definir o número máximo de linhas de grade
ru_ru: Не удалось задать максимальное количество линий сетки

source: Could not compute facets
cs_cz: Nebylo možné vypočítat plošky
es_es: No se han podido calcular las facetas.
fr_fr: Impossible de calculer les facettes
it_it: Impossibile calcolare le sfaccettature
pl_pl: Nie można obliczyć powierzchni
pt_br: Não foi possível calcular as facetas
ru_ru: Не удалось вычислить грани

source: Could not get face results
cs_cz: Nebylo možné získat výsledky ploch
es_es: No se han podido obtener los resultados de cara.
fr_fr: Impossible d'obtenir les résultats de face
it_it: Impossibile ottenere i risultati della faccia
pl_pl: Nie można uzyskać wyników dla powierzchni
pt_br: Não foi possível obter os resultados da face
ru_ru: Не удалось получить результаты грани
