Repository: mahach666/DynamoPilot
Catalog: lib/DynamoCoreRuntime2.16.4/libg_locale/*/LC_MESSAGES/libg.po
Languages: cs_cz, es_es, fr_fr, it_it, pl_pl, pt_br, ru_ru

source: Vertex can't be creased:
cs_cz: Nelze vyostřit vrchol:
es_es: El vértice no puede ser con pliegue:
fr_fr: Le sommet ne peut pas être plié :
it_it: Il vertice non può essere sottoposto a triangolazione:
pl_pl: Nie można fałdować wierzchołka:
pt_br: Não é possível dobrar o vértice:
ru_ru: Невозможно согнуть вершину:

source: Vertex can't be uncreased:
cs_cz: Nelze zrušit vyostření vrcholu:
es_es: El vértice no puede ser sin pliegue:
fr_fr: Le pli du sommet ne peut pas être annulé:
it_it: Impossibile annullare la triangolazione del vertice:
pl_pl: Nie można usunąć fałdowania wierzchołka:
pt_br: Não é possível desdobrar o vértice:
ru_ru: Невозможно отменить сдвиг вершины:

source: Crease unsuccessful
cs_cz: Vyostření bylo neúspěšné
es_es: Pliegue incorrecto
fr_fr: Échec du pli
it_it: Piega non riuscita
pl_pl: Fałdowanie się nie powiodło
pt_br: Dobra sem êxito
ru_ru: Сгиб не выполнен

source: Weld unsuccessfull
cs_cz: Svar nebyl úspěšný
es_es: Soldadura incorrecta
fr_fr: Échec de la soudure
it_it: Saldatura non riuscita
pl_pl: Spojenie nie powiodło się
pt_br: Solda sem êxito
ru_ru: Объединение не удалось

source: Unweld unsuccessfull
cs_cz: Rušení svaru bylo neúspěšné
es_es: Anulación de soldadura incorrecta
fr_fr: Échec de l'annulation de la soudure
it_it: Annullamento della saldatura non riuscito
pl_pl: Nie udało się usunąć spoiny
pt_br: Remoção da solda sem êxito
ru_ru: Отмена сварки не выполнена

source: Failed to thicken TSpline surface
cs_cz: Nepodařilo se zesílit povrch T-Spline
es_es: No se ha podido engrosar la superficie de T-Spline.
fr_fr: Impossible d'épaissir la surface T-Spline
it_it: Impossibile ispessire la superficie T-Spline
pl_pl: Nie można pogrubić powierzchni T-splajn
pt_br: Falha ao aumentar a espessura da superfície da T-Spline
ru_ru: Не удалось увеличить толщину Т-сплайновой поверхности

source: The given edges are empty
cs_cz: Dané hrany jsou prázdné.
es_es: Las aristas especificadas están vacías.
fr_fr: Les arêtes spécifiées sont vides
it_it: I bordi specificati sono vuoti
pl_pl: Podane krawędzie są puste
pt_br: As arestas fornecidas estão vazias
ru_ru: Заданные ребра равны нулю

source: Failed to initialize the match
cs_cz: Nepodařilo se inicializovat porovnání
es_es: No se ha podido inicializar la coincidencia.
fr_fr: Échec de l'initialisation de la correspondance
it_it: Impossibile inizializzare la corrispondenza
pl_pl: Nie można zainicjować dopasowania
pt_br: Falha ao inicializar a correspondência
ru_ru: Не удалось запустить сопоставление

source: Failed to get the aligned edges
cs_cz: Nepodařilo se získat zarovnané hrany
es_es: No se han podido obtener las aristas alineadas.
fr_fr: Échec de l'obtention des arêtes alignées
it_it: Impossibile ottenere i bordi allineati
pl_pl: Nie można pobrać wyrównanych krawędzi
pt_br: Falha durante a obteção das arestas alinhadas
ru_ru: Не удалось выровнять ребра

source: Failed to convert ASM curves to T-Spline NURBS curve interfaces
cs_cz: Nepodařilo se převést křivky ASM na rozhraní křivek T-Spline NURBS
es_es: No se han podido convertir las curvas ASM en interfaces de curva NURBS de T-Spline.
fr_fr: Échec de la conversion des courbes ASM en interfaces de courbes NURBS T-Spline
it_it: Impossibile convertire le curve ASM in interfacce delle curve NURBS T-Spline
pl_pl: Nie można przekonwertować krzywych ASM na interfejsy krzywych NURBS T-splajn
pt_br: Falha ao converter as curvas ASM em interfaces de curvas NURBS da T-Spline
ru_ru: Не удалось преобразовать кривые ASM в интерфейсы Т-сплайновых NURBS-кривых

source: Failed to construct poly-curve interfaces from the T-Spline NURBS curve interfaces
cs_cz: Nepodařilo se vytvořit rozhraní s více křivkami z rozhraní křivek T-Spline NURBS
es_es: No se han podido convertir las interfaces de PolyCurve en interfaces de curva NURBS de T-Spline.
fr_fr: Échec de la construction des interfaces de PolyCurves à partir des interfaces de courbes NURBS T-Spline
it_it: Impossibile costruire interfacce policurva da interfacce delle curve NURBS T-Spline
pl_pl: Nie można skonstruować interfejsów PolyCurve z interfejsów krzywych NURBS T-splajn
pt_br: Falha ao criar interfaces de policurvas com base nas interfaces de curvas NURBS da T-Spline
ru_ru: Не удалось построить интерфейсы с несколькими кривыми из интерфейсов Т-сплайновых NURBS-кривых

source: Failed to set a propagation width
cs_cz: Nepodařilo se nastavit šířku rozšíření.
es_es: No se ha podido establecer la anchura de propagación.
fr_fr: Echec de la définition de la largeur de propagation
it_it: Impossibile impostare una larghezza di propagazione
pl_pl: Nie można ustawić szerokości propagacji
pt_br: Falha ao definir a largura de propagação
ru_ru: Не удалось задать ширину распространения

source: Unknown contituity
cs_cz: Neznámá spojitost
es_es: Continuidad desconocida
fr_fr: Continuité inconnue
it_it: Continuità sconosciuta
pl_pl: Nieznana ciągłość
pt_br: Continuidade desconhecida
ru_ru: Неизвестная непрерывность

source: Failed to add a constraint for the match
cs_cz: Nepodařilo se přidat vazbu do porovnání
es_es: No se ha podido añadir una restricción para la coincidencia.
fr_fr: Échec de l'ajout d'une contrainte pour la correspondance
it_it: Impossibile aggiungere un vincolo per la corrispondenza
pl_pl: Nie można dodać ograniczenia dla dopasowania
pt_br: Falha ao adicionar uma restrição para a correspondência
ru_ru: Не удалось добавить зависимость для соответствия

source: Failed to scale the derivatives for continuity for the given constraint
cs_cz: Nepodařilo se změnit měřítko derivací pro spojitost s danou vazbou
es_es: No se ha podido ajustar la escala de las derivadas para la continuidad de la restricción especificada.
fr_fr: Échec de la mise à l'échelle des dérivés pour la continuité de la contrainte spécifiée
it_it: Impossibile mette in scala le derivate per continuità per il vincolo specificato
pl_pl: Nie można skalować pochodnych dla ciągłości dla danego ograniczenia
pt_br: Falha ao escalar os derivados para obter a continuidade de uma determinada restrição
ru_ru: Не удалось масштабировать производные для непрерывности заданной зависимости

source: Failed to flip the constraint orientation
cs_cz: Nepodařilo se obrátit orientaci vazby
es_es: No se ha podido invertir la orientación de la restricción.
fr_fr: Impossible d'inverser l'orientation de la contrainte
it_it: Impossibile invertire l'operazione del vincolo
pl_pl: Nie można obrócić orientacji ograniczenia
pt_br: Falha ao inverter a orientação da restrição
ru_ru: Не удалось обратить ориентацию зависимости

source: Failed to perform the match
cs_cz: Nepodařilo se provést porovnání
es_es: No se ha podido realizar la coincidencia.
fr_fr: Échec de la mise en correspondance
it_it: Impossibile eseguire la corrispondenza
pl_pl: Nie można wykonać dopasowania
pt_br: Falha durante a execução da correspondência
ru_ru: Не удалось выполнить сопоставление

source: T-Spline Surface requires spans to be greater or equal to 1
cs_cz: Povrch T-Spline vyžaduje, aby rozpětí byla větší než nebo rovna 1
es_es: La superficie de T-Spline requiere que los tramos sean mayores o iguales que 1.
fr_fr: La surface T-Spline requiert des travées supérieures ou égales à 1
it_it: La superficie T-Spline richiede che le campate siano maggiori di o uguali a 1
pl_pl: Powierzchnia T-splajn wymaga rozpiętości większych lub równych 1
pt_br: A superfície da T-Spline requer que os vãos sejam maiores ou iguais a 1
ru_ru: Пролеты поверхности Т-сплайна должны быть больше или равны 1

source: Failed to extrude TSpline edges
cs_cz: Nepodařilo se vysunout hrany T-spline
es_es: No se pudo extruir aristas de T-Spline
fr_fr: Échec de l'extrusion des arêtes T-Spline
it_it: Impossibile estrudere i bordi T-Spline
pl_pl: Nie można wyciągnąć krawędzi T-splajn
pt_br: Falha durante a extrusão das arestas da T-Spline
ru_ru: Не удалось выполнить выдавливание ребер Т-сплайна

source: Failed to extrude TSpline faces
cs_cz: Nepodařilo se vysunout plochy T-spline
es_es: No se pudo extruir caras de T-Spline
fr_fr: Échec de l'extrusion des faces T-Spline
it_it: Impossibile estrudere le facce T-Spline
pl_pl: Nie można wyciągnąć powierzchni T-splajn
pt_br: Falha durante a extrusão das faces de TSpline
ru_ru: Не удалось выполнить выдавливание граней Т-сплайна

source: Subdivision failed.
cs_cz: Dělení se nezdařilo.
es_es: Error de subdivisión.
fr_fr: Échec de la subdivision.
it_it: Suddivisione non riuscita.
pl_pl: Podpodział nie powiódł się.
pt_br: Falha na subdivisão.
ru_ru: Не удалось разбить.

source: Unable to build body from T-Spline
cs_cz: Nelze postavit těleso z křivky T-Spline
es_es: No se puede crear un cuerpo a partir de T-Spline.
fr_fr: Impossible de créer le corps à partir de la T-Spline
it_it: Impossibile creare il corpo dalla T-Spline
pl_pl: Nie można utworzyć bryły z T-splajn
pt_br: Não é possível criar o corpo com base na T-Spline
ru_ru: Невозможно создать тело на основе Т-сплайна

source: Unable to repair Tspline
cs_cz: Nelze opravit Tspline
es_es: No se puede reparar la Tspline.
fr_fr: Impossible de réparer le Tspline
it_it: Impossibile riparare la Tspline
pl_pl: Nie można naprawić T-splajnu
pt_br: Não é possível reparar a Tspline
ru_ru: Не удалось восстановить T-сплайн

source: Ouptut t-spline is invalid.
cs_cz: Výstupní křivka T-Spline není platná.
es_es: La T-Spline de salida no es válida.
fr_fr: T-Spline de sortie non valide.
it_it: La T-Spline di output non è valida.
pl_pl: Wyjściowy T-splajn jest nieprawidłowy.
pt_br: A T-Spline de saída é inválida.
ru_ru: Недопустимый выходной Т-сплайн

source: Point list should contain 4 points.
cs_cz: Seznam bodů by měl obsahovat 4 body.
es_es: La lista de puntos debe contener 4 puntos.
fr_fr: La liste de points doit contenir 4 points.
it_it: L'elenco di punti deve contenere 4 punti.
pl_pl: Lista punktów powinna zawierać 4 punkty.
pt_br: A lista de pontos deve conter 4 pontos.
ru_ru: Список точек должен содержать 4 точки.

source: Failed to build Sphere by four points.
cs_cz: Nepodařilo se vytvořit kouli pomocí čtyř bodů.
es_es: No se pudo generar esfera por cuatro puntos.
fr_fr: Impossible de créer une sphère à l'aide de quatre points.
it_it: Creazione di una sfera mediante quattro punti non riuscita.
pl_pl: Nie można utworzyć kuli przez cztery punkty.
pt_br: Falha ao criar a esfera por meio de quatro pontos.
ru_ru: Не удалось создать сферу по четырем точкам.

source: Point list should contain more than 3 points.
cs_cz: Seznam bodů by měl obsahovat více než 3 body.
es_es: La lista de puntos debe contener más de 3 puntos.
fr_fr: La liste de points doit contenir plus de trois points.
it_it: L'elenco di punti deve contenere più di 3 punti.
pl_pl: Lista punktów powinna zawierać więcej niż 3 punkty.
pt_br: A lista de pontos deve conter mais de 3 pontos.
ru_ru: Список точек должен содержать более 3 точек.

source: Failed to fit T-Spline Sphere.
cs_cz: Nepodařilo se usadit kouli T-spline.
es_es: No se pudo ajustar esfera de T-Spline.
fr_fr: Échec de l'ajustement de la sphère T-Spline.
it_it: Impossibile adattare una sfera T-Spline.
pl_pl: Nie można dopasować kuli T-splajn.
pt_br: Falha durante o ajuste da esfera da T-Spline.
ru_ru: Не удалось вписать Т-сплайновую сферу.

source: Each span should be greater than or equal to 1
cs_cz: Každé rozpětí by mělo být větší nebo rovno 1
es_es: Cada tramo debe ser superior o igual a 1.
fr_fr: Chaque travée doit être supérieure ou égale à 1
it_it: Ciascuna campata deve essere maggiore di o uguale a 1
pl_pl: Poszczególne rozpiętości powinny być większe niż lub równe 1
pt_br: Todos os vãos devem ser maiores ou iguais a 1
ru_ru: Все пролеты должны быть больше или равны 1

source: Each span should be less than or equal to 256
cs_cz: Každé rozpětí by mělo být menší nebo rovno 256
es_es: Cada tramo debe ser inferior o igual a 256.
fr_fr: Chaque travée doit être inférieure ou égale à 256
it_it: Ciascuna campata deve essere minore di o uguale a 256
pl_pl: Poszczególne rozpiętości powinny być mniejsze niż lub równe 256
pt_br: Todos os vãos devem ser menores ou iguais a 256
ru_ru: Все пролеты должны быть меньше или равны 256

source: X spans should be greater than or equal to 2 if X axis symmetry is selected
cs_cz: Pokud je vybrána symetrie osy X, rozpětí X musí být větší než nebo rovna 2
es_es: Los tramos de X deben ser mayores o iguales que 2 si se selecciona la simetría de eje X.
fr_fr: Les travées de l'axe X doivent être supérieures ou égales à 2 si la symétrie de l'axe X est sélectionnée
it_it: Le campate X devono essere maggiori di o uguali a 2 se è selezionato l'asse di simmetria X
pl_pl: Rozpiętości X powinny być większe lub równe 2, jeśli wybrano symetrię względem osi X
pt_br: Os vãos X deverão ser maiores ou iguais a 2 se a simetria do eixo X estiver selecionada
ru_ru: Если выбрана симметрия по оси X, пролеты по оси X должны быть больше или равны 2

source: Y spans should be greater than or equal to 2 if Y axis symmetry is selected
cs_cz: Pokud je vybrána symetrie osy Y, rozpětí Y musí být větší než nebo rovna 2
es_es: Los tramos de Y deben ser mayores o iguales que 2 si se selecciona la simetría de eje Y.
fr_fr: Les travées de l'axe Y doivent être supérieures ou égales à 2 si la symétrie de l'axe Y est sélectionnée
it_it: Le campate Y devono essere maggiori di o uguali a 2 se è selezionato l'asse di simmetria Y
pl_pl: Rozpiętości Y powinny być większe lub równe 2, jeśli wybrano symetrię względem osi Y
pt_br: Os vãos Y deverão ser maiores ou iguais a 2 se a simetria do eixo Y estiver selecionada
ru_ru: Если выбрана симметрия по оси Y, пролеты по оси Y должны быть больше или равны 2

source: Plane has invalid normal
cs_cz: Rovina nemá platnou normálu
es_es: El plano tiene una normal no válida.
fr_fr: La normale du plan est incorrecte
it_it: La normale del piano non è valida
pl_pl: Płaszczyzna ma niepoprawną normalną
pt_br: O plano tem uma normal inválida
ru_ru: Для плоскости задана недопустимая нормаль

source: X or Y coordinates of corners are coincedent
cs_cz: Souřadnice X nebo Y rohů jsou totožné
es_es: Las coordenadas de X o Y de las esquinas son coincidentes.
fr_fr: Les coordonnées X ou Y des angles coïncident
it_it: Le coordinate X o Y degli angoli sono coincidenti
pl_pl: Współrzędne X lub Y narożników są wspólne
pt_br: As coordenadas X ou Y dos cantos são coincidentes
ru_ru: Координаты углов по оси X или Y совпадают

source: T-Spline Surface Plane creation failed
cs_cz: Nepodařilo se vytvořit rovinu povrchu T-spline
es_es: No se pudo crear plano de superficie de T-Spline
fr_fr: Échec de la création du plan de la surface T-Spline
it_it: Creazione piano superficie T-Spline non riuscita
pl_pl: Nie można utworzyć płaskiej powierzchni T-splajn
pt_br: Falha na criação do plano da superfície T-Spline
ru_ru: Не удалось создать плоскость Т-сплайновой поверхности

source: Radius should be greater than or equal to 1e-3
cs_cz: Poloměr by měl být větší nebo roven 1e-3
es_es: El valor de radio debe ser superior o igual a 1e-3.
fr_fr: Le rayon doit être supérieur ou égal à 1e-3
it_it: Il raggio deve essere maggiore di o uguale a 1e-3
pl_pl: Promień powinien być większy niż lub równy 1e-3
pt_br: O raio deve ser maior ou igual a 1e-3
ru_ru: Радиус должен быть больше или равен 1e-3

source: Radius should be less than or equal to 1e8
cs_cz: Poloměr by měl být menší nebo roven 1e8
es_es: El valor de radio debe ser inferior o igual a 1e8.
fr_fr: Le rayon doit être inférieur ou égal à 1e8
it_it: Il raggio deve essere minore di o uguale a 1e8
pl_pl: Promień powinien być mniejszy niż lub równy 1e8
pt_br: O raio deve ser menor ou igual a 1e8
ru_ru: Радиус должен быть меньше или равен 1e8

source: Height should be greater than or equal to 1e-3
cs_cz: Výška by měla být větší nebo rovna 1e-3.
es_es: El valor de altura debe ser superior o igual a 1e-3
fr_fr: La hauteur doit être supérieure ou égale à 1e-3
it_it: L'altezza deve essere maggiore di o uguale a 1e-3
pl_pl: Wysokość powinna być większa niż lub równa 1e-3
pt_br: A altura deve ser maior ou igual a 1e-3
ru_ru: Высота должна быть больше или равна 1e-3

source: Height should be less than or equal to 1e8
cs_cz: Výška by měla být menší nebo rovna 1e8.
es_es: El valor de altura debe ser inferior o igual a 1e8.
fr_fr: La hauteur doit être inférieure ou égale à 1e8
it_it: L'altezza deve essere minore di o uguale a 1e8
pl_pl: Wysokość powinna być mniejsza niż lub równa 1e8
pt_br: A altura deve ser menor ou igual a 1e8
ru_ru: Высота должна быть меньше или равна 1e8

source: Height spans should be greater or equal to 1
cs_cz: Rozpětí výšek by měla být větší než nebo rovna 1
es_es: Los tramos de altura deben ser mayores o iguales que 1.
fr_fr: Les travées de hauteur doivent être supérieures ou égales à 1
it_it: Le campate in altezza devono essere maggiori di o uguali a 1
pl_pl: Rozpiętości wysokości powinny być większe lub równe 1
pt_br: Os vãos na altura devem ser maiores ou iguais a 1
ru_ru: Пролеты по высоте должны быть больше или равны 1

source: Coordinate system has zero axis
cs_cz: Souřadnicový systém obsahuje nulovou osu
es_es: El sistema de coordenadas no tiene ningún eje.
fr_fr: Le système de coordonnées a un axe nul
it_it: Il sistema di coordinate non presenta assi
pl_pl: Układ współrzędnych ma oś zerową
pt_br: O sistema de coordenadas tem eixo igual a zero
ru_ru: В системе координат отсутствуют оси

source: Height spans should be greater than or equal to 2 when Z symmetry is selected
cs_cz: Když je vybrána symetrie Z, rozpětí výšek musí být větší než nebo rovna 2
es_es: Los tramos de altura deben ser mayores o iguales a 2 si se selecciona la simetría de Z.
fr_fr: Les travées de hauteur doivent être supérieures ou égales à 2 lorsqu'une symétrie d'axe Z est sélectionnée
it_it: Le campate in altezza devono essere maggiori di o uguali a 2 quando è selezionata la simmetria Z
pl_pl: Rozpiętości wysokości powinny być większe lub równe 2, gdy wybrano symetrię Z
pt_br: Os vãos da altura deverão ser maiores ou iguais a 2 quando a simetria Z estiver selecionada
ru_ru: Если выбрана симметрия по оси Z, пролеты по высоте должны быть больше или равны 2

source: Radius spans should be less than or equal to 256 when radial symmetry is not selected
cs_cz: Pokud není vybrána radiální symetrie, rozpětí poloměrů by měla být menší nebo rovna 256
es_es: Los tramos de radio deben ser inferiores o iguales a 256 si no se ha seleccionado la simetría radial.
fr_fr: Les travées de rayon doivent être inférieures ou égales à 256 lorsque la symétrie radiale n'est pas sélectionnée
it_it: Le campate nel raggio devono essere minori di o uguali a 256 quando non è selezionata la simmetria radiale
pl_pl: Rozpiętości promieni powinny być mniejsze niż lub równe 256, gdy nie wybrano symetrii promieniowej
pt_br: Os vãos do raio deverão ser menores ou iguais a 256 quando a simetria radial não estiver selecionada
ru_ru: Если не выбрана радиальная симметрия, количество пролетов в радиусе должно быть меньше или равно 256

source: Height spans should be less than or equal to 256 when radial symmetry is not selected
cs_cz: Pokud není vybrána radiální symetrie, rozpětí výšek by mělo být menší nebo rovno 256
es_es: Los tramos de altura deben ser inferiores o iguales a 256 si no se ha seleccionado la simetría radial.
fr_fr: Les travées de hauteur doivent être inférieures ou égales à 256 lorsque la symétrie radiale n'est pas sélectionnée
it_it: Le campate in altezza devono essere minori di o uguali a 256 quando non è selezionata la simmetria radiale
pl_pl: Rozpiętości wysokości powinny być mniejsze niż lub równe 256, gdy nie wybrano symetrii promieniowej
pt_br: Os vãos da altura deverão ser menores ou iguais a 256 quando a simetria radial não estiver selecionada
ru_ru: Если не выбрана радиальная симметрия, количество пролетов по высоте должно быть меньше или равно 256

source: Radius spans should be less than or equal to 64 when radial symmetry is selected
cs_cz: Pokud je vybrána radiální symetrie, rozpětí poloměrů by měla být menší nebo rovna 64
es_es: Los tramos de radio deben ser inferiores o iguales a 64 si se ha seleccionado la simetría radial.
fr_fr: Les travées de rayon doivent être inférieures ou égales à 64 lorsque la symétrie radiale est sélectionnée
it_it: Le campate nel raggio devono essere minori di o uguali a 64 quando è selezionata la simmetria radiale
pl_pl: Rozpiętości promieni powinny być mniejsze niż lub równe 64, gdy wybrano symetrię promieniową
pt_br: Os vãos do raio deverão ser menores ou iguais a 64 quando a simetria radial estiver selecionada
ru_ru: Если выбрана радиальная симметрия, количество пролетов в радиусе должно быть меньше или равно 64

source: Height spans should be less than or equal to 64 when radial symmetry is selected
cs_cz: Pokud je vybrána radiální symetrie, rozpětí výšek by měla být menší nebo rovna 64
es_es: Los tramos de altura deben ser inferiores o iguales a 64 si se ha seleccionado la simetría radial.
fr_fr: Les travées de hauteur doivent être inférieures ou égales à 64 lorsque la symétrie radiale est sélectionnée
it_it: Le campate in altezza devono essere minori di o uguali a 64 quando è selezionata la simmetria radiale
pl_pl: Rozpiętości wysokości powinny być mniejsze niż lub równe 64, gdy wybrano symetrię promieniową
pt_br: Os vãos da altura deverão ser menores ou iguais a 64 quando a simetria radial estiver selecionada
ru_ru: Если выбрана радиальная симметрия, количество пролетов по высоте должно быть меньше или равно 64

source: Faces per span must be less than or equal to 16 when radial symmetry is selected
cs_cz: Pokud je vybrána radiální symetrie, počet ploch na rozpětí musí být menší nebo roven 16
es_es: Las caras por tramo deben ser inferiores o iguales a 16 si se ha seleccionado la simetría radial.
fr_fr: Le nombre de faces par travée doit être inférieur ou égal à 16 lorsque la symétrie radiale est sélectionnée
it_it: Le facce per campata devono essere minori di o uguali a 16 quando è selezionata la simmetria radiale
pl_pl: Liczba powierzchni na rozpiętość powinna być mniejsza niż lub równa 16, gdy wybrano symetrię promieniową
pt_br: As faces por vão deverão ser menores ou iguais a 16 quando a simetria radial estiver selecionada
ru_ru: Если выбрана радиальная симметрия, количество граней в пролете должно быть меньше или равно 16

source: T-Spline Surface Cylinder creation failed
cs_cz: Nepodařilo se vytvořit válec povrchu T-spline
es_es: Error en la creación del cilindro de superficie de T-Spline.
fr_fr: Échec de la création du cylindre de la surface T-Spline
it_it: Creazione cilindro superficie T-Spline non riuscita
pl_pl: Nie można utworzyć walca powierzchni T-splajn
pt_br: Falha na criação do cilindro da superfície da T-Spline
ru_ru: Не удалось создать цилиндр Т-сплайновой поверхности

source: Both radii cannot be zero
cs_cz: Oba poloměry nemohou být rovny nule
es_es: Los dos radios no pueden ser cero.
fr_fr: Les rayons ne peuvent pas être nuls tous les deux
it_it: Entrambi i raggi non possono essere pari a zero
pl_pl: Oba promienie nie mogą być równe zero
pt_br: Nenhum dos raios pode ser zero
ru_ru: Значение обоих радиусов не может быть равно нулю

source: Failed to create cone
cs_cz: Nepodařilo se vytvořit kužel
es_es: No se pudo crear cono
fr_fr: Échec de la création du cône
it_it: Impossibile creare un cono
pl_pl: Nie można utworzyć stożka
pt_br: Falha durante a criação do cone
ru_ru: Не удалось создать конус

source: Height spans should be greater or equal to 2
cs_cz: Rozsahy výšek musí být větší než nebo rovny 2
es_es: Los tramos de altura deben ser mayores o iguales que 2.
fr_fr: Les travées de hauteur doivent être supérieures ou égales à 2
it_it: Le campate in altezza devono essere maggiori di o uguali a 2
pl_pl: Rozpiętości wysokości powinny być większe lub równe 2
pt_br: Os vãos da altura devem ser maiores ou iguais a 2
ru_ru: Пролеты по высоте должны быть больше или равны 2
