Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Cree una PolyCurve mediante la unión de curvas. Voltea la curva según sea necesario para la conectividad. Elija una tolerancia de unión preferida entre 1e-6 y 1e-3 unidades.
curves: Curvas para unir en PolyCurve
joinTolerance: Tolerancia para determinar el tamaño de hueco permitido entre las curvas que se van a unir.
trimCurves: Se establece en "True" (verdadero) si las curvas de entrada se intersecan o se solapan entre sí y es necesario recortar sus segmentos finales antes de la creación de la PolyCurve. Se establece en "False" (falso) por defecto.
trimLength: Si trimLength es superior a 0, no se recortarán los segmentos finales con un valor de longitud superior a trimLength.
Returns: PolyCurve creada por curvas unidas
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Cree una o varias PolyCurves mediante la agrupación de curvas conectadas. Elija una tolerancia de unión preferida entre 1e-6 y 1e-3 unidades.
curves: Curvas que se agruparán para crear una o varias PolyCurves
joinTolerance: Tolerancia para determinar el tamaño de hueco permitido entre las curvas que se van a unir.
trimCurves: Se establece en "True" (verdadero) si las curvas de entrada se intersecan o se solapan entre sí y es necesario recortar sus segmentos finales antes de la creación de la PolyCurve. Se establece en "False" (falso) por defecto.
trimLength: Si trimLength es superior a 0, no se recortarán los segmentos finales con un valor de longitud superior a trimLength.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Cree una o más PolyCurves mediante el desfase de una PolyCurve plana según la distancia especificada en un plano definido por la normal del plano. El argumento de entrada  "planeNormal" se establece por defecto en la normal del plano que contiene la curva, pero se puede proporcionar una normal explícita paralela a la normal de la curva original para controlar mejor la dirección del desfase. Por ejemplo, si se requiere una dirección de desfase coherente para que varias curvas compartan el mismo plano, se puede utilizar el argumento "planeNormal" para modificar normales de curva individuales y forzar el desfase de todas las curvas en la misma dirección. Al invertir la normal, se invierte la dirección del desfase.
signedDistance: Se aplica una distancia de desfase positivo en la dirección del producto vectorial entre la tangente de la PolyCurve y el vector normal del plano, mientras que un desfase negativo se aplica en la dirección opuesta.
extendCircular: Si hay huecos entre las curvas de componente de desfase, en función de los parámetros de cierre de huecos, se pueden rellenar mediante arcos circulares (valor "true" [verdadero]) para proporcionar esquinas suaves o mediante el alargamiento (valor "false" [falso]) de las curvas de desfase.
planeNormal: La normal del plano de la curva. Se establece por defecto en la normal del plano de la curva de entrada.
Returns: Una o más PolyCurves de desfase.

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Repara una PolyCurve autointersecante devolviendo una nueva que no se interseca a sí misma si la longitud del segmento solapado es menor o igual que trimLength.
trimLength: Si trimLength es superior a 0, no se recortarán los segmentos finales con un valor de longitud superior a trimLength.
Returns: Una PolyCurve no autointersecante ni solapada.