Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Obtiene un vector perpendicular a la curva en un parámetro especificado entre StartParameter() y EndParameter(). La curva debe ser plana. La normal resultante será coherente a lo largo de toda la curvatura de la curva.
param: El parámetro en que se debe evaluar
side: Si 'side' se establece en "false" (falso), la normal apuntará al lado derecho de la curva (desplazándose desde el punto inicial hasta el punto final de la curva). Si 'side' es "true" (verdadero), la normal apuntará a la izquierda de la curva.
Returns: Un vector perpendicular a la curva en el parámetro
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Devuelve los puntos espaciados uniformemente a lo largo de la curva con la longitud de segmento especificada desde el punto indicado.
point: El punto de referencia a partir del cual se debe medir
segmentLength: La distancia a lo largo de la curva en que se debe evaluar
Returns: Una lista de puntos de la curva, incluidos el punto especificado y los puntos a lo largo de la dirección de la curva.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Obtiene el parámetro en un punto determinado a lo largo de la curva. Si el punto no está en la curva, ParameterAtPoint seguirá devolviendo un valor que se corresponderá con un punto cercano de la curva, pero el punto no es, en general, el punto más cercano.
point: Un punto a lo largo o cerca de la curva
Returns: El parámetro de la curva para el punto especificado.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Cree una o más curvas mediante el desfase de una curva plana según la distancia especificada en un plano definido por la normal del plano. Si hay huecos entre las curvas de componente de desfase, estas se rellenan mediante la extensión de las curvas de desfase. El argumento de entrada  "planeNormal" se establece por defecto en la normal del plano que contiene la curva, pero se puede proporcionar una normal explícita paralela a la normal de la curva original para controlar mejor la dirección del desfase. Por ejemplo, si se requiere una dirección de desfase coherente para que varias curvas compartan el mismo plano, se puede utilizar el argumento "planeNormal" para modificar normales de curva individuales y forzar el desfase de todas las curvas en la misma dirección. Al invertir la normal, se invierte la dirección del desfase.
signedDistance: Se aplica una distancia de desfase positivo en la dirección del producto vectorial entre la tangente de la curva y el vector normal del plano, mientras que un desfase negativo se aplica en la dirección opuesta.
planeNormal: La normal del plano de la curva. Se establece por defecto en la normal del plano de la curva de entrada.
Returns: Una o más curvas de desfase.
thicken,lines
0.5,0.4