Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
CoordinateSystem de BoundingBox. En un cuadro alineado con el eje, el CS se orienta junto con los ejes X, Y, Z, y se encuentra en el centro del cuadro. En un cuadro no alineado, el CS puede tener una orientación arbitraria y se centra en el centro del cuadro.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obtiene la intersección de dos BoundingBoxes. Nota: Esto no funciona para los cuadros no alineados al eje, ya que es posible que esas intersecciones no den como resultado un cuadro. En su lugar, interseque sus ortoedros correspondientes.
other: Otro cuadro delimitador que intersecar
Returns: Cuadro delimitador obtenido a partir de la intersección de cuadros delimitadores

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determine si dos BoundingBoxes se intersecan. Nota: Esto solo funciona si ambos cuadros delimitadores presentan la misma alineación (transformación). En esos casos, pruebe la intersección entre sus ortoedros correspondientes.
other: Otro cuadro delimitador
Returns: Intersección de los cuadros delimitadores
get overlap