Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Determina si un punto de entrada está incluido en el polígono. Si el polígono no es plano, el punto se proyectará en el plano de ajuste óptimo y la contención se calculará mediante la proyección del polígono en el plano de ajuste óptimo. Esto devolverá un estado de error si el polígono se interseca a sí mismo.