Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Recorta la superficie con una colección de una o más PolyCurves cerradas. Uno de los bucles debe ser el bucle de contorno de la superficie de entrada. Además, se deben añadir uno o más bucles interiores para los agujeros.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Recorta la superficie con una colección de una o más PolyCurves cerradas que deben encontrarse en la superficie dentro de la tolerancia especificada. Si es necesario recortar uno o más agujeros en la superficie de entrada, se debe especificar un bucle exterior para el contorno de la superficie y un bucle interior para cada agujero. Si es necesario recortar la región entre el contorno de la superficie y los agujeros, solo debe proporcionarse el bucle para cada agujero. En una superficie periódica sin bucle exterior, como una superficie esférica, la región recortada se puede controlar mediante la inversión de la dirección de la curva de bucle.
loops: Una o más PolyCurves cerradas que pueden estar en cualquier orden en la entrada. Estos bucles no deben intersecarse entre sí.
tolerance: La tolerancia utilizada para decidir si los extremos de la curva son coincidentes, y si una curva y una superficie son coincidentes. La tolerancia proporcionada no puede ser inferior a ninguna de las tolerancias utilizadas durante la creación de las PolyCurves de entrada. El valor por defecto 0.0 indica que se usará la tolerancia más grande utilizada durante la creación de las PolyCurves de entrada.
Returns: Una superficie recortada por bucles cerrados.
trim multiple,removeloops,cutloops