Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Créer une PolyCurve en joignant les courbes. Inverse la courbe selon les besoins pour la connectivité. Choisissez une tolérance de jonction entre 1e-6 et 1e-3.
curves: Courbes à joindre pour former la polycurve
joinTolerance: Tolérance pour déterminer la taille de l'écart autorisé entre les courbes à joindre
trimCurves: Définissez cette option sur True si les courbes d'entrée se croisent ou se chevauchent et que leurs segments finaux doivent être ajustés avant la création de la polycourbe. Elle est définie sur False par défaut.
trimLength: Si la valeur de trimLength est supérieure à 0, les segments finaux plus longs que la valeur de trimLength ne sont pas ajustés.
Returns: Polycourbe créée par des courbes jointes
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Créez une ou plusieurs polycourbes en regroupant les courbes connectées. Choisissez une tolérance de jonction préférée entre 1e-6 et 1e-3.
curves: Courbes à regrouper pour créer une ou plusieurs polycourbes
joinTolerance: Tolérance pour déterminer la taille de l'écart autorisé entre les courbes à joindre
trimCurves: Définissez cette option sur True si les courbes d'entrée se croisent ou se chevauchent et que leurs segments finaux doivent être ajustés avant la création de la polycourbe. Elle est définie sur False par défaut.
trimLength: Si la valeur de trimLength est supérieure à 0, les segments finaux plus longs que la valeur de trimLength ne sont pas ajustés.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Créer une ou plusieurs polycourbes en décalant une polycourbe plane d'une distance donnée dans un plan défini par la normale du plan. L'argument d'entrée "planeNormal" est défini par défaut sur la normale du plan contenant la courbe, mais une normale explicite parallèle à la normale de la courbe d'origine peut être fournie pour mieux contrôler la direction du décalage. Par exemple, si une direction de décalage cohérente est requise pour plusieurs courbes partageant le même plan, le plan "Normal" peut être utilisé pour remplacer des normales de courbe individuelles et forcer le décalage de toutes les courbes dans la même direction. L'inversion de la normale inverse la direction du décalage.
signedDistance: Une distance de décalage positive s'applique dans la direction du produit vectoriel entre la tangente de la polycourbe et le vecteur normal du plan, tandis qu'un décalage négatif s'applique dans la direction opposée.
extendCircular: S'il existe des espaces entre les courbes de composant de décalage, selon les paramètres de fermeture des espaces, ils peuvent être remplis par des arcs circulaires (valeur true) pour donner des coins lisses ou par l'extension (valeur false) des courbes de décalage.
planeNormal: La normale du plan de la courbe's. La valeur par défaut est la normale du plan de la courbe's
Returns: Une ou plusieurs polycourbes décalées

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Corrige une polycourbe auto-sécante en renvoyant une nouvelle polycourbe qui n'est pas auto-sécante si la longueur du segment de chevauchement est inférieure ou égale à la valeur de l'option Length.
trimLength: Si la valeur de trimLength est supérieure à 0, les segments finaux plus longs que la valeur de trimLength ne sont pas ajustés.
Returns: Polycourbe non auto-sécante, non-superposée