Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Renvoie si un point d'entrée est contenu dans le polygone. Si le polygone n'est pas plat, le point est projeté sur le plan ajusté au mieux et le confinement est calculé à l'aide de la projection du polygone sur le plan ajusté au mieux. Cela renvoie un état d'échec si le polygone s'entrecoupe.