Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
Outil de suivi de coordonnées de la zone de contour. Pour une zone alignée sur l'axe, le système de coordonnées est orienté avec les axes X, Y et Z, et est situé au centre de la zone. Pour une zone non alignée, le système de coordonnées peut avoir une orientation arbitraire et est centré dans la zone.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obtenez l'intersection de deux zones de contour. Remarque : cette option ne fonctionne pas pour les zones non alignées sur l'axe, car ces intersections risquent de ne pas créer de zone. Croisez plutôt leurs cuboïdes correspondants.
other: Autre zone de délimitation à entrecouper
Returns: Zone de délimitation obtenue à partir de l'intersection de zones de délimitation

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Déterminez si deux zones de contour se croisent. Remarque : cette option fonctionne uniquement si les deux zones de contour ont le même alignement (transformation). Dans ce cas, testez l'intersection entre leurs cuboïdes correspondants.
other: Autre zone de délimitation
Returns: Les zones de délimitation s'entrecoupent-elle?
get overlap