Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Obtenez un vecteur perpendiculaire à la courbe selon un paramètre spécifié entre StartParameter() et EndParameter() La courbe doit être plane. La normale résultante sera cohérente sur toute la courbure de la courbe.
param: Le paramètre d'évaluation
side: Si 'side' est défini sur false, la normale pointe vers le côté droit de la courbe (en se déplaçant du point de départ vers l'extrémité de la courbe). Si 'side' est défini sur true, la normale pointe vers la gauche de la courbe.
Returns: Un vecteur perpendiculaire à la courbe au niveau du paramètre
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Renvoie des points espacés régulièrement le long de la courbe à une longueur de segment donnée à partir du point donné
point: Le point de référence à partir duquel mesurer
segmentLength: La distance le long de la courbe sur laquelle effectuer l'évaluation
Returns: Liste de points sur la courbe comprenant le point donné et le long de la direction de la courbe.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Obtenez le paramètre à un point donné le long de la courbe. Si le point n'est pas sur la courbe, ParameterAtPoint renverra quand même une valeur qui correspondra à un point proche sur la courbe, mais le point n'est généralement pas le point le plus proche.
point: Un point le long ou à proximité de la courbe
Returns: Le paramètre sur la courbe pour le point donné.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Créez une ou plusieurs courbes en décalant une courbe plane d'une distance donnée dans un plan défini par la normale du plan. S'il existe des espaces entre les courbes composantes de décalage, ils sont remplis en prolongeant les courbes de décalage. L'argument d'entrée "planeNormal" est défini par défaut sur la normale du plan contenant la courbe, mais une normale explicite parallèle à la normale de la courbe d'origine peut être fournie pour mieux contrôler la direction du décalage. Par exemple, si une direction de décalage cohérente est requise pour plusieurs courbes partageant le même plan, le plan "planeNormal" peut être utilisé pour remplacer les normales de courbe individuelles et forcer toutes les courbes à être décalées dans la même direction. L'inversion de la normale inverse la direction du décalage.
signedDistance: Une distance de décalage positive s'applique dans la direction du produit vectoriel entre la tangente de la courbe et le vecteur normal du plan, tandis qu'un décalage négatif s'applique dans la direction opposée.
planeNormal: La normale du plan de la courbe's. La valeur par défaut est la normale du plan de la courbe's.
Returns: Une ou plusieurs courbes décalées
thicken,lines
0.5,0.4