Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Ajuste la surface avec une collection d'une ou plusieurs polycourbes fermées. L'une des boucles doit être la boucle de limite de la surface d'entrée. En outre, une ou plusieurs boucles internes doivent être ajoutées pour les trous.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Ajuste la surface avec un ensemble d'une ou plusieurs polycourbes fermées qui doivent toutes se trouver sur la surface dans la tolérance spécifiée. Si un ou plusieurs trous doivent être ajustés à partir de la surface d'entrée, il doit y avoir une boucle externe spécifiée pour la frontière de la surface et une boucle interne pour chaque trou. Si la région entre la frontière de surface et le(s) trou(s) doit être ajustée, seule la boucle pour chaque trou doit être fournie. Pour une surface périodique sans boucle externe telle qu'une surface sphérique, la région relimitée peut être contrôlée en inversant la direction de la courbe de boucle.
loops: Une ou plusieurs polycourbes fermées pouvant être dans n'importe quel ordre dans l'entrée. Ces boucles ne doivent pas se croiser.
tolerance: Tolérance utilisée pour décider si les extrémités de la courbe sont coïncidentes et si une courbe et une surface sont coïncidentes. La tolérance fournie ne peut pas être plus petite que les tolérances utilisées dans la création des polycourbes d'entrée. La valeur par défaut de 0,0 signifie que la tolérance la plus grande utilisée dans la création des polycourbes d'entrée sera utilisée.
Returns: Surface ajustée par des boucles fermées.
trim multiple,removeloops,cutloops