Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Retorna se um ponto de entrada está contido dentro do polígono. Se o polígono não for plano, o ponto será projetado no plano de melhor ajuste e a contenção será calculada usando a projeção do polígono no plano de melhor ajuste. Isso retornará um status de falha se o polígono fizer autointerseção.