Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Obtenha um vetor perpendicular à curva em um parâmetro especificado entre StartParameter() e EndParameter(). A curva deve ser plana. A normal resultante será consistente em toda a curvatura da curva.
param: O parâmetro no qual avaliar
side: Se “lado” estiver definido como false, a normal apontará para o lado direito da curva (movendo-se do ponto inicial para o ponto final da curva). Se “lado” como true, a normal apontará para a esquerda da curva.
Returns: Um vetor perpendicular à curva no parâmetro
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Retorna pontos espaçados igualmente ao longo da curva em um determinado comprimento de segmento com base no ponto especificado
point: O ponto de referência a partir de onde medir
segmentLength: A distância ao longo da curva na qual avaliar
Returns: Lista de pontos na curva, incluindo o ponto especificado e ao longo da direção da curva.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Obtenha o parâmetro num ponto especificado ao longo da curva. Se o ponto não estiver na curva, ParameterAtPoint ainda retornará um valor que corresponde a um ponto próximo da curva, mas, em geral, não será o ponto mais próximo.
point: Um ponto ao longo da curva ou perto dela
Returns: O parâmetro na curva para o ponto especificado.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Crie uma ou mais curvas deslocando uma curva plana pela distância fornecida em um plano definido pela normal do plano. Se houver intervalos entre as curvas do componente deslocado, eles serão preenchidos ao estender as curvas de deslocamento. O argumento de entrada “planeNormal” define como padrão a normal do plano que contém a curva, mas uma normal explícita paralela à normal da curva original pode ser fornecida para controlar melhor a direção do deslocamento. Por exemplo, se uma direção de deslocamento consistente for necessária para várias curvas que usam o mesmo plano, será possível usar “planeNormal” para substituir normais de curvas individuais e forçar todas as curvas a serem deslocadas na mesma direção. Inverter a normal reverte a direção do deslocamento.
signedDistance: Uma distância de deslocamento positivo se aplica na direção do produto transversal entre a tangente da curva e o vetor normal do plano, enquanto um deslocamento negativo se aplica na direção oposta.
planeNormal: A normal do plano da curva. Define como padrão a normal do plano da curva de entrada
Returns: Uma ou mais curvas de deslocamento
thicken,lines
0.5,0.4