Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
O CoordinateSystem da BoundingBox.             Para uma caixa alinhada com o eixo, o CS é orientado ao longo dos eixos X, Y, Z e está localizado no centro da caixa.             Para uma caixa não alinhada, o CS pode ter uma orientação arbitrária e está centralizado no centro da caixa.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Obtenha a interseção de duas BoundingBoxes. Observação: Isso não funciona para caixas não alinhadas com o eixo, pois essas interseções podem não resultar em uma caixa. Faça a interseção com os cuboides correspondentes.
other: Outra caixa delimitadora para interseção
Returns: Caixa delimitadora obtida da interseção de caixas delimitadoras

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determine se duas BoundingBoxes fazem interseção. Observação: Isso funciona somente se ambas as caixas delimitadoras tiverem o mesmo alinhamento (transformação). Nesses casos, teste a interseção entre os cuboides correspondentes.
other: Outra caixa delimitadora
Returns: Fazer interseção de caixas delimitadoras
get overlap