Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Crie a PolyCurve unindo curvas. Inverte a curva conforme necessário para a conectividade. Escolha uma tolerância de união preferencial entre as unidades 1e-6 e 1e-3.
curves: Curvas a unir na PolyCurve
joinTolerance: Tolerância para determinar o tamanho permitido da lacuna entre curvas a unir
trimCurves: Será definido como True se as curvas de entrada fizerem interseção/sobreposição umas às outras e precisarem que seus segmentos de extremidade sejam aparados antes da criação da PolyCurve. Por padrão, está definido como False.
trimLength: Se trimLength for maior que 0, os segmentos de extremidade maiores que trimLength não serão aparados.
Returns: PolyCurve criada usando curvas unidas
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Crie uma ou mais PolyCurves agrupando curvas conectadas. Escolha uma tolerância de união preferida entre 1e-6 e 1e-3 unidades.
curves: Curvas a agrupar para criar uma ou mais PolyCurves
joinTolerance: Tolerância para determinar o tamanho permitido da lacuna entre curvas a unir
trimCurves: Será definido como True se as curvas de entrada fizerem interseção/sobreposição umas às outras e precisarem que seus segmentos de extremidade sejam aparados antes da criação da PolyCurve. Por padrão, está definido como False.
trimLength: Se trimLength for maior que 0, os segmentos de extremidade maiores que trimLength não serão aparados.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Crie uma ou mais PolyCurves deslocando uma PolyCurve plana pela distância fornecida em um plano definido pela normal do plano. O argumento de entrada “planeNormal” define como padrão a normal do plano que contém a curva, mas uma normal explícita paralela à normal da curva original pode ser fornecida para controlar melhor a direção do deslocamento. Por exemplo, se uma direção de deslocamento consistente for necessária para várias curvas que usam o mesmo plano, será possível usar “planeNormal” para substituir normais de curvas individuais e forçar todas as curvas a serem deslocadas na mesma direção. Inverter a normal reverte a direção do deslocamento.
signedDistance: Uma distância de deslocamento positivo se aplica na direção do produto transversal entre a tangente da PolyCurve e o vetor normal do plano, enquanto um deslocamento negativo se aplica na direção oposta.
extendCircular: Se houver intervalos entre as curvas do componente de deslocamento, dependendo das configurações de fechamento do intervalo, eles poderão ser preenchidos por arcos circulares (valor true) para fornecer cantos suaves ou estendendo as curvas de deslocamento (valor false).
planeNormal: A normal do plano da curva. Define como padrão a normal do plano da curva de entrada
Returns: Uma ou mais PolyCurves deslocadas

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Regenera uma PolyCurve com autointerseção, retornando uma nova PolyCurve que não fará autointerseção se o comprimento do segmento sobreposto for menor ou igual a trimLength.
trimLength: Se trimLength for maior que 0, os segmentos de extremidade maiores que trimLength não serão aparados.
Returns: PolyCurve sem autointerseção e sem sobreposição