Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Apara a superfície com um conjunto de uma ou mais PolyCurves fechadas. Um dos contornos precisa ser o contorno de limite da superfície de entrada. Além disso, um ou mais contornos internos precisam ser adicionados para orifícios.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Apara a superfície com um conjunto de uma ou mais PolyCurves fechadas que devem estar todas na superfície dentro da tolerância especificada. Se um ou mais orifícios precisarem ser aparados na superfície de entrada, deverá haver um contorno externo especificado para o limite da superfície e um contorno interno para cada orifício. Se a região entre o limite da superfície e os orifícios precisar ser aparada, somente deverá ser fornecido o contorno para cada orifício. Para uma superfície periódica sem contorno externo, como uma superfície esférica, a região aparada pode ser controlada invertendo a direção da curva de contorno.
loops: Uma ou mais PolyCurves fechadas que podem estar em qualquer ordem na entrada. Esses contornos não devem fazer interseção entre si.
tolerance: A tolerância usada ao decidir se as extremidades da curva são coincidentes e se uma curva e uma superfície são coincidentes. A tolerância fornecida não pode ser menor do que qualquer uma das tolerâncias usadas na criação das PolyCurves de entrada. O valor padrão de 0,0 significa que a maior tolerância usada na criação das PolyCurves de entrada será usada.
Returns: Superfície aparada por contornos fechados.
trim multiple,removeloops,cutloops