Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Ottiene un vettore perpendicolare alla curva in corrispondenza di un parametro specificato tra StartParameter() e EndParameter(). La curva deve essere piana. La normale risultante sarà coerente nell'intera curvatura della curva.
param: Il parametro in base al quale valutare
side: Se l'opzione 'side' è impostata su False, la normale punterà al lato destro della curva (spostandosi dal punto iniziale al punto finale della curva). Se l'opzione 'side' è True, la normale punterà al lato sinistro della curva.
Returns: Un vettore perpendicolare alla curva in corrispondenza del parametro
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Restituisce punti distanziati in modo uniforme lungo la curva in corrispondenza della lunghezza del segmento specificata dal punto specificato.
point: Il punto di riferimento da cui eseguire la misurazione
segmentLength: La distanza lungo la curva in corrispondenza della quale eseguire la valutazione
Returns: Elenco di punti sulla curva, incluso il punto specificato e lungo la direzione della curva.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Ottiene il parametro in corrispondenza di un punto specificato lungo la curva. Se il punto non si trova sulla curva, ParameterAtPoint restituirà ancora un valore che corrisponderà ad un punto vicino sulla curva, ma il punto non è in generale il punto più vicino.
point: Un punto su o in prossimità della curva
Returns: Il parametro sulla curva per il punto specificato.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Crea una o più curve eseguendo l'offset di una curva piana in base alla distanza specificata in un piano definito dalla normale al piano. Se sono presenti spazi tra le curve del componente di offset, vengono riempiti estendendo le curve di offset. Per default, l'argomento di input "planeNormal" è impostato sulla normale al piano contenente la curva, ma è possibile fornire una normale esplicita parallela alla normale alla curva originale per controllare meglio la direzione dell'offset. Ad esempio, se è richiesta una direzione di offset uniforme per più curve che condividono lo stesso piano, i"planeNormal" può essere utilizzato per sostituire le normali alle singole curve e forzare l'offset di tutte le curve nella stessa direzione. Invertendo la normale, si inverte la direzione dell'offset.
signedDistance: Una distanza di offset positiva si applica nella direzione del prodotto cartesiano tra la tangente alla curva e il vettore normale al piano, mentre un offset negativo si applica nella direzione opposta.
planeNormal: La normale al piano della curva. L'impostazione di default è la normale al piano della curva di input
Returns: Una o più curve di offset
thicken,lines
0.5,0.4