Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Crea una PolyCurve mediante l'unione di curve. Inverte le curve in base alle esigenze di connettività. Scegliere la tolleranza di unione preferita compresa tra le unità 1e-6 e 1e-3.
curves: Le curve da unire in PolyCurve
joinTolerance: La tolleranza per determinare la dimensione di spaziatura consentita tra curve da unire
trimCurves: Impostare su True se le curve di input si intersecano/si sovrappongono e i relativi segmenti finali devono essere tagliati prima della creazione di PolyCurve. L'opzione è impostata su False per default.
trimLength: Se trimLength è maggiore di 0, i segmenti finali più lunghi di trimLength non verranno tagliati.
Returns: PolyCurve create da curve unite
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Crea una o più PolyCurve raggruppando le curve connesse. Scegliere una tolleranza di unione preferita tra le unità 1e-6 e 1e-3.
curves: Curve da raggruppare per creare una o più PolyCurve
joinTolerance: La tolleranza per determinare la dimensione di spaziatura consentita tra curve da unire
trimCurves: Impostare su True se le curve di input si intersecano/si sovrappongono e i relativi segmenti finali devono essere tagliati prima della creazione di PolyCurve. L'opzione è impostata su False per default.
trimLength: Se trimLength è maggiore di 0, i segmenti finali più lunghi di trimLength non verranno tagliati.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Crea una o più PolyCurve eseguendo l'offset di una PolyCurve piana in base alla distanza specificata in un piano definito dalla normale al piano. Per default, l'argomento di input "planeNormal" è impostato sulla normale al piano contenente la curva, ma è possibile fornire una normale esplicita parallela alla normale alla curva originale per controllare meglio la direzione dell'offset. Ad esempio, se è necessaria una direzione di offset uniforme per più curve che condividono lo stesso piano, "planeNormal" può essere utilizzato per sostituire le normali alle singole curve e forzare l'offset di tutte le curve nella stessa direzione. Invertendo la normale, si inverte la direzione dell'offset.
signedDistance: Una distanza di offset positiva si applica nella direzione del prodotto cartesiano tra la tangente alla PolyCurve e il vettore normale al piano, mentre un offset negativo si applica nella direzione opposta.
extendCircular: Se sono presenti spazi tra le curve del componente di offset, a seconda delle impostazioni di chiusura dello spazio, possono essere riempiti da archi circolari (valore True) per fornire angoli levigati o estendendo (valore False) le curve di offset.
planeNormal: La normale al piano della curva. L'impostazione di default è la normale al piano della curva di input
Returns: Una o più PolyCurve di offset

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Corregge una PolyCurve autointersecante restituendone una nuova che non è autointersecante se la lunghezza del segmento sovrapposto è minore di o uguale a trimLength.
trimLength: Se trimLength è maggiore di 0, i segmenti finali più lunghi di trimLength non verranno tagliati.
Returns: PolyCurve non autointersecante e non sovrapposta