Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
CoordinateSystem di BoundingBox.             Per un riquadro allineato all'asse, il CS viene orientato insieme agli assi X, Y e Z e si trova al centro del riquadro.             Per un riquadro non allineato, il CS può avere un orientamento arbitrario ed è centrato al centro del riquadro.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Ottiene l'intersezione di due BoundingBox. Nota: questa operazione non funziona per i riquadri non allineati all'asse, poiché tali intersezioni potrebbero non produrre un riquadro. Interseca invece i cuboidi corrispondenti.
other: Altro riquadro di delimitazione da intersecare
Returns: Riquadro di delimitazione ottenuto dall'intersezione di riquadri di delimitazione

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Determina se due BoundingBox si intersecano. Nota: questa operazione funziona solo se entrambi i riquadri di delimitazione hanno lo stesso allineamento (trasformazione). In questi casi, verificare l'intersezione tra i cuboidi corrispondenti.
other: Altro riquadro di delimitazione
Returns: Lascia intersecare i riquadri di delimitazione
get overlap