Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Restituisce il valore che specifica se un punto di input è contenuto all'interno del poligono. Se il poligono non è piano, il punto verrà proiettato sul piano di adattamento e il contenimento verrà calcolato utilizzando la proiezione del poligono sul piano di adattamento. Se il poligono si autointerseca, verrà restituito uno stato non riuscito.