Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Taglia la superficie con una raccolta di una o più PolyCurve chiuse. Uno dei perimetri chiusi deve essere il perimetro chiuso di contorno della superficie di input. È inoltre necessario aggiungere uno o più perimetri chiusi interni per i fori.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Taglia la superficie con una raccolta di una o più PolyCurve chiuse che devono trovarsi tutte sulla superficie entro la tolleranza specificata. Se uno o più fori devono essere tagliati dalla superficie di input, deve essere specificato un perimetro chiuso esterno per il contorno della superficie e un perimetro chiuso interno per ogni foro. Se la regione tra il contorno della superficie e i fori deve essere tagliata, deve essere fornito solo il perimetro chiuso per ogni foro. Per una superficie periodica senza perimetro chiuso esterno, ad esempio una superficie sferica, la regione tagliata può essere controllata invertendo la direzione della curva del perimetro chiuso.
loops: Una o più PolyCurve chiuse che possono essere in qualsiasi ordine nell'input. Questi perimetri chiusi non devono intersecarsi.
tolerance: Tolleranza utilizzata per stabilire se le estremità della curva sono coincidenti e se una curva e una superficie sono coincidenti. La tolleranza fornita non può essere inferiore ad alcuna delle tolleranze utilizzate nella creazione delle PolyCurve di input. Il valore di default 0.0 indica che verrà utilizzata la tolleranza più grande usata nella creazione delle PolyCurve di input.
Returns: Superficie tagliata da perimetri chiusi.
trim multiple,removeloops,cutloops