Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
使用一个或多个闭合复合线集修剪曲面。其中一个回路需要是输入曲面的边界回路。此外，还需要为孔添加一个或多个内回路。
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
使用一个或多个闭合的复合线集修剪曲面，这些复合线必须全部位于指定公差内的曲面上。如果需要从输入曲面修剪一个或多个孔，则必须为曲面边界指定一个外回路，为每个孔指定一个内回路。如果需要修剪曲面边界和孔之间的区域，则应仅提供每个孔的回路。对于没有外回路的周期曲面(例如，球形曲面)，则可以通过反转回路曲线的方向来控制修剪区域。
loops: 一个或多个闭合复合线，可以按任意顺序输入。这些回路不应彼此相交。
tolerance: 确定曲线端点是否重合以及曲线和曲面是否重合时使用的公差。提供的公差不能小于创建输入复合线时使用的任何公差。默认值 0.0 表示将使用创建输入复合线时使用的最大公差。
Returns: 由闭合回路修剪的曲面。
trim multiple,removeloops,cutloops