Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
边界框的坐标系。对于轴对齐框，坐标系沿 X、Y、Z 轴定向，并位于框的中心。对于未对齐框，坐标系可以有任意方向，并以框的中心为中心。

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
获取两个边界框的交点。注意: 这不适用于非轴对齐框，因为这些交点可能不会生成框。请改为与其对应的长方体相交。
other: 要相交的其他边界框
Returns: 基于边界框的相交获得的边界框

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
确定两个边界框是否相交。注意: 仅当两个边界框有相同的对齐(变换)时，此选项才起作用。在这种情况下，请测试其对应长方体之间的交点。
other: 其他边界框
Returns: 边界框是否相交
get overlap