Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
按 StartParameter() 和 EndParameter() 之间的指定参数获取垂直于曲线的向量。曲线必须是平面的。生成的法线将在曲线的整个曲率上保持一致。
param: 要计算的位置的参数
side: 如果“side”设置为 false，则法线将指向曲线的右侧(从曲线的起点移动到曲线的终点)。如果“side”设置为 true，则法线将指向曲线的左侧。
Returns: 在参数处垂直于曲线的向量
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
返回从给定点开始以给定线段长度沿曲线等距分布的点
point: 参照点(测量起点)
segmentLength: 沿曲线要计算的距离
Returns: 曲线上的点列表，包括给定点和沿曲线方向的点。

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
获取曲线上给定点处的参数。如果该点不在曲线上，则 ParameterAtPoint 仍会返回一个值，该值将与曲线上的邻近点相对应，但该点通常不是最近点。
point: 曲线上或曲线附近的点
Returns: 曲线上给定点的参数。
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
通过在由平面法线定义的平面中将平面曲线偏移给定距离来创建一条或多条曲线。如果偏移分量曲线之间存在间隙，则通过延伸偏移曲线来填充它们。“planeNormal”输入参数默认为包含曲线的平面的法线，但可以提供平行于原始曲线法线的显式法线以更好地控制偏移的方向。例如，如果共享同一平面的多条曲线需要一致的偏移方向，则“planeNormal”可用于替代各个曲线法线并强制所有曲线在同一方向上偏移。反转法线会反转偏移的方向。
signedDistance: 正偏移距离适用于曲线切线和平面法向量之间的叉积方向，而负偏移则适用于相反方向。
planeNormal: 曲线的平面法线。默认为输入曲线的平面法线
Returns: 一条或多条偏移曲线
thicken,lines
0.5,0.4