Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
通过连接曲线生成 PolyCurve。根据需要翻转曲线以供连接。在 1e-6 到 1e-3 单位之间选择首选的连接公差。
curves: 连接到复合线的曲线
joinTolerance: 确定要连接的曲线之间允许的间隙尺寸的公差
trimCurves: 如果输入曲线彼此相交/重叠，并且需要在创建复合线之前修剪掉其末端段，则设置为 True。默认情况下，它设置为 False。
trimLength: 如果 trimLength 大于 0，则不会修剪比 trimLength 长的末端段。
Returns: 由连接曲线创建的复合线
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
通过对连接的曲线进行分组，从而生成一条或多条复合线。选择一个介于 1e-6 和 1e-3 单位之间的首选连接公差。
curves: 分组在一起以创建一条或多条复合线的曲线
joinTolerance: 确定要连接的曲线之间允许的间隙尺寸的公差
trimCurves: 如果输入曲线彼此相交/重叠，并且需要在创建复合线之前修剪掉其末端段，则设置为 True。默认情况下，它设置为 False。
trimLength: 如果 trimLength 大于 0，则不会修剪比 trimLength 长的末端段。

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
通过在由平面法线定义的平面中将平面曲线偏移给定距离来创建一条或多条复合线。“planeNormal”输入参数默认为包含曲线的平面的法线，但可以提供平行于原始曲线法线的显式法线以更好地控制偏移的方向。例如，如果共享同一平面的多条曲线需要一致的偏移方向，则“planeNormal”可用于替代各个曲线法线并强制所有曲线在同一方向上偏移。反转法线会反转偏移的方向。
signedDistance: 正偏移距离适用于复合线切线和平面法向量之间的叉积方向，而负偏移则适用于相反方向。
extendCircular: 如果偏移分量曲线之间存在间隙，则根据间隙闭合设置，可以通过圆弧(true 值)填充它们以提供平滑角点，也可以通过延伸(false 值)偏移曲线来填充它们。
planeNormal: 曲线的平面法线。默认为输入曲线的平面法线
Returns: 一条或多条偏移复合线

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
如果重叠段长度小于或等于 trimLength，则会通过返回非自相交的新复合线来修复自相交的复合线。
trimLength: 如果 trimLength 大于 0，则不会修剪比 trimLength 长的末端段。
Returns: 非自相交、非重叠复合线