Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Vytvořte objekt PolyCurve spojením křivek. Obrátí křivku podle potřeby připojení. Vyberte preferovanou toleranci spojení od 1e-6 do 1e-3 jednotek.
curves: Křivky ke spojení do objektu PolyCurve
joinTolerance: Tolerance, která určuje velikost povolené mezery mezi spojovanými křivkami
trimCurves: Nastavte na hodnotu True, pokud se vstupní křivky protínají nebo překrývají a je nutné oříznout jejich koncové úseky před vytvořením objektu PolyCurve. Ve výchozím nastavení je tato možnost nastavena na hodnotu False.
trimLength: Pokud je hodnota trimLength větší než 0, pak koncové úseky delší než hodnota trimLength nebudou oříznuty.
Returns: Objekt Polycurve vytvořený podle spojených křivek
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Vytvořte jeden nebo více objektů PolyCurve seskupením spojených křivek. Vyberte preferovanou toleranci spojení mezi 1e-6 a 1e-3 jednotkami.
curves: Křivky, které chcete seskupit dohromady, aby se vytvořil jeden nebo více objektů PolyCurve
joinTolerance: Tolerance, která určuje velikost povolené mezery mezi spojovanými křivkami
trimCurves: Nastavte na hodnotu True, pokud se vstupní křivky protínají nebo překrývají a je nutné oříznout jejich koncové úseky před vytvořením objektu PolyCurve. Ve výchozím nastavení je tato možnost nastavena na hodnotu False.
trimLength: Pokud je hodnota trimLength větší než 0, pak koncové úseky delší než hodnota trimLength nebudou oříznuty.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Vytvořte jeden nebo více objektů PolyCurve odsazením rovinného objektu PolyCurve o zadanou vzdálenost v rovině definované normálou roviny. Vstupní argument „planeNormal“ má jako výchozí hodnotu normálu roviny obsahující křivku, je však možné určit explicitní normálu rovnoběžnou s původní normálou křivky za účelem lepšího řízení směru odsazení. Pokud je například požadován konzistentní směr odsazení u více křivek sdílejících stejnou rovinu, je možné pomocí hodnoty „planeNormal“ přepsat jednotlivé normály křivky a vynutit stejný směr odsazení u všech křivek. Obrácení normály obrází směr odsazení.
signedDistance: Kladná vzdálenost odsazení se použije ve směru vektorového součinu vektoru tečny objektu PolyCurve a normálového vektoru roviny, zatímco záporné odsazení se použije v opačném směru.
extendCircular: Pokud mezi odsazenými křivkami komponenty existují mezery, mohou být vyplněny buď kruhovými oblouky (hodnota true), které vytvoří vyhlazené rohy, nebo prodloužením (hodnota false) křivek odsazení.
planeNormal: Normála roviny křivky. Výchozí hodnotou je normála roviny vstupní křivky
Returns: Jeden nebo více odsazených objektů PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Opraví objekt PolyCurve, který protíná sám sebe, vrácením nového objektu, který neprotíná sám sebe, pokud je délka překrývajícího úseku menší nebo rovna hodnotě trimLength.
trimLength: Pokud je hodnota trimLength větší než 0, pak koncové úseky delší než hodnota trimLength nebudou oříznuty.
Returns: Objekt PolyCurve, který neprotíná sebe sama a s ničím se nepřekrývá