Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Získejte vektor kolmý ke křivce v zadaném parametru mezi objekty StartParameter() a EndParameter() Křivka musí být rovinná. Výsledná normála bude konzistentní napříč celým zakřivením křivky.
param: Parametr, ve kterém vyhodnocovat
side: Pokud je možnost 'strana' nastavena na hodnotu false, normála bude ukazovat směrem doprava od křivky (posun od počátečního bodu ke koncovému bodu křivky). Pokud je možnost 'strana' nastavena na hodnotu true, normála bude ukazovat směrem doleva od křivky.
Returns: Vektor kolmý ke křivce v parametru
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Vrátí body rovnoměrně rozmístěné podél křivky v dané délce úseku od daného bodu.
point: Referenční bod, od kterého měřit
segmentLength: Vzdálenost podél křivky, ve které má být provedeno vyhodnocení
Returns: Seznam bodů na křivce včetně daného bodu a směru křivky.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Získejte parametr v daném bodě podél křivky. Pokud bod není na křivce, objekt ParameterAtPoint bude stále vracet hodnotu, která bude odpovídat blízkému bodu na křivce, bod však obecně není nejbližším bodem.
point: Bod podél nebo poblíž křivky
Returns: Parametr na křivce pro daný bod.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Vytvořte jednu nebo více křivek odsazením rovinné křivky o zadanou vzdálenost v rovině definované normálou roviny. Pokud mezi odsazenými křivkami komponenty existují mezery, budou vyplněny prodloužením křivek odsazení. Vstupní argument „planeNormal“ má jako výchozí hodnotu normálu roviny obsahující křivku, je však možné určit explicitní normálu rovnoběžnou s původní normálou křivky za účelem lepšího řízení směru odsazení. Pokud je například požadován konzistentní směr odsazení u více křivek sdílejících stejnou rovinu, je možné pomocí hodnoty „planeNormal“ přepsat jednotlivé normály křivky a vynutit stejný směr odsazení u všech křivek. Obrácení normály obrází směr odsazení.
signedDistance: Kladná vzdálenost odsazení se použije ve směru vektorového součinu vektoru tečny křivky a normálového vektoru roviny, zatímco záporné odsazení se použije v opačném směru.
planeNormal: Normála roviny křivky. Výchozí hodnotou je normála roviny vstupní křivky
Returns: Jedna nebo více odsazených křivek
thicken,lines
0.5,0.4