Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
Souřadnicový systém objektu BoundingBox.             U kvádru zarovnaného s osami je souřadnicový systém orientován společně s osami X, Y, Z a je umístěn ve středu kvádru.             U kvádru bez zarovnání s osami může mít souřadnicový systém libovolnou orientaci a je vystředěn ke středu kvádru.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Získejte průsečík dvou objektů BoundingBox. Poznámka: Toto nefunguje u objektů, které nejsou zarovnány s osami, protože tyto průsečíky nemusí vytvořit kvádr. Proveďte průnik příslušných kvádrů.
other: Jiný hraniční obdélník k protnutí
Returns: Hraniční obdélník získaný z průniku hraničních obdélníků

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Určete, zda se protínají dva objekty BoundingBox. Poznámka: Toto funguje pouze v případě, že mají oba ohraničující kvádry stejné zarovnání (transformaci). V takových případech vyzkoušejte průnik příslušných kvádrů.
other: Jiný hraniční obdélník
Returns: Protínají se hraniční obdélníky
get overlap