Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Vrátí hodnotu, která určuje, zda je v polygonu obsažen vstupní bod. Pokud není polygon rovinný, bod se promítne na přizpůsobenou rovinu a obsažení se vypočítá pomocí promítání polygonu na přizpůsobenou rovinu. Pokud polygon protíná sebe sama, tato možnost vrátí stav chyby.