Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Ořízne povrch pomocí kolekce jednoho nebo více uzavřených objektů PolyCurve. Jedna ze smyček musí být hraniční smyčka vstupního povrchu. Navíc je nutné přidat jednu nebo více vnitřních smyček pro díry.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Ořízne povrch pomocí kolekce jednoho nebo více uzavřených objektů PolyCurve, které musí všechny ležet na povrchu v rámci zadané tolerance. Pokud je třeba jednu nebo více děr oříznout od vstupního povrchu, musí být pro každou díru určena jedna vnější smyčka pro hranici povrchu a jedna vnitřní smyčka. Pokud je třeba oříznout oblast mezi hranicí povrchu a dírami, je nutné určit pouze smyčku pro každou díru. U periodického povrchu bez vnější smyčky, například kulový povrch, je možné ovládat oříznutou oblast obrácením směru křivky smyčky.
loops: Jeden nebo více uzavřených objektů PolyCurve, které mohou být na vstupu v libovolném pořadí. Tyto smyčky by se neměly vzájemně protínat.
tolerance: Tolerance použitá při rozhodování, zda jsou konce křivky totožné a zda jsou křivka a povrch totožné. Zadaná tolerance nemůže být menší než libovolná tolerance použitá při tvorbě vstupních objektů PolyCurve. Výchozí hodnota 0.0 znamená, že se použije největší tolerance z tolerancí použitých při tvorbě vstupních objektů PolyCurve.
Returns: Povrch oříznutý uzavřenými smyčkami.
trim multiple,removeloops,cutloops