Dynamo.Configuration.PreferenceSettings.IsADPAnalyticsReportingApproved
Indicates whether ADP analytics reporting is approved or not.
Note that this property is called often and the inner call to IsADPOptinIn can be slow sometimes
especially when there is an error involved. And therefore we will only check this once per instance.