Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Utwórz PolyCurve przez połączenie krzywych. Odwraca krzywą, aby utworzyć połączenie. Wybierz preferowaną tolerancję połączenia z zakresu od 1e-6 do 1e-3 jednostek.
curves: Krzywe do połączenia w PolyCurve
joinTolerance: Tolerancja do określenia rozmiaru odstępu dozwolonego między krzywymi do połączenia
trimCurves: Ustaw wartość „True” (Prawda), jeśli krzywe wejściowe przecinają się/nakładają się na siebie i ich segmenty końcowe muszą zostać ucięte przed utworzeniem krzywej PolyCurve. Domyślnie jest ustawiona wartość „False” (Fałsz).
trimLength: Jeśli wartość parametru trimLength jest większa niż 0, segmenty końcowe dłuższe niż wartość trimLength nie zostaną ucięte.
Returns: PolyCurve utworzona przez połączone krzywe
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Utwórz jedną lub więcej krzywych PolyCurve przez zgrupowanie połączonych krzywych. Wybierz preferowaną tolerancję łączenia między 1e-6 a 1e-3 jednostek.
curves: Krzywe do zgrupowania w celu utworzenia jednej lub wielu krzywych PolyCurve
joinTolerance: Tolerancja do określenia rozmiaru odstępu dozwolonego między krzywymi do połączenia
trimCurves: Ustaw wartość „True” (Prawda), jeśli krzywe wejściowe przecinają się/nakładają się na siebie i ich segmenty końcowe muszą zostać ucięte przed utworzeniem krzywej PolyCurve. Domyślnie jest ustawiona wartość „False” (Fałsz).
trimLength: Jeśli wartość parametru trimLength jest większa niż 0, segmenty końcowe dłuższe niż wartość trimLength nie zostaną ucięte.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Utwórz jedną lub więcej krzywych złożonych, odsuwając płaską krzywą złożoną o podaną odległość w płaszczyźnie zdefiniowanej przez wektor normalny płaszczyzny. Argument wejściowy „planeNormal” jest domyślnie ustawiony na wektor normalny płaszczyzny zawierającej krzywą, można jednak podać jawny wektor normalny równoległy do wektora normalnego oryginalnej krzywej, aby lepiej sterować kierunkiem odsunięcia. Na przykład jeśli wymagany jest spójny kierunek odsunięcia dla wielu krzywych współdzielących tę samą płaszczyznę, za pomocą argumentu „planeNormal” można nadpisać poszczególne wektory normalne krzywych i wymusić odsunięcie ich wszystkich w tym samym kierunku. Odwrócenie wektorów normalnych powoduje odwrócenie kierunku odsunięcia.
signedDistance: Dodatnia odległość odsunięcia ma zastosowanie w kierunku iloczynu wektorowego między styczną krzywej PolyCurve a wektorem normalnym płaszczyzny, a ujemna —​ w przeciwnym kierunku.
extendCircular: Jeśli między odsuwanymi krzywymi składowymi znajdują się luki, w zależności od ustawień zamykania luk mogą one zostać wypełnione albo łukami kołowymi (wartość „true” — prawda), aby wytworzyć gładkie narożniki, albo przez wydłużenie (wartość „false” — fałsz) odsuwanych krzywych.
planeNormal: Wektor normalny płaszczyzny krzywej. Domyślnie wektor normalny płaszczyzny krzywej wejściowej
Returns: Jedna lub więcej odsuniętych krzywych złożonych

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Naprawia krzywą PolyCurve z samoprzecięciem przez zwrócenie nowej krzywej bez samoprzecięcia, jeśli długość segmentu z nakładaniem się jest nie większa niż wartość trimLength.
trimLength: Jeśli wartość parametru trimLength jest większa niż 0, segmenty końcowe dłuższe niż wartość trimLength nie zostaną ucięte.
Returns: Krzywa PolyCurve bez samoprzecięcia i bez nakładania się