Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Zwraca informację, czy punkt wejściowy jest zawarty w wieloboku. Jeśli wielobok nie jest płaski, punkt zostanie rzutowany na płaszczyznę najlepszego dopasowania, a jego zawieranie się zostanie obliczone przy użyciu rzutowania wieloboku na tę płaszczyznę najlepszego dopasowania. Jeśli wielobok zawiera samoprzecięcie, zostanie zwrócony stan błędu.