Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
Układ współrzędnych ramki ograniczającej.             W przypadku ramki wyrównanej do osi układ współrzędnych jest zorientowany wzdłuż osi X, Y, Z i znajduje się w środku ramki.             W przypadku ramki niewyrównanej układ współrzędnych może mieć dowolną orientację i jest wyśrodkowany w środku ramki.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Pobierz przecięcie dwóch ramek ograniczających.  Uwaga: nie działa to w przypadku ramek niewyrównanych do osi, ponieważ te przecięcia mogą nie powodować utworzenia ramki. Zamiast tego należy przecinać odpowiadające im prostopadłościany.
other: Inna ramka ograniczająca do przecięcia
Returns: Ramka ograniczająca uzyskana z przecięcia się ramek ograniczających

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Określ, czy dwie ramki ograniczające przecinają się. Uwaga: działa to tylko wtedy, gdy obie ramki ograniczające mają to samo wyrównanie (przekształcenie). W takich przypadkach przetestuj przecięcie między odpowiadającymi im prostopadłościanami.
other: Inna ramka ograniczająca
Returns: Czy ramki ograniczające się przecinają
get overlap