Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Ucina powierzchnię za pomocą kolekcji jednej lub więcej zamkniętych krzywych PolyCurve. Jedna z pętli musi być pętlą obwiedni powierzchni wejściowej. Ponadto należy dodać jedną lub więcej pętli wewnętrznych dla otworów.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Ucina powierzchnię za pomocą kolekcji jednej lub więcej zamkniętych krzywych złożonych, które muszą leżeć na powierzchni w określonej tolerancji. Jeśli trzeba uciąć jeden lub więcej otworów z powierzchni wejściowej, musi istnieć jedna pętla zewnętrzna określona dla obwiedni powierzchni i jedna pętla wewnętrzna dla każdego otworu. Jeśli ma zostać ucięty obszar między obwiednią powierzchni a otworami, należy zapewnić tylko pętle dla poszczególnych otworów. W przypadku powierzchni okresowej bez pętli zewnętrznej, takiej jak powierzchnia sferyczna, można sterować ucinanym obszarem przez odwrócenie kierunku krzywej pętli.
loops: Jedna lub więcej zamkniętych krzywych PolyCurve, które mogą być w dowolnej kolejności w danych wejściowych. Te pętle nie powinny się przecinać.
tolerance: Tolerancja używana podczas określania, czy końce krzywej pokrywają się oraz czy krzywa i powierzchnia pokrywają się. Podana tolerancja nie może być mniejsza niż żadna z tolerancji używanych podczas tworzenia wejściowych krzywych złożonych. Wartość domyślna 0.0 oznacza, że zostanie użyta największa tolerancja używana podczas tworzenia wejściowych krzywych złożonych.
Returns: Powierzchnia ucięta za pomocą pętli zamkniętych.
trim multiple,removeloops,cutloops