Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Pobierz wektor prostopadły do krzywej przy określonym parametrze między StartParameter() a EndParameter(). Krzywa musi być płaska. Wynikowy wektor normalny będzie spójny w całej krzywiźnie krzywej.
param: Parametr, gdzie nastąpi ocena
side: Jeśli parametr „side” (bok) ma ustawienie „fałsz” (fałsz), wektor normalny będzie wskazywać prawą stronę krzywej (od punktu początkowego do punktu końcowego krzywej). Jeśli parametr „side” (bok) ma ustawienie „true” (prawda), wektor normalny będzie wskazywać lewą stronę krzywej.
Returns: Wektor prostopadły do krzywej w param
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Zwraca punkty rozmieszczone równomiernie wzdłuż krzywej na danej długości segmentu od podanego punktu
point: Punkt odniesienia, od którego mierzyć
segmentLength: Odległość wzdłuż krzywej, od której oceniać
Returns: Lista punktów na krzywej, w tym podany punkt, wzdłuż kierunku krzywej.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Pobierz parametr w danym punkcie wzdłuż krzywej. Jeśli punkt nie znajduje się na krzywej, ParameterAtPoint nadal zwraca wartość odpowiadającą bliskiemu punktowi na krzywej, ale punkt ten zwykle nie jest najbliższym punktem.
point: Punkt na krzywej lub blisko krzywej
Returns: Parametr na krzywej dla danego punktu.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Utwórz jedną lub więcej krzywych, odsuwając krzywą płaską o podaną odległość w płaszczyźnie zdefiniowanej przez wektor normalny płaszczyzny. Jeśli między odsuniętymi krzywymi składowymi znajdują się luki, są one wypełniane przez rozciągnięcie odsuniętych krzywych. Argument wejściowy „planeNormal” jest domyślnie ustawiony na wektor normalny płaszczyzny zawierającej krzywą, można jednak podać jawny wektor normalny równoległy do wektora normalnego oryginalnej krzywej, aby lepiej sterować kierunkiem odsunięcia. Na przykład jeśli wymagany jest spójny kierunek odsunięcia dla wielu krzywych współdzielących tę samą płaszczyznę, za pomocą argumentu „planeNormal” można nadpisać poszczególne wektory normalne krzywych i wymusić odsunięcie ich wszystkich w tym samym kierunku. Odwrócenie wektorów normalnych powoduje odwrócenie kierunku odsunięcia.
signedDistance: Dodatnia odległość odsunięcia ma zastosowanie w kierunku iloczynu wektorowego między styczną krzywej a wektorem normalnym płaszczyzny, a ujemna —​ w przeciwnym kierunku.
planeNormal: Wektor normalny płaszczyzny krzywej. Domyślnie wektor normalny płaszczyzny krzywej wejściowej
Returns: Jedna lub więcej odsuniętych krzywych
thicken,lines
0.5,0.4