Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
Rufen Sie einen Vektor lotrecht zur Kurve an einem angegebenen Parameter zwischen StartParameter() und EndParameter() ab. Die Kurve muss planar sein. Die resultierende Normale ist über die gesamte Krümmung der Kurve konsistent.
param: Für die Auswertung zu verwendender Parameter
side: Wenn 'side' auf False gesetzt ist, zeigt die Normale auf die rechte Seite der Kurve (Bewegung vom Start- zum Endpunkt der Kurve). Wenn 'side' auf True gesetzt ist, zeigt die Normale auf die linke Seite der Kurve.
Returns: Vektor lotrecht zu Kurve an Parameter
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
Gibt Punkte in gleichmäßigen Abständen entlang der Kurve mit der angegebenen Segmentlänge vom angegebenen Punkt zurück
point: Bezugspunkt für den Beginn der Messung
segmentLength: Für die Auswertung zu verwendende Entfernung entlang der Kurve
Returns: Liste von Punkten auf der Kurve, einschließlich des angegebenen Punkts und entlang der Richtung der Kurve.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
Rufen Sie den Parameter an einem bestimmten Punkt entlang der Kurve ab. Wenn sich der Punkt nicht auf der Kurve befindet, gibt ParameterAtPoint weiterhin einen Wert zurück, der einem nahegelegenen Punkt auf der Kurve entspricht, aber der Punkt ist im Allgemeinen nicht der nächstgelegene Punkt.
point: Ein Punkt entlang oder in der Nähe der Kurve
Returns: Der Parameter auf der Kurve für den angegebenen Punkt.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
Erstellen Sie eine oder mehrere Kurven durch Versetzen einer planaren Kurve um den angegebenen Abstand in einer Ebene, die durch die Ebenennormale definiert ist. Wenn Lücken zwischen den versetzten Komponentenkurven vorhanden sind, werden diese durch Verlängern der Versatzkurven gefüllt. Das "planeNormal"-Eingabeargument verwendet vorgabemäßig die Normale der Ebene, die die Kurve enthält, aber eine explizite Normale parallel zur ursprünglichen Kurvennormalen kann angegeben werden, um die Richtung des Versatzes besser zu steuern. Ist beispielsweise für mehrere Kurven mit derselben Ebene eine einheitliche Versatzrichtung erforderlich, kann "planeNormal" verwendet werden, um einzelne Kurvennormalen zu überschreiben und zu erzwingen, dass alle Kurven in dieselbe Richtung versetzt werden. Durch Umkehren der Normalen wird die Versatzrichtung umgekehrt.
signedDistance: Ein positiver Versatzabstand gilt in Richtung des Kreuzprodukts zwischen der Kurventangente und dem Normalenvektor der Ebene, während ein negativer Versatz in die entgegengesetzte Richtung angewendet wird.
planeNormal: Die Ebenennormale der Kurve. Vorgabe ist die Ebenennormale der Eingabekurve
Returns: Eine oder mehrere Versatzkurven
thicken,lines
0.5,0.4