Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Erstellt eine PolyCurve durch Verbinden von Kurven. Kehrt die Kurve nach Bedarf um, um die Verbindung sicherzustellen. Wählen Sie eine bevorzugte Gelenktoleranz zwischen 1e-6 und 1e-3 Einheiten aus.
curves: Zur PolyCurve zu verbindende Kurven
joinTolerance: Toleranz zur Bestimmung der zulässigen Spaltgröße zwischen den zu verbindenden Kurven
trimCurves: Legen Sie True fest, wenn die Eingabekurven sich schneiden/überlappen und die Endsegmente vor der Erstellung von PolyCurve gestutzt werden müssen. Die Vorgabe ist False.
trimLength: Wenn trimLength größer als 0 ist, werden Endsegmente, die länger als trimLength sind, nicht gestutzt.
Returns: Polykurve aus verbundenen Kurven erstellt
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
Erstellen Sie eine oder mehrere Polykurven, indem Sie verbundene Kurven gruppieren. Wählen Sie eine bevorzugte Verbindungstoleranz zwischen 1e-6 und 1e-3 Einheiten aus.
curves: Kurven, die zu einer oder mehreren PolyCurves gruppiert werden sollen
joinTolerance: Toleranz zur Bestimmung der zulässigen Spaltgröße zwischen den zu verbindenden Kurven
trimCurves: Legen Sie True fest, wenn die Eingabekurven sich schneiden/überlappen und die Endsegmente vor der Erstellung von PolyCurve gestutzt werden müssen. Die Vorgabe ist False.
trimLength: Wenn trimLength größer als 0 ist, werden Endsegmente, die länger als trimLength sind, nicht gestutzt.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
Erstellen Sie eine oder mehrere Polykurven durch Versetzen einer planaren Polykurve um den angegebenen Abstand in einer Ebene, die durch die Ebenennormale definiert ist. Das "planeNormal"-Eingabeargument verwendet vorgabemäßig die Normale der Ebene, die die Kurve enthält, aber eine explizite Normale parallel zur ursprünglichen Kurvennormalen kann angegeben werden, um die Versatzrichtung besser zu steuern. Ist beispielsweise für mehrere Kurven mit derselben Ebene eine einheitliche Versatzrichtung erforderlich, kann "planeNormal" verwendet werden, um einzelne Kurvennormalen zu überschreiben und zu erzwingen, dass alle Kurven in dieselbe Richtung versetzt werden. Durch Umkehren der Normalen wird die Versatzrichtung umgekehrt.
signedDistance: Ein positiver Versatzabstand gilt in Richtung des Kreuzprodukts zwischen der Tangente der Polykurve und dem Normalenvektor der Ebene, während ein negativer Versatz in die entgegengesetzte Richtung angewendet wird.
extendCircular: Wenn Lücken zwischen den versetzten Komponentenkurven vorhanden sind, können diese je nach den Lückenschluss-Einstellungen entweder durch Kreisbogen (Wert True), um glatte Ecken zu erhalten, oder durch Erweitern (Wert False) der Versatzkurven gefüllt werden.
planeNormal: Die Ebenennormale der Kurve. Vorgabe ist die Ebenennormale der Eingabekurve
Returns: Eine oder mehrere versetzte Polykurven

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
Korrigiert eine sich selbst schneidende PolyCurve, indem eine neue, sich nicht selbst schneidende PolyCurve zurückgegeben wird, wenn die überlappende Segmentlänge kleiner oder gleich trimLength ist.
trimLength: Wenn trimLength größer als 0 ist, werden Endsegmente, die länger als trimLength sind, nicht gestutzt.
Returns: Sich nicht selbst schneidende, nicht überlappende PolyCurve