Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
Gibt zurück, ob ein eingegebener Punkt im Polygon enthalten ist. Wenn das Polygon nicht planar ist, wird der Punkt auf die Ebene mit bester Passung projiziert und die Begrenzung wird mithilfe der Projektion des Polygons auf die Ebene mit bester Passung berechnet. Dies gibt einen Fehlerstatus zurück, wenn sich das Polygon selbst schneidet.