Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
Stutzt die Oberfläche mit einer Sammlung von einer oder mehreren geschlossenen PolyCurves. Eine der Konturen muss die Begrenzungskontur der eingegebenen Oberfläche sein. Außerdem müssen eine oder mehrere innere Konturen für Löcher hinzugefügt werden.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
Stutzt die Oberfläche mit einer Sammlung von einer oder mehreren geschlossenen PolyCurves, die sich alle auf der Oberfläche innerhalb der angegebenen Toleranz befinden müssen. Wenn ein oder mehrere Löcher von der eingegebenen Oberfläche gestutzt werden müssen, muss eine äußere Kontur für die Begrenzung der Oberfläche und eine innere Kontur für jedes Loch angegeben werden. Wenn der Bereich zwischen der Oberflächenbegrenzung und dem Loch bzw. den Löchern gestutzt werden muss, sollte nur die Kontur für jedes Loch bereitgestellt werden. Um eine periodische Oberfläche ohne äußere Kontur, wie z. B. eine kugelförmige Fläche, zu erhalten, kann der gestutzte Bereich gesteuert werden, indem die Richtung der Konturkurve umgekehrt wird.
loops: Eine oder mehrere geschlossene PolyCurves, die in der Eingabe eine beliebige Reihenfolge aufweisen können. Diese Konturen sollten sich nicht schneiden.
tolerance: Die Toleranz, die verwendet wird, um zu entscheiden, ob die Kurvenenden koinzident sind und ob eine Kurve und eine Oberfläche koinzident sind. Die angegebene Toleranz darf nicht kleiner sein als die Toleranzen, die bei der Erstellung der eingegebenen Polykurven verwendet wurden. Der Vorgabewert 0.0 bedeutet, dass die größte Toleranz verwendet wird, die bei der Erstellung der eingegebenen Polykurven angewendet wird.
Returns: Oberfläche, die durch geschlossene Konturen gestutzt wurde.
trim multiple,removeloops,cutloops