Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
Das CoordinateSystem des BoundingBox.             Bei einem an der Achse ausgerichteten Quader ist das Koordinatensystem entlang der X-, Y- und Z-Achsen ausgerichtet und befindet sich in der Mitte des Quaders.             Bei einem nicht ausgerichteten Quader kann das Koordinatensystem eine beliebige Ausrichtung haben und ist in der Mitte des Quaders zentriert.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
Rufen Sie den Schnittpunkt zweier BoundingBoxes ab. Anmerkung: Dies funktioniert nicht bei nicht an Achsen ausgerichteten Rahmen, da diese Schnittpunkte möglicherweise keinen Rahmen ergeben. Schneiden Sie stattdessen die entsprechenden Quader.
other: Anderer zu schneidender Begrenzungsrahmen
Returns: Begrenzungsrahmen, der aus dem Schnittpunkt der Begrenzungsrahmen ermittelt wurde

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
Bestimmen Sie, ob sich zwei BoundingBoxes schneiden. Anmerkung: Dies funktioniert nur, wenn beide Begrenzungsrahmen dieselbe Ausrichtung (Transformation) haben. In solchen Fällen testen Sie den Schnittpunkt zwischen den entsprechenden Quadern.
other: Anderer Begrenzungsrahmen
Returns: Schnittpunkte der Begrenzungsrahmen ermitteln
get overlap