Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
곡선을 결합하여 PolyCurve를 작성합니다. 연결이 필요한 경우 곡선을 반전합니다. 1e-6 ~ 1e-3 유닛 사이에서 기본 결합 공차를 선택합니다.
curves: PolyCurve에 결합할 곡선
joinTolerance: 결합할 곡선 간에 허용되는 간격 크기를 결정하는 공차
trimCurves: 입력 곡선이 서로 교차하거나 겹치고 PolyCurve를 작성하기 전에 끝 세그먼트를 잘라내야 하면 True로 설정합니다. 기본적으로 False로 설정되어 있습니다.
trimLength: trimLength가 0보다 크면 trimLength보다 긴 끝 세그먼트는 잘리지 않습니다.
Returns: 결합된 곡선으로 작성된 Polycurve
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
연결된 곡선을 그룹화하여 하나 이상의 polycurve를 만듭니다. 1e-6과 1e-3 단위 사이의 기본 결합 공차를 선택하십시오.
curves: 하나 이상의 PolyCurves를 만들기 위해 함께 그룹화할 곡선
joinTolerance: 결합할 곡선 간에 허용되는 간격 크기를 결정하는 공차
trimCurves: 입력 곡선이 서로 교차하거나 겹치고 PolyCurve를 작성하기 전에 끝 세그먼트를 잘라내야 하면 True로 설정합니다. 기본적으로 False로 설정되어 있습니다.
trimLength: trimLength가 0보다 크면 trimLength보다 긴 끝 세그먼트는 잘리지 않습니다.

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
평면 법선으로 정의된 평면에서 지정된 거리만큼 평면형 polycurve를 간격띄우기하여 하나 이상의 Polycurve를 작성합니다. "planeNormal" 입력 인수는 기본적으로 곡선을 포함하는 평면의 법선으로 지정되지만, 원래 곡선 법선에 평행한 명시적 법선이 간격띄우기 방향을 보다 잘 제어할 수 있도록 제공될 수 있습니다. 예를 들어 동일한 평면을 공유하는 여러 곡선에 대해 일관된 방향으로 간격띄우기를 해야 하는 경우, 'planeNormal'을 사용하여 각각의 곡선 법선을 재지정하고 모든 곡선을 동일한 방향으로 강제로 간격띄우기할 수 있습니다. 법선을 반전하면 간격띄우기의 방향이 반대가 됩니다.
signedDistance: 양수 간격띄우기 거리는 polycurve의 접선과 평면의 법선 벡터 사이의 외적 방향으로 적용되는 반면 음수 간격띄우기는 반대 방향으로 적용됩니다.
extendCircular: 간격띄우기 구성요소 곡선 사이에 간격이 있으면 간격 마무리 설정에 따라 원형 호로 부드러운 구석을 만들거나(true 값) 간격띄우기 곡선을 연장하여(false 값) 간격을 채울 수 있습니다.
planeNormal: 곡선의 평면 법선. 기본값은 입력 곡선의 평면 법선입니다.
Returns: 하나 이상의 간격띄우기 polycurve

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
겹치는 세그먼트 길이가 trimLength보다 작거나 같은 경우 자체 교차하지 않는 새 PolyCurve를 반환하여 자체 교차하는 PolyCurve를 수정합니다.
trimLength: trimLength가 0보다 크면 trimLength보다 긴 끝 세그먼트는 잘리지 않습니다.
Returns: 자체 교차하지 않고 겹치지 않는 PolyCurve