Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
하나 이상의 닫힌 PolyCurves 모음을 사용하여 표면을 자릅니다. 루프 중 하나는 입력 표면의 경계 루프여야 합니다. 또한 구멍에 대해 하나 이상의 내부 루프를 추가해야 합니다.
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
지정된 공차 내에서 모두 표면에 있어야 하는 하나 이상의 닫힌 PolyCurve 모음을 사용하여 표면을 자릅니다. 입력 표면에서 하나 이상의 구멍을 잘라내야 하는 경우 표면의 경계에 대해 하나의 외부 루프를 지정하고 각 구멍에 대해 하나의 내부 루프를 지정해야 합니다. 표면 경계와 구멍 사이의 영역을 잘라야 하는 경우 각 구멍에 대한 루프만 제공해야 합니다. 구형 표면과 같은 외부 루프가 없는 주기 표면의 경우 잘린 영역은 루프 곡선의 방향을 반전하여 제어할 수 있습니다.
loops: 입력에서 임의의 순서로 있을 수 있는 하나 이상의 닫힌 PolyCurve입니다. 이러한 루프는 서로 교차하면 안 됩니다.
tolerance: 곡선 끝이 일치하는지 여부와 곡선과 표면이 일치하는지를 확인할 때 사용되는 공차입니다. 제공된 공차는 입력 polycurve 작성에 사용된 공차보다 작을 수 없습니다. 기본값 0.0은 입력 polycurve 작성에 사용된 최대 공차가 사용된다는 것을 의미합니다.
Returns: 닫힌 루프에 의해 잘린 표면.
trim multiple,removeloops,cutloops