Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
BoundingBox의 CoordinateSystem.             축에 정렬된 상자의 경우 CS는 X, Y, Z축을 따라 방향이 지정되고 상자의 중심에 위치합니다.             정렬되지 않은 상자의 경우 CS는 임의의 방향이 지정될 수 있으며 상자의 중심에 위치합니다.

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
두 BoundingBox의 교차점을 가져옵니다. 주: 축이 정렬되지 않은 상자의 경우 이러한 교차점으로 인해 상자가 작성되지 않을 수 있으므로 이 기능은 작동하지 않습니다. 대신 해당 직육면체를 교차시키십시오.
other: 교차할 다른 경계 상자
Returns: 경계 상자의 교차점에서 가져온 경계 상자

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
두 BoundingBox가 교차하는지 여부를 확인합니다. 주: 이 기능은 두 경계 상자의 정렬(변환)이 동일한 경우에만 작동합니다. 이러한 경우 해당 직육면체 간의 교차점을 테스트하십시오.
other: 기타 경계 상자
Returns: 경계 상자가 교차함
get overlap