Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
입력 점이 다각형 내에 포함되어 있는지 여부를 반환합니다. 다각형이 평면형이 아닌 경우 해당 점이 최적 맞춤 평면에 투영되고 최적 맞춤 평면에 대한 다각형 투영을 사용하여 제약이 계산됩니다. 다각형이 자체 교차하는 경우 실패 상태가 반환됩니다.