Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
StartParameter()와 EndParameter() 사이의 지정된 매개변수에서 곡선에 수직인 벡터를 가져옵니다. 곡선은 평면형이어야 합니다. 결과 법선은 곡선의 전체 곡률에서 일관됩니다.
param: 매개변수 평가 위치
side: 'side'가 false로 설정되면 법선이 곡선의 오른쪽을 가리킵니다(시작점에서 곡선의 끝점으로 이동). 'side'가 true이면 법선이 곡선의 왼쪽을 가리킵니다.
Returns: 매개변수에서 곡선과 수직인 벡터
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
지정된 점으로부터 지정된 세그먼트 길이의 곡선을 따라 균등한 간격으로 있는 점을 반환합니다.
point: 측정할 위치에 있는 참조 점
segmentLength: 평가할 곡선을 기준으로 하는 거리
Returns: 지정된 점을 포함하여 곡선의 방향을 따르는 곡선에 있는 점 리스트.

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
곡선을 따라 지정된 점에서 매개변수를 가져옵니다. 점이 곡선에 없으면 ParameterAtPoint는 곡선의 가까운 점에 해당하는 값을 반환하지만 이 점은 일반적으로 가장 가까운 점이 아닙니다.
point: 곡선을 따라 있는 점 또는 곡선 근처에 있는 점
Returns: 지정된 점에 대한 곡선의 매개변수.
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
평면 법선으로 정의된 평면에서 지정된 거리만큼 평면형 곡선을 간격띄우기하여 하나 이상의 곡선을 작성합니다. 간격띄우기 구성요소 곡선 사이에 간격이 있으면 해당 간격은 간격띄우기 곡선을 확장하여 채워집니다. "planeNormal" 입력 인수는 기본적으로 곡선을 포함하는 평면의 법선으로 지정되지만, 원래 곡선 법선에 평행인 명시적 법선이 간격띄우기 방향을 보다 잘 제어할 수 있도록 제공될 수 있습니다. 예를 들어, 동일한 평면을 공유하는 여러 곡선에 대해 일정한 방향으로 간격띄우기를 해야 하는 경우 "planeNormal"을 사용하여 각각의 곡선 법선을 재지정하고 모든 곡선을 동일한 방향으로 강제로 간격띄우기할 수 있습니다. 법선을 반전하면 간격띄우기의 방향이 반대가 됩니다.
signedDistance: 양수 간격띄우기 거리는 곡선의 접선과 평면의 법선 벡터 사이의 외적 방향으로 적용되는 반면 음수 간격띄우기는 반대 방향으로 적용됩니다.
planeNormal: 곡선의 평면 법선. 기본값은 입력 곡선의 평면 법선입니다.
Returns: 하나 이상의 간격띄우기 곡선
thicken,lines
0.5,0.4