Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
サーフェスを、1 つまたは複数の閉じたポリカーブの集合でトリムします。その中の 1 つのループを入力サーフェスの境界ループにする必要があります。また、穴には 1 つまたは複数の内側のループを追加する必要があります。
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
1 つまたは複数の閉じたポリカーブの集合でサーフェスをトリムします。すべてのポリカーブは指定した許容値内でサーフェス上に存在する必要があります。入力されたサーフェスから 1 つまたは複数の穴をトリムする必要がある場合は、サーフェスの境界用に 1 つの外側のループを指定し、穴ごとに 1 つの内側のループを指定する必要があります。サーフェス境界と穴の間の領域をトリムする必要がある場合は、各穴のループのみを指定する必要があります。球面のサーフェスなど、外側のループがない周期的なサーフェスの場合は、ループの曲線の方向を反転することでトリムされる領域をコントロールできます。
loops: 任意の順序で入力できる 1 つまたは複数の閉じたポリカーブ。これらのループが互いに交差しないようにする必要があります。
tolerance: 曲線の終端が一致するかどうか、および曲線とサーフェスが一致するかどうかを判断する際に使用する許容値。入力されたポリカーブの作成に使用された許容値よりも小さい許容値を入力することはできません。既定値の 0.0 では、入力されたポリカーブの作成に使用された最大許容値が使用されます。
Returns: 閉じたループでトリムされたサーフェス。
trim multiple,removeloops,cutloops