Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
StartParameter()から EndParameter()までの範囲内の指定されたパラメータで曲線に直交するベクトルを取得します。曲線が平面状になっている必要があります。曲線の曲率全体で一貫性のある法線が作成されます。
param: 評価するパラメータ
side: 'side' が false に設定されている場合、法線は曲線の右側を向きます(曲線の始点から終点まで)。'side' が true の場合、法線は曲線の左側を向きます。
Returns: パラメータ上で曲線に直交するベクトル
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
指定された点を基準として、指定されたセグメントの長さまで、曲線上に等間隔に配置された点群を返します
point: 計測元となる参照点
segmentLength: 評価する曲線上の距離
Returns: 曲線の方向に沿った、指定された点を含む曲線上の点のリスト。

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
曲線に沿った指定された点でパラメータを取得します。点が曲線上にない場合でも、ParameterAtPoint は曲線上の近い点に対応する値を返しますが、通常この点は最も近い点ではありません。
point: 曲線に沿っているか近くにある点
Returns: 曲線上の指定された点のパラメータ。
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
平面の法線で定義された平面で、平面曲線を指定された距離だけオフセットして、1 つまたは複数の曲線を作成します。オフセットされたコンポーネント曲線間にギャップがある場合は、オフセットされた曲線を延長してそのギャップを埋めます。既定では、入力引数「planeNormal」は曲線を含む平面の法線に設定されますが、元の曲線の法線に平行な明示的な法線となるため、オフセットの方向を簡単にコントロールできます。たとえば、同じ平面を共有している複数の曲線のオフセット方向を一致させる必要がある場合に「planeNormal」を使用すると、個々の曲線の法線を変更し、すべての曲線を強制的に同じ方向にオフセットできます。法線を反転すると、オフセットの方向が反転します。
signedDistance: 正のオフセット距離は、曲線の接線と平面の法線ベクトルの外積の方向に適用され、負のオフセット距離はその反対の方向に適用されます。
planeNormal: 曲線の平面法線。既定では入力された曲線の平面法線に設定されます
Returns: 1 つまたは複数のオフセットされた曲線
thicken,lines
0.5,0.4