Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
曲線を結合してポリカーブを作成します。接続性の必要に応じて曲線を反転します。優先される結合の許容値を 1e-6 から 1e-3 までの単位で選択します。
curves: ポリカーブに結合する曲線
joinTolerance: 結合する曲線間で使用できるギャップのサイズを判断するための許容値
trimCurves: 入力された曲線が互いに交差または重複しており、ポリカーブを作成する前に終端セグメントをトリムする必要がある場合は、True に設定します。既定では False に設定されています。
trimLength: trimLength が 0 より大きい場合、trimLength より長い終端セグメントはトリムされません。
Returns: 結合された曲線によって作成されたポリカーブ
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
接続された曲線をグループ化して、1 つまたは複数のポリカーブを作成します。優先される結合の許容値を 1e-6 から 1e-3 までの単位で選択します。
curves: グループ化して 1 つまたは複数のポリカーブを作成する曲線
joinTolerance: 結合する曲線間で使用できるギャップのサイズを判断するための許容値
trimCurves: 入力された曲線が互いに交差または重複しており、ポリカーブを作成する前に終端セグメントをトリムする必要がある場合は、True に設定します。既定では False に設定されています。
trimLength: trimLength が 0 より大きい場合、trimLength より長い終端セグメントはトリムされません。

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
平面の法線で定義された平面で、平面ポリカーブを指定された距離だけオフセットして、1 つまたは複数のポリカーブを作成します。既定では、入力引数「planeNormal」は曲線を含む平面の法線に設定されますが、元の曲線の法線に平行な明示的な法線となるため、オフセットの方向を簡単にコントロールできます。たとえば、同じ平面を共有している複数の曲線のオフセット方向を一致させる必要がある場合に「planeNormal」を使用すると、個々の曲線の法線を変更し、すべての曲線を強制的に同じ方向にオフセットできます。法線を反転すると、オフセットの方向が反転します。
signedDistance: 正のオフセット距離は、ポリカーブの接線と平面の法線ベクトルの外積の方向に適用され、負のオフセット距離はその反対の方向に適用されます。
extendCircular: オフセットされたコンポーネント曲線間にギャップがある場合は、ギャップを埋める処理の設定に応じて、円弧で埋めて滑らかなコーナーにする(true 値の場合)か、オフセットされた曲線を延長して埋める(false 値の場合)ことができます。
planeNormal: 曲線の平面法線。既定では入力された曲線の平面法線に設定されます
Returns: 1 つまたは複数のオフセットされたポリカーブ

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
重複しているセグメントの長さが trimLength 以下の場合に、自己交差していない新しいポリカーブを返すことで、自己交差しているポリカーブを修復します。
trimLength: trimLength が 0 より大きい場合、trimLength より長い終端セグメントはトリムされません。
Returns: 自己交差も重複もしていないポリカーブ