Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
BoundingBox の座標系。             軸に位置合わせされたボックスの場合、座標系は X、Y、Z 軸に合わせて方向が設定され、ボックスの中心に配置されます。             位置合わせされていないボックスの場合、座標系は方向を任意に設定でき、その中心がボックスの中心に配置されます。

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
2 つの BoundingBox の交差を取得します。注: 軸に位置合わせされていないボックスの場合は、交差がボックスにならない可能性があるため、これは機能しません。代わりに、対応する立方体を交差させます。
other: 交差するその他の境界ボックス
Returns: 境界ボックスの交差から取得された境界ボックス

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
2 つの BoundingBox が交差しているかどうかを判断します。注: これは、両方の境界ボックスの位置合わせ(変換)が同じ場合にのみ機能します。該当する場合は、対応する立方体間の交差をテストします。
other: その他の境界ボックス
Returns: 境界ボックスの交差を実行する
get overlap