Autodesk.DesignScript.Geometry.Polygon.ContainmentTest(Autodesk.DesignScript.Geometry.Point)
入力された点がポリゴン内に含まれているかどうかを返します。ポリゴンが平面でない場合、点は最適フィット平面に投影され、ポリゴンをこの最適フィット平面に投影することで含まれているかどうかが計算されます。ポリゴンが自己交差している場合は、失敗したというステータスを返します。