Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve})
使用一條或多條封閉的 PolyCurve 的集合修剪曲面。其中一個迴路必須是輸入曲面的邊界迴路。此外，還需要為孔加入一個或多個內迴路。
trim multiple,removeloops,cutloops

Autodesk.DesignScript.Geometry.Surface.TrimWithEdgeLoops(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.PolyCurve},System.Double)
使用一條或多條封閉的 PolyCurve 的集合修剪曲面，這些 PolyCurve 必須全部位於指定公差範圍內的曲面上。如果需要從輸入曲面修剪一個或多個孔，則必須為曲面邊界指定一個外迴路，並為每個孔指定一個內迴路。如果需要修剪曲面邊界與孔之間的區域，則只能為每個孔提供迴路。如果是沒有外迴路 (例如球形曲面) 的週期性曲面，可以透過反轉迴路曲線的方向來控制修剪的區域。
loops: 一條或多條封閉的 PolyCurve，在輸入中可以任何順序排列。這些迴路彼此不應相交。
tolerance: 決定曲線端點是否重合以及曲線和曲面是否重合時使用的公差。提供的公差不能小於建立輸入 PolyCurve 時使用的任何公差。預設值 0.0 表示將使用建立輸入 PolyCurve 時使用的最大公差。
Returns: 被封閉迴路修剪的曲面。
trim multiple,removeloops,cutloops