Autodesk.DesignScript.Geometry.PolyCurve.ByJoinedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
透過接合曲線製作 PolyCurve。請視需要翻轉曲線以進行連接。在 1e-6 與 1e-3 個單位之間選擇您偏好的接合公差。
curves: 接合至 polycurve 的曲線
joinTolerance: 決定要接合的曲線之間所允許的間隙大小的公差
trimCurves: 如果輸入曲線彼此相交/重疊，並且需要在建立 PolyCurve 之前修剪其端點線段，則設定為 True。預設設定為 False。
trimLength: 如果 trimLength 大於 0，則不修剪比 trimLength 長的端點線段。
Returns: 透過接合的曲線建立的 PolyCurve
segments,joincurves

Autodesk.DesignScript.Geometry.PolyCurve.ByGroupedCurves(System.Collections.Generic.IEnumerable{Autodesk.DesignScript.Geometry.Curve},System.Double,System.Boolean,System.Double)
透過群組連接的曲線來製作一條或多條 PolyCurve。在 1e-6 和 1e-3 單位之間選擇一個偏好的接合公差。
curves: 要群組在一起以建立一條或多條 PolyCurves 的曲線
joinTolerance: 決定要接合的曲線之間所允許的間隙大小的公差
trimCurves: 如果輸入曲線彼此相交/重疊，並且需要在建立 PolyCurve 之前修剪其端點線段，則設定為 True。預設設定為 False。
trimLength: 如果 trimLength 大於 0，則不修剪比 trimLength 長的端點線段。

Autodesk.DesignScript.Geometry.PolyCurve.OffsetMany(System.Double,System.Boolean,Autodesk.DesignScript.Geometry.Vector)
透過在平面法線定義的平面中將平面 PolyCurve 偏移給定距離來建立一條或多條 PolyCurve。「planeNormal」輸入引數預設為包含曲線的平面法線，但可提供與原始曲線法線平行的明確法線，更能控制偏移方向。例如，如果共用相同平面的多條曲線需要一致的偏移方向，可以使用「planeNormal」取代個別曲線法線，並強制所有曲線沿相同方向偏移。反轉法線會反轉偏移的方向。
signedDistance: 正偏移距離會沿 PolyCurve 切線和平面法線向量之間的向量積方向套用，負偏移則沿相反方向套用。
extendCircular: 如果偏移組成曲線之間有間隙，則根據間隙封閉設定，可透過圓弧 (true 值) 產生平滑轉角來填滿，或透過延伸 (false 值) 偏移曲線來填滿。
planeNormal: 曲線的平面法線。預設為輸入曲線的平面法線
Returns: 一條或多條偏移 PolyCurve

Autodesk.DesignScript.Geometry.PolyCurve.Heal(System.Double)
如果重疊線段長度小於或等於 trimLength，則透過傳回非自身相交的新 PolyCurve 來修復自身相交的 PolyCurve。
trimLength: 如果 trimLength 大於 0，則不修剪比 trimLength 長的端點線段。
Returns: 非自身相交、非重疊的 PolyCurve