Autodesk.DesignScript.Geometry.BoundingBox.ContextCoordinateSystem
BoundingBox 的 CoordinateSystem。             如果是與軸對齊的框，CS 會朝向 X、Y、Z 軸，並位於框的中心。             如果是不對齊的框，CS 可以是任意方位，並位於框的中心。

Autodesk.DesignScript.Geometry.BoundingBox.Intersection(Autodesk.DesignScript.Geometry.BoundingBox)
取得兩個 BoundingBox 的交點。注意事項: 這不適用於不與軸對齊的框，因為這些交點可能不會產生框，而是其對應的立方體相交。
other: 要相交的其他邊界框
Returns: 從邊界框的交點取得的邊界框

Autodesk.DesignScript.Geometry.BoundingBox.Intersects(Autodesk.DesignScript.Geometry.BoundingBox)
決定兩個 BoundingBox 是否相交。注意事項: 這只適用於兩個邊界框都有相同的對齊方式 (轉換)。此時會測試其對應立方體之間的交點。
other: 其他邊界框
Returns: 邊界框是否相交
get overlap