Autodesk.DesignScript.Geometry.Curve.NormalAtParameter(System.Double,System.Boolean)
在 StartParameter() 和 EndParameter() 之間的指定參數處取得與曲線互垂的向量。曲線必須在同一平面。產生的法線在曲線的整個曲率範圍內將保持一致。
param: 要於其演算的參數
side: 如果「side」設為 false，法線將指向曲線的右側 (從曲線的起點移動到終點)。如果「side」為 true，法線將指向曲線的左側。
Returns: 於參數處垂直於曲線的向量
normaloncurve,curvenorm

Autodesk.DesignScript.Geometry.Curve.PointsAtSegmentLengthFromPoint(Autodesk.DesignScript.Geometry.Point,System.Double)
傳回曲線上從給定點開始，距離相等給定線段長度的點
point: 從測量位置的參考點
segmentLength: 沿著曲線要於其演算的距離
Returns: 曲線上包括給定點和沿曲線方向的點的清單。

Autodesk.DesignScript.Geometry.Curve.ParameterAtPoint(Autodesk.DesignScript.Geometry.Point)
取得沿曲線給定點處的參數。如果點不在曲線上，則 ParameterAtPoint 仍會傳回一個值，該值將對應於曲線上的鄰近點，但該點一般而言不是最近的點。
point: 沿著曲線或曲線附近的點
Returns: 曲線上給定點的參數。
projectpoint,closestparam,curveparam

Autodesk.DesignScript.Geometry.Curve.OffsetMany(System.Double,Autodesk.DesignScript.Geometry.Vector)
透過在平面法線定義的平面中將平面曲線偏移給定距離來建立一條或多條曲線。如果偏移組成曲線之間有間隙，則會延伸偏移曲線來填滿這些曲線。「planeNormal」輸入引數預設為包含曲線的平面法線，但可提供與原始曲線法線平行的明確法線，更能控制偏移方向。例如，如果共用相同平面的多條曲線需要一致的偏移方向，可以使用「planeNormal」取代個別曲線法線，並強制所有曲線沿相同方向偏移。反轉法線會反轉偏移的方向。
signedDistance: 正偏移距離會沿曲線切線和平面法線向量之間的向量積方向套用，負偏移則沿相反方向套用。
planeNormal: 曲線的平面法線。預設為輸入曲線的平面法線
Returns: 一條或多條偏移曲線
thicken,lines
0.5,0.4